Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/dev/pip-virtualenv.po
Languages: fr

source: Further Configuration of Pip and Virtualenv
fr: Configuration supplémentaire de Pip et Virtualenv

source: Requiring an active virtual environment for ``pip``
fr: Obliger l'utilisation d'un environnement virtuel actif pour ``pip``

source: By now it should be clear that using virtual environments is a great way to keep your development environment clean and keeping different projects' requirements separate.
fr: Maintenant, il devrait être clair que l'utilisation d'environnements virtuels est une excellente façon de garder votre environnement de développement propre et de garder les 'requirements' des différents projets distincts.

source: When you start working on many different projects, it can be hard to remember to activate the related virtual environment when you come back to a specific project. As a result of this, it is very easy to install packages globally while thinking that you are actually installing the package for the virtual environment of the project. Over time this can result in a messy global package list.
fr: Lorsque vous commencez à travailler sur de nombreux projets différents, il peut être difficile de se rappeler d'activer l'environnement virtuel associé quand vous revenez à un projet spécifique. De ce fait, il est très facile d'installer des paquets globalement tout en pensant que vous installez vraiment le paquet pour l'environnement virtuel du projet. Au fil du temps, cela peut se traduire par une liste globale de paquets désordonnée.

source: In order to make sure that you install packages to your active virtual environment when you use ``pip install``, consider adding the following two lines to your :file:`~/.bashrc` file:
fr: Pour vous assurer que vous installez des paquets dans votre environnement virtuel actif lorsque vous utilisez ``pip install``, envisagez d'ajouter les deux lignes suivantes à votre fichier :file:`~/.bashrc`:

source: After saving this change and sourcing the :file:`~/.bashrc` file with ``source ~/.bashrc``, pip will no longer let you install packages if you are not in a virtual environment. If you try to use ``pip install`` outside of a virtual environment pip will gently remind you that an activated virtual environment is needed to install packages.
fr: Après avoir enregistré ce changement et rechargé le fichier :file:`~/.bashrc` avec ``source ~/.bashrc``, pip ne vous laissera plus installer des paquets si vous n'êtes pas dans un environnement virtuel. Si vous essayez d'utiliser ``pip install`` en dehors d'un environnement virtuel, pip va gentiment vous rappeler qu'un environnement virtuel actif est nécessaire pour installer des paquets.

source: You can also do this configuration by editing your :file:`pip.conf` or :file:`pip.ini` file. :file:`pip.conf` is used by Unix and Mac OS X operating systems and it can be found at:
fr: Vous pouvez également faire cette configuration en éditant votre fichier :file:`pip.conf` ou :file:`pip.ini`. :file:`pip.conf` est utilisé par les systèmes d'exploitation Unix et Mac OS X et il peut être trouvé dans:

source: Similarly, the :file:`pip.ini` file is used by Windows operating systems and it can be found at:
fr: De même, le fichier :file:`pip.ini` est utilisé par les systèmes d'exploitations Windows et peut trouvé dans:

source: If you don't have a :file:`pip.conf` or :file:`pip.ini` file at these locations, you can create a new file with the correct name for your operating system.
fr: Si vous n'avez pas de fichiers a :file:`pip.conf` ou :file:`pip.ini` dans ces emplacements, vous pouvez créer un nouveau fichier avec le nom correct pour votre système d'exploitation.

source: If you already have a configuration file, just add the following line under the ``[global]`` settings to require an active virtual environment:
fr: Si vous avez déjà un fichier de configuration, ajoutez juste la ligne suivante à sous la configuration ``[global]`` pour obliger l'usage d'un environnement virtuel actif:

source: If you did not have a configuration file, you will need to create a new one and add the following lines to this new file:
fr: Si vous n'avez pas un fichier de configuration, vous devrez en créer un nouveau et ajouter les lignes suivantes à votre nouveau fichier:

source: You will of course need to install some packages globally (usually ones that you use across different projects consistently) and this can be accomplished by adding the following to your :file:`~/.bashrc` file:
fr: Vous aurez bien sûr besoin d'installer certains paquets globalement (généralement ceux que vous utilisez dans différents projets systématiquement) et cela peut être accompli en ajoutant ce qui suit à votre fichier :file:`~/.bashrc`:

source: After saving the changes and sourcing your :file:`~/.bashrc` file you can now install packages globally by running ``gpip install``. You can change the name of the function to anything you like, just keep in mind that you will have to use that name when trying to install packages globally with pip.
fr: Après avoir sauvé les changements et rechargé votre fichier :file:`~/.bashrc`, vous pouvez maintenant installer des paquets globalement en exécutant ``gpip install``. Vous pouvez changer le nom de la fonction à votre guise, gardez juste à l'esprit que vous devrez utiliser ce nom lorsque vous essayerez d'installer des paquets globalement avec pip.

source: Caching packages for future use
fr: Mettre en cache les paquets pour les utilisations futures

source: Every developer has preferred libraries and when you are working on a lot of different projects, you are bound to have some overlap between the libraries that you use. For example, you may be using the ``requests`` library in a lot of different projects.
fr: Chaque développeur a ses bibliothèques préférées et quand vous travaillez sur un grand nombre de projets différents, vous êtes amenés à avoir un certain chevauchement entre les bibliothèques que vous utilisez. Par exemple, vous utilisez peut-être la bibliothèque ``requests`` dans un grand nombre de projets différents.

source: It is surely unnecessary to re-download the same packages/libraries each time you start working on a new project (and in a new virtual environment as a result). Fortunately, you can configure pip in such a way that it tries to reuse already installed packages.
fr: Il est certainement inutile de retélécharger les mêmes paquets/bibliothèques chaque fois que vous commencez à travailler sur un nouveau projet (et dans un nouvel environnement virtuel par conséquent). Heureusement, vous pouvez configurer pip de manière à ce qu'il essaie de réutiliser les paquets déjà installés.

source: On UNIX systems, you can add the following line to your :file:`.bashrc` or :file:`.bash_profile` file.
fr: Sur les systèmes UNIX, vous pouvez ajouter la ligne suivante à votre fichier :file:`.bashrc` ou :file:`.bash_profile`.

source: You can set the path to anywhere you like (as long as you have write access). After adding this line, ``source`` your :file:`.bashrc` (or :file:`.bash_profile`) file and you will be all set.
fr: Vous pouvez définir les chemins n'importe où (à partir du moment où vous avez les droits en écriture). Après avoir ajouté cette ligne, faites un ``source`` de votre fichier :file:`.bashrc` (ou :file:`.bash_profile`) et vous serez fin prêt.

source: Another way of doing the same configuration is via the :file:`pip.conf` or :file:`pip.ini` files, depending on your system. If you are on Windows, you can add the following line to your :file:`pip.ini` file under ``[global]`` settings:
fr: Une autre manière de faire la même configuration est via les fichiers :file:`pip.conf` ou :file:`pip.ini`, selon votre système d'exploitation. Si vous êtes sous Windows, vous pouvez ajouter la ligne suivante à votre fichier :file:`pip.ini` sous la configuration ``[global]``:

source: Similarly, on UNIX systems you should simply add the following line to your :file:`pip.conf` file under ``[global]`` settings:
fr: De même, sur les systèmes UNIX, vous devriez simplement ajouter la ligne suivante à votre fichier :file:`pip.conf` sous la configuration ``[global]``:

source: Even though you can use any path you like to store your cache, it is recommended that you create a new folder *in* the folder where your :file:`pip.conf` or :file:`pip.ini` file lives. If you don't trust yourself with all of this path voodoo, just use the values provided here and you will be fine.
fr: Même si vous pouvez utiliser le chemin que vous voulez pour stocker votre cache, il est recommandé que vous créiez un nouveau dossier *dans* le dossier où votre fichier :file:`pip.conf` ou :file:`pip.ini` est situé. Si vous ne vous faites pas confiance complètement sur cette utilisation obscure des chemins, il suffit d'utiliser les valeurs fournies ici et tout ira bien.
