Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/dev/virtualenvs.po
Languages: fr

source: Virtual Environments
fr: Environnements virtuels

source: A Virtual Environment is a tool to keep the dependencies required by different projects in separate places, by creating virtual Python environments for them. It solves the "Project X depends on version 1.x but, Project Y needs 4.x" dilemma, and keeps your global site-packages directory clean and manageable.
fr: Un environnement virtuel est un outil pour garder les dépendances requises par différents projets dans des places séparées, en créant des environnements virtuels Python pour eux. Il résout le dilemme "le projet X dépend de la version 1.x mais le projet Y nécessite la 4.x", et garde votre répertoire site-packages global propre et gérable.

source: For example, you can work on a project which requires Django 1.3 while also maintaining a project which requires Django 1.0.
fr: Par exemple, vous pouvez travailler sur un projet qui nécessite Django 1.3 tout en maintenant aussi un projet qui nécessite Django 1.0.

source: `virtualenv <http://pypi.python.org/pypi/virtualenv>`_ is a tool to create isolated Python environments. virtualenv creates a folder which contains all the necessary executables to use the packages that a Python project would need.
fr: `virtualenv <http://pypi.python.org/pypi/virtualenv>`_ est un outil pour créer des environnements virtuels Python isolés. virtualenv crée un dossier qui contient tous les exécutables nécessaires pour utiliser les paquets qu'un projet Python pourrait nécessiter.

source: Install virtualenv via pip:
fr: Installez virtualenv via pip:

source: Basic Usage
fr: Usage basique

source: Create a virtual environment for a project:
fr: Créez un environnement virtuel pour un projet:

source: ``virtualenv venv`` will create a folder in the current directory which will contain the Python executable files, and a copy of the ``pip`` library which you can use to install other packages. The name of the virtual environment (in this case, it was ``venv``) can be anything; omitting the name will place the files in the current directory instead.
fr: ``virtualenv venv` créera un dossier dans le répertoire courant qui contiendra les fichiers exécutables Python, et une copie de la bibliothèque ``pip`` que vous pouvez utiliser pour installer d'autres paquets. Le nom de l'environnement virtuel (dans ce cas, c'était ``venv``) peut être n'importe quoi. Omettre le nom placera les fichiers dans le répertoire courant à la place.

source: This creates a copy of Python in whichever directory you ran the command in, placing it in a folder named :file:`venv`.
fr: Cela crée une copie de Python selon le répertoire où vous avez exécuté la commande, en le plaçant dans un dossier nommé :file:`venv`.

source: You can also use a Python interpreter of your choice.
fr: Vous pouvez utiliser un interpréteur Python de votre choix.

source: This will use the Python interpreter in :file:`/usr/bin/python2.7`
fr: Cela utilisera l'interpréteur Python dans :file:`/usr/bin/python2.7`

source: To begin using the virtual environment, it needs to be activated:
fr: Pour commencer à utiliser l'environnement virtuel, il doit être activé:

source: The name of the current virtual environment will now appear on the left of the prompt (e.g. ``(venv)Your-Computer:your_project UserName$)`` to let you know that it's active. From now on, any package that you install using pip will be placed in the ``venv`` folder, isolated from the global Python installation.
fr: Le nom de l'environnement virtuel actuel apparaît maintenant sur la gauche de l'invite (c'est à dire ``(venv)Votre-Ordinateur:votre projet VotreNomUtilisateur$)`` pour vous indiquer qu'il est actif. A partir de maintenant, tous les paquets que vous installez en utilisant pip seront placés dans le dossier ``venv``, isolés de l'installation globale de Python.

source: Install packages as usual, for example:
fr: Installez les paquets comme d'habitude, par exemple:

source: If you are done working in the virtual environment for the moment, you can deactivate it:
fr: Si vous avez terminé de travailler dans l'environnement virtuel pour le moment, vous pouvez le désactiver:

source: This puts you back to the system's default Python interpreter with all its installed libraries.
fr: Cela vous fait revenir à l'interpréteur par défaut Python du système, avec toutes ses bibliothèques installées.

source: To delete a virtual environment, just delete its folder. (In this case, it would be ``rm -rf venv``.)
fr: Pour supprimer une environnement virtuel, supprimez juste son dossier. (Dans ce cas, ce serait ``rm -rf venv``.)

source: After a while, though, you might end up with a lot of virtual environments littered across your system, and its possible you'll forget their names or where they were placed.
fr: Après un certain temps, cependant, vous pourriez vous retrouver avec un grand nombre d'environnements virtuels un peu partout dans votre système, et il est possible que vous oubliez leurs noms ou où ils ont été placés.

source: Other Notes
fr: Autres notes

source: Running ``virtualenv`` with the option :option:`--no-site-packages` will not include the packages that are installed globally. This can be useful for keeping the package list clean in case it needs to be accessed later. [This is the default behavior for ``virtualenv`` 1.7 and later.]
fr: Exécuter ``virtualenv`` avec l'option :option:`--no-site-packages` n’inclura pas les paquets qui sont installés globalement. Cela peut être utile pour garder la liste des paquets propre dans le cas où il est nécessaire d'y accéder plus tard. [Ceci est le comportement par défaut de ``virtualenv`` 1.7 et supérieur.]

source: In order to keep your environment consistent, it's a good idea to "freeze" the current state of the environment packages. To do this, run
fr: Afin de garder votre environnement cohérent, c'est une bonne idée de "geler" l'état actuel des paquets de l'environnement. Pour ce faire, exécutez

source: This will create a :file:`requirements.txt` file, which contains a simple list of all the packages in the current environment, and their respective versions. You can see the list of installed packages without the requirements format using "pip list". Later it will be easier for a different developer (or you, if you need to re-create the environment) to install the same packages using the same versions:
fr: Cela va créer un fichier :file:`requirements.txt`, qui contient une liste simple de tous les paquets qui sont dans l'environnement actuel, et leurs versions respectives.Vous pouvez voir la liste des paquets installés sans le format requirements en utilisant "pip list". Plus tard, il sera plus facile pour un développeur différent (ou vous, si vous avez besoin de recréer l'environnement) d'installer les paquets en utilisant les mêmes versions:

source: This can help ensure consistency across installations, across deployments, and across developers.
fr: Cela peut aider à assurer la cohérence entre installations, entre déploiements et entre développeurs.

source: Lastly, remember to exclude the virtual environment folder from source control by adding it to the ignore list.
fr: Enfin, rappelez-vous d'exclure le dossier de l'environnement virtuel du gestionnaire de version en l'ajoutant à la liste des fichiers ignorés.

source: `virtualenvwrapper <http://virtualenvwrapper.readthedocs.org/en/latest/index.html>`_ provides a set of commands which makes working with virtual environments much more pleasant. It also places all your virtual environments in one place.
fr: `virtualenvwrapper <http://virtualenvwrapper.readthedocs.org/en/latest/index.html>`_ fournit un jeu de commandes qui permet le travail avec des environnements virtuels beaucoup plus agréable. Il place également tous vos environnements virtuels dans un seul endroit.

source: To install (make sure **virtualenv** is already installed):
fr: Pour installer (assurez-vous que **virtualenv** est déjà installé):

source: (`Full virtualenvwrapper install instructions <http://virtualenvwrapper.readthedocs.org/en/latest/install.html>`_.)
fr: (`Instructions d'installation virtualenvwrapper complètes <http://virtualenvwrapper.readthedocs.org/en/latest/install.html>`_.)

source: For Windows, you can use the `virtualenvwrapper-win <https://github.com/davidmarble/virtualenvwrapper-win/>`_.
fr: Pour Windows, vous pouvez utiliser le `virtualenvwrapper-win <https://github.com/davidmarble/virtualenvwrapper-win/>`_.

source: In Windows, the default path for WORKON_HOME is %USERPROFILE%\Envs
fr: Sous Windows, le chemin par défaut pour WORKON_HOME est %USERPROFILE%\Envs

source: Create a virtual environment:
fr: Créez un environnement virtuel:

source: This creates the :file:`venv` folder inside :file:`~/Envs`.
fr: Cela créé un dossier :file:`venv` dans :file:`~/Envs`.

source: Work on a virtual environment:
fr: Travailler sur un environnement virtuel:

source: Alternatively, you can make a project, which creates the virtual environment, and also a project directory inside ``$PROJECT_HOME``, which is ``cd`` -ed into when you ``workon myproject``.
fr: Alternativement, vous pouvez faire un projet, ce qui crée un environnement virtuel, et aussi un répertoire de projet à l'intérieur de ``$PROJECT_HOME``, dans lequel vous êtes automatiquement placé via ``cd`` quand vous lancez ``workon myproject``.

source: **virtualenvwrapper** provides tab-completion on environment names. It really helps when you have a lot of environments and have trouble remembering their names.
fr: **virtualenvwrapper** fournit une auto-complétion à la tabulation sur les noms d'environnement. Il aide vraiment quand vous avez beaucoup d'environnements et avez du mal vous souvenir de leurs noms.

source: ``workon`` also deactivates whatever environment you are currently in, so you can quickly switch between environments.
fr: ``workon`` désactive aussi n'importe quel des environnements où vous êtes actuellement, de sorte que vous pouvez rapidement basculer entre les environnements.

source: Deactivating is still the same:
fr: La désactivation est toujours la même:

source: To delete:
fr: Pour supprimer:

source: Other useful commands
fr: Autres commandes utiles

source: List all of the environments.
fr: Lister tous les environnements

source: Navigate into the directory of the currently activated virtual environment, so you can browse its :file:`site-packages`, for example.
fr: Naviguez dans le répertoire de l'environnement virtuel actuellement activé, de sorte que vous pouvez parcourir son :file:`site-packages`, par exemple.

source: Like the above, but directly into :file:`site-packages` directory.
fr: Come ci-dessus, mais directement dans le répertoire :file:`site-packages`.

source: Shows contents of :file:`site-packages` directory.
fr: Montre le contenu du répertoire :file:`site-packages`.

source: `Full list of virtualenvwrapper commands <http://virtualenvwrapper.readthedocs.org/en/latest/command_ref.html>`_.
fr: Liste complète des commandes de virtualenvwrapper <http://virtualenvwrapper.readthedocs.org/en/latest/command_ref.html>`_.

source: With `virtualenv-burrito <https://github.com/brainsik/virtualenv-burrito>`_, you can have a working virtualenv + virtualenvwrapper environment in a single command.
fr: Avec `virtualenv-burrito <https://github.com/brainsik/virtualenv-burrito>`_, vous pouvez avoir un environnement de travail virtualenv + virtualenvwrapper en une seule commande.

source: When you ``cd`` into a directory containing a :file:`.env`, `autoenv <https://github.com/kennethreitz/autoenv>`_ automagically activates the environment.
fr: Quand vous faites un ``cd`` dans un répertoire contenant un :file:`.env`, `autoenv <https://github.com/kennethreitz/autoenv>`_ active l'environment automatiquement, par magie .

source: Install it on Mac OS X using ``brew``:
fr: Installez-le sous Mac OS X en utilisant ``brew``:

source: And on Linux:
fr: Et sous Linux:
