Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/starting/install/osx.po
Languages: fr

source: Installing Python on Mac OS X
fr: Installation de Python sous Mac OS X

source: The latest version of Mac OS X, El Capitan, **comes with Python 2.7 out of the box**.
fr: La dernière version de Mac OS X, El Capitan, **vient avec Python 2.7 par défaut**.

source: You do not need to install or configure anything else to use Python. Having said that, I would strongly recommend that you install the tools and libraries described in the next section before you start building Python applications for real-world use. In particular, you should always install Setuptools, as it makes it much easier for you to use other third-party Python libraries.
fr: Vous n'avez pas besoin d'installer ou de configurer quoi que ce soit pour utiliser Python. Cela dit, je recommande fortement que vous installiez les outils et les bibliothèques décrites dans la prochaine section avant que vous démarriez à construire des applications Python pour un usage dans le monde réel. En particulier, vous devriez toujours installer Setuptools, comme il rend plus facile pour vous d'utiliser d'autres bibliothèques Python tierces.

source: The version of Python that ships with OS X is great for learning but it's not good for development. The version shipped with OS X may be out of date from the `official current Python release <https://www.python.org/downloads/mac-osx/>`_, which is considered the stable production version.
fr: La version de Python qui est livrée avec OS X est bien pour apprendre mais elle n'est pas bonne pour le développement. La version livrée avec OS X peut être dépassée par rapport à `la version officielle courante de Python <https://www.python.org/downloads/mac-osx/>`_, qui est considérée comme la version de production stable.

source: Doing it Right
fr: Bien faire les choses

source: Let's install a real version of Python.
fr: Installons une vraie version de Python.

source: Before installing Python, you'll need to install GCC. GCC can be obtained by downloading `Xcode <http://developer.apple.com/xcode/>`_, the smaller `Command Line Tools <https://developer.apple.com/downloads/>`_ (must have an Apple account) or the even smaller `OSX-GCC-Installer <https://github.com/kennethreitz/osx-gcc-installer#readme>`_ package.
fr: Avant l'installation de Python, vous devrez avoir installé GCC. GCC peut être obtenu en téléchargeant `Xcode <http://developer.apple.com/xcode/>`_, en plus léger, `Command Line Tools <https://developer.apple.com/downloads/>`_ (vous devez avoir un compte Apple) ou bien le paquet encore plus petit`OSX-GCC-Installer <https://github.com/kennethreitz/osx-gcc-installer#readme>`_.

source: If you already have Xcode installed, do not install OSX-GCC-Installer. In combination, the software can cause issues that are difficult to diagnose.
fr: Si vous avez déjà Xcode installé, n'installez pas OSX-GCC-Installer. En association, le logiciel peut causer des problèmes qui sont difficiles à diagnostiquer.

source: If you perform a fresh install of Xcode, you will also need to add the commandline tools by running ``xcode-select --install`` on the terminal.
fr: Si vous effectuez une installation fraîche de Xcode, vous devrez aussi ajoutez les outils de la ligne de commande en exécutant ``xcode-select --install`` dans le terminal.

source: While OS X comes with a large number of UNIX utilities, those familiar with Linux systems will notice one key component missing: a decent package manager. `Homebrew <http://brew.sh>`_ fills this void.
fr: Bien que OS X vienne avec de nombreux utilitaires UNIX, ceux familiers avec les systèmes d'exploitation Linux remarquerons qu'un composant clé est manquant: un gestionnaire de paquet décent. `Homebrew <http://brew.sh>`_ comblera ce manque.

source: To `install Homebrew <http://brew.sh/#install>`_, open :file:`Terminal` or your favorite OSX terminal emulator and run
fr: Pour `installer Homebrew <http://brew.sh/#install>`_, ouvrez le :file:`Terminal` ou votre émulateur de terminal OSX favori et exécutez

source: The script will explain what changes it will make and prompt you before the installation begins. Once you've installed Homebrew, insert the Homebrew directory at the top of your :envvar:`PATH` environment variable. You can do this by adding the following line at the bottom of your :file:`~/.profile` file
fr: Ce script va expliquer quels changements il fera et vous demander avant de que l'installation commence. Un fois que vous avez installé Homebrew, insérez le répertoire Homebrew en haut de votre variable d'environnement :envvar:`PATH`. Vous pouvez faire ceci en ajoutant la ligne qui suit à la fin de votre fichier :file:`~/.profile`

source: Now, we can install Python 2.7:
fr: Maintenant, nous pouvons installer Python 2.7:

source: This will take a minute or two.
fr: Cela va prendre une minute ou deux.

source: Homebrew installs Setuptools and ``pip`` for you.
fr: Homebrew installe Setuptools et ``pip`` pour vous.

source: Setuptools enables you to download and install any compliant Python software over a network (usually the Internet) with a single command (``easy_install``). It also enables you to add this network installation capability to your own Python software with very little work.
fr: Setuptools vous permet de télécharger et d'installer n'importe quel logiciel conforme à Python via un réseau (généralement Internet) avec une seule commande (``easy_install``). Il vous permet aussi d'ajouter cette capacité d'installation par le réseau à votre propre logiciel Python avec très peu de travail.

source: ``pip`` is a tool for easily installing and managing Python packages, that is recommended over ``easy_install``. It is superior to ``easy_install`` in `several ways <https://python-packaging-user-guide.readthedocs.org/en/latest/pip_easy_install/#pip-vs-easy-install>`_, and is actively maintained.
fr: ``pip`` est un outil pour installer et gérer facilement des paquets Python, qui est recommandé plutôt que ``easy_install``. Il est supérieur à ``easy_install`` de `plusieurs manières <https://python-packaging-user-guide.readthedocs.org/en/latest/pip_easy_install/#pip-vs-easy-install>`_, et est activement maintenu.

source: Virtual Environments
fr: Environnements virtuels

source: A Virtual Environment is a tool to keep the dependencies required by different projects in separate places, by creating virtual Python environments for them. It solves the "Project X depends on version 1.x but, Project Y needs 4.x" dilemma, and keeps your global site-packages directory clean and manageable.
fr: Un environnement virtuel est un outil pour garder les dépendances requises par différent projets dans des places séparées, en créant des environnements virtuels Python pour eux. Il résout le dilemme "le projet X dépend de la version 1.x mais le projet Y nécessite la 4.x", et garde votre répertoire site-packages global propre et gérable.

source: For example, you can work on a project which requires Django 1.3 while also maintaining a project which requires Django 1.0.
fr: Par exemple, vous pouvez travailler sur un projet qui nécessite Django 1.3 tout en maintenant aussi un projet qui nécessite Django 1.0.

source: To start using this and see more information: :ref:`Virtual Environments <virtualenvironments-ref>` docs.
fr: Pour commencer à utiliser cela et plus d'informations: documentation sur les :ref:`environnements virtuels <virtualenvironments-ref>`.

source: This page is a remixed version of `another guide <http://www.stuartellis.eu/articles/python-development-windows/>`_, which is available under the same license.
fr: Cette page est une version remixée d'un `autre guide <http://www.stuartellis.eu/articles/python-development-windows/>`_, qui est disponible sous la même licence.
