Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/starting/install/win.po
Languages: fr

source: Installing Python on Windows
fr: Installation de Python sous Windows

source: First, download the `latest version <https://www.python.org/ftp/python/2.7.10/python-2.7.10.msi>`_ of Python 2.7 from the official Website. If you want to be sure you are installing a fully up-to-date version, click the Downloads > Windows link from the home page of the `Python.org web site <http://python.org>`_ .
fr: En premier, téléchargez la `dernière version <https://www.python.org/ftp/python/2.7.12/python-2.7.12.amd64.msi>`_ de Python 2.7 depuis le site web officiel. Si vous voulez vous assurez que vous installez une version complètement à jour, cliquez sur le lien Downloads > Windows depuis la page d'accueil `du site web Python.org <http://python.org>`_ .

source: The Windows version is provided as an MSI package. To install it manually, just double-click the file. The MSI package format allows Windows administrators to automate installation with their standard tools.
fr: La version Windows est fournie comme un paquet MSI. Pour l'installer manuellement, faites juste un double-clic sur le fichier. Le format de fichier MSI permet aux administrateurs Windows d'automatiser l'installation avec leurs outils standards.

source: By design, Python installs to a directory with the version number embedded, e.g. Python version 2.7 will install at :file:`C:\\Python27\\`, so that you can have multiple versions of Python on the same system without conflicts. Of course, only one interpreter can be the default application for Python file types. It also does not automatically modify the :envvar:`PATH` environment variable, so that you always have control over which copy of Python is run.
fr: Par sa conception, Python installe un répertoire avec le numéro de version intégré, c'est à dire que la version 2.7 de Python s'installera dans :file:`C:\\Python27\\`. Ainsi, vous pouvez avoir de multiples version de Python sur le même système, sans conflits. Bien sûr, un seule interpréteur peut être assigné comme application par défaut pour les fichiers de type Python. Il ne modifie pas non plus automatiquement la variable d'environnement :envvar:`PATH`, si bien que vous avez toujours le contrôle sur quelle copie de Python est exécutée.

source: Typing the full path name for a Python interpreter each time quickly gets tedious, so add the directories for your default Python version to the :envvar:`PATH`. Assuming that your Python installation is in :file:`C:\\Python27\\`, add this to your :envvar:`PATH`:
fr: Taper le chemin complet de l'interpréteur Python chaque fois devient rapidement lassant. Ajoutez ainsi les répertoires pour votre version de Python par défaut à la variable d'environnement :envvar:`PATH`. En assumant que votre installation Python est dans :file:`C:\\Python27\\`, ajoutez ceci à votre :envvar:`PATH`:

source: You can do this easily by running the following in ``powershell``:
fr: Vous pouvez faire cela facilement en exécutant ce qui suit dans ``powershell``:

source: The second (:file:`Scripts`) directory receives command files when certain packages are installed, so it is a very useful addition. You do not need to install or configure anything else to use Python. Having said that, I would strongly recommend that you install the tools and libraries described in the next section before you start building Python applications for real-world use. In particular, you should always install Setuptools, as it makes it much easier for you to use other third-party Python libraries.
fr: Le second répertoire (:file:`Scripts`) reçoit des fichiers de commande quand certains paquets sont installés. C'est ainsi un ajout très utile. Vous n'aurez pas besoin d'installer ou de configurer quoi que ce soit d'autre pour utiliser Python. Cela dit, je recommande fortement que vous installiez les outils et les bibliothèques décrites dans la prochaine section avant que vous démarriez à construire des applications Python pour un usage dans le monde réel. En particulier, vous devriez toujours installer Setuptools, comme il rend plus facile pour vous d'utiliser d'autres bibliothèques Python tierces.

source: The most crucial third-party Python software of all is Setuptools, which extends the packaging and installation facilities provided by the distutils in the standard library. Once you add Setuptools to your Python system you can download and install any compliant Python software product with a single command. It also enables you to add this network installation capability to your own Python software with very little work.
fr: Le logiciel tiers de Python le plus crucial de tous est Setuptools, qui étend les capacités de packaging et d'installation fournies par distutils dans la bibliothèque standard. Une fois que vous avez ajouté Setuptools à votre système Python, vous pouvez télécharger et installer n'importe quel produit logiciel conforme à Python avec un seule commande. Setuptools vous permet de télécharger et d'installer n'importe quel logiciel conforme à Python via un réseau (généralement Internet) avec une seule commande (``easy_install``). Il vous permet aussi d'ajouter cette capacité d'installation par le réseau à votre propre logiciel Python avec très peu de travail.

source: To obtain the latest version of Setuptools for Windows, run the Python script available here: `ez_setup.py <https://bitbucket.org/pypa/setuptools/raw/bootstrap/ez_setup.py>`_
fr: Pour obtenir la dernière version de Setuptools pour Windows, exécutez le script Python disponible ici: `ez_setup.py <https://bitbucket.org/pypa/setuptools/raw/bootstrap/ez_setup.py>`_

source: You'll now have a new command available to you: **easy_install**. It is considered by many to be deprecated, so we will install its replacement: **pip**. Pip allows for uninstallation of packages, and is actively maintained, unlike easy_install.
fr: Vous avez maintenant une nouvelle commande à votre disposition: **easy_install**. Elle est considérée par beaucoup comme étant dépréciée. Ainsi, nous allons installer son remplaçant : **pip**. Pip permet la désinstallation de paquets et est activement maintenu, contrairement à easy_install.

source: To install pip, run the Python script available here: `get-pip.py <https://raw.github.com/pypa/pip/master/contrib/get-pip.py>`_
fr: Pour installer pip, exécutez le script Python disponible ici: `get-pip.py <https://raw.github.com/pypa/pip/master/contrib/get-pip.py>`_

source: Virtual Environments
fr: Environnements virtuels

source: A Virtual Environment is a tool to keep the dependencies required by different projects in separate places, by creating virtual Python environments for them. It solves the "Project X depends on version 1.x but, Project Y needs 4.x" dilemma, and keeps your global site-packages directory clean and manageable.
fr: Un environnement virtuel est un outil pour garder les dépendances requises par différents projets dans des places séparées, en créant des environnements virtuels Python pour eux. Il résout le dilemme "le projet X dépend de la version 1.x mais le projet Y nécessite la 4.x", et garde votre répertoire site-packages global propre et gérable.

source: For example, you can work on a project which requires Django 1.3 while also maintaining a project which requires Django 1.0.
fr: Par exemple, vous pouvez travailler sur un projet qui nécessite Django 1.3 tout en maintenant aussi un projet qui nécessite Django 1.0.

source: To start using this and see more information: :ref:`Virtual Environments <virtualenvironments-ref>` docs.
fr: Pour commencer à utiliser cela et plus d'informations: documentation sur les :ref:`environnements virtuels <virtualenvironments-ref>`.

source: This page is a remixed version of `another guide <http://www.stuartellis.eu/articles/python-development-windows/>`_, which is available under the same license.
fr: Cette page est une version remixée d'un `autre guide <http://www.stuartellis.eu/articles/python-development-windows/>`_, qui est disponible sous la même licence.
