Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/notes/styleguide.po
Languages: fr

source: The Guide Style Guide
fr: Le guide de style du guide

source: As with all documentation, having a consistent format helps make the document more understandable. In order to make The Guide easier to digest, all contributions should fit within the rules of this style guide where appropriate.
fr: Comme avec toute documentation, avoir un format consistant aide à rendre le document plus compréhensible. Afin de rendre ce guide plus facile à assimiler, toutes les contributions doivent se tenir aux règles de ce guide de style, le cas échéant.

source: The Guide is written as :ref:`restructuredtext-ref`.
fr: Le guide est écrit avec du :ref:`restructuredtext-ref`.

source: Parts of The Guide may not yet match this style guide. Feel free to update those parts to be in sync with The Guide Style Guide
fr: Des parties du guide peuvent ne pas respecter encore le guide de style. N'hésitez pas à mettre à jour ces parties pour les mettre en conformité avec le guide de style du guide.

source: On any page of the rendered HTML you can click "Show Source" to see how authors have styled the page.
fr: Sur n'importe quelle page du HTML rendu, vous pouvez cliquer "Afficher le code source de la page" pour voir comment les auteurs ont stylé la page.

source: Relevancy
fr: Pertinence

source: Strive to keep any contributions relevant to the :ref:`purpose of The Guide <about-ref>`.
fr: Efforcez-vous de garder toutes les contributions relatives aux :ref:`but du guide <about-ref>`.

source: Avoid including too much information on subjects that don't directly relate to Python development.
fr: Évitez d'inclure trop d'information sur des sujets qui ne sont pas directement liés au développement Python.

source: Prefer to link to other sources if the information is already out there. Be sure to describe what and why you are linking.
fr: Préférez faire un lien vers d'autres sources si l'information est déjà sortie. Assurez-vous de décrire quoi et pourquoi vous faites un lien.

source: `Cite <http://sphinx.pocoo.org/rest.html?highlight=citations#citations>`_ references where needed.
fr: `Citez <http://sphinx.pocoo.org/rest.html?highlight=citations#citations>`_ les références quand c'est nécessaire.

source: If a subject isn't directly relevant to Python, but useful in conjunction with Python (e.g., Git, GitHub, Databases), reference by linking to useful resources, and describe why it's useful to Python.
fr: Si un sujet n'est pas directement pertinent pour Python, mais est utile en conjonction avec Python (c'est à dire Git, GitHub, les bases de données), référencez en faisant un lien vers des ressources utiles, et décrivez pourquoi c'est utile pour Python.

source: When in doubt, ask.
fr: En cas de doute, demandez.

source: Headings
fr: Rubriques

source: Use the following styles for headings.
fr: Utilisez les styles suivants pour les rubriques.

source: Chapter title:
fr: Titre du chapitre:

source: Page title:
fr: Titre de page:

source: Section headings:
fr: Rubriques de la section:

source: Sub section headings:
fr: Rubriques de la sous-section:

source: Wrap text lines at 78 characters. Where necessary, lines may exceed 78 characters, especially if wrapping would make the source text more difficult to read.
fr: Faites des retours à la ligne à 78 caractères. Quand c'est nécessaire, les lignes peuvent dépasser 78 caractères, particulièrement si faire des retours à la ligne rend le texte source plus difficile à lire.

source: Use of the `serial comma <https://en.wikipedia.org/wiki/Serial_comma>`_ (also known as the Oxford comma) is 100% non-optional. Any attempt to submit content with a missing serial comma will result in permanent banishment from this project, due to complete and total lack of taste.
fr: Utilisez `la virgule de série <https://en.wikipedia.org/wiki/Serial_comma>`_ (aussi connue comme la virgule d'Oxford) est 100% non-optionnel. Toute tentative pour soumettre un contenu avec une virgule manquante donnera lieu à un bannissement permanent de ce projet, pour cause d'absence complète et totale de goût.

source: Banishment? Is this a joke? Hopefully we will never have to find out.
fr: Bannissement? C'est une blague? Nous espérons ne jamais avoir à le découvrir.

source: Code Examples
fr: Exemples de code

source: Wrap all code examples at 70 characters to avoid horizontal scrollbars.
fr: Faites des retours à la ligne à 70 caractères pour tous les exemples de code, pour éviter des barres de défilement horizontales.

source: Command line examples:
fr: Exemples de ligne de commande:

source: Be sure to include the ``$`` prefix before each line.
fr: Assurez-vous d'inclure le préfixe ``$`` avant chaque ligne.

source: Python interpreter examples:
fr: Exemples d'interpréteur Python:

source: Python examples:
fr: Exemples d'interpréteur Python:

source: Externally Linking
fr: Liens externes

source: Prefer labels for well known subjects (ex: proper nouns) when linking:
fr: Préférez des étiquettes pour les sujets biens connus (ex: des noms complets) quand vous faites des liens:

source: Prefer to use descriptive labels with inline links instead of leaving bare links:
fr: Préférez utiliser des étiquettes descriptives pour les liens "inline" plutôt que de laisser des liens en brut:

source: Avoid using labels such as "click here", "this", etc. preferring descriptive labels (SEO worthy) instead.
fr: Evitez d'utiliser des étiquettes comme "cliquez ici", "ceci", etc. Préférez des étiquettes descriptives (notamment pour le référencement) à la place.

source: Linking to Sections in The Guide
fr: Liens vers des sections dans le guide

source: To cross-reference other parts of this documentation, use the `:ref: <http://sphinx.pocoo.org/markup/inline.html#cross-referencing-arbitrary-locations>`_ keyword and labels.
fr: Pour faire des références croisées à d'autres parties de cette documentation, utilisez mot-clé et étiquettes `:ref: <http://sphinx.pocoo.org/markup/inline.html#cross-referencing-arbitrary-locations>`_.

source: To make reference labels more clear and unique, always add a ``-ref`` suffix:
fr: Pour faire référence aux étiquettes plus claires et uniques, ajoutez toujours un suffixe``-ref``:

source: Notes and Warnings
fr: Notes et alertes

source: Make use of the appropriate `admonitions directives <http://sphinx.pocoo.org/rest.html#directives>`_ when making notes.
fr: Utilisez `les directives d'admonitions <http://sphinx.pocoo.org/rest.html#directives>`_ appropriées quand vous ajoutez des notes.

source: Warnings:
fr: Alertes:

source: Please mark any incomplete areas of The Guide with a `todo directive <http://sphinx.pocoo.org/ext/todo.html?highlight=todo#directive-todo>`_. To avoid cluttering the :ref:`todo-list-ref`, use a single ``todo`` for stub documents or large incomplete sections.
fr: Merci de marquer tous les endroits incomplets du guide avec une `directive todo <http://sphinx.pocoo.org/ext/todo.html?highlight=todo#directive-todo>`_. Pour éviter d'encombrer la :ref:`todo-list-ref`, utilisez un seul ``todo`` pour les bouts de code ou les sections incomplètes importantes.
