Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/starting/which-python.po
Languages: fr

source: Picking an Interpreter
fr: Choisir un interpréteur

source: The State of Python (2 vs 3)
fr: L'état de Python (2 vs 3)

source: When choosing a Python interpreter, one looming question is always present: "Should I choose Python 2 or Python 3"? The answer is not as obvious as one might think.
fr: Quand vous choisissez un interpréteur Python, une question imminente est toujours présente: "Dois-je choisir Python 2 ou Python 3"? La réponse n'est pas toujours aussi évidente que l'on pourrait penser.

source: The basic gist of the state of things is as follows:
fr: L'essentiel à retenir de l'état des choses est comme suivant:

source: Python 2.7 has been the standard for a *long* time.
fr: Python 2.7 a été le standard depuis un temps assez *long*.

source: Python 3 introduced major changes to the language, which many developers are unhappy with.
fr: Python 3 a introduit des changements majeurs dans le langage, avec lesquels de nombreux développeurs ne sont pas contents.

source: Python 2.7 will receive necessary security updates until 2020 [#pep373_eol]_.
fr: Python 2.7 recevra des mises à jour de sécurité nécessaires jusqu'en 2020 [#pep373_eol]_.

source: Python 3 is continually evolving, like Python 2 did in years past.
fr: Python 3 évolue constamment, comme Python 2 l'a fait dans le passé.

source: So, you can now see why this is not such an easy decision.
fr: Ainsi, vous pouvez maintenant voir pourquoi ce n'est pas une décision aussi facile.

source: Recommendations
fr: Recommandations

source: I'll be blunt:
fr: Je vais être franc:

source: **Use Python 3 if...**
fr: **Utilisez Python 3 si...**

source: You don't care.
fr: Vous vous en moquez.

source: You love Python 3.
fr: Vous adorez Python 3.

source: You are indifferent towards 2 vs 3.
fr: Vous êtes indifférent vis à vis de 2 vs 3.

source: You don't know which one to use.
fr: Vous ne savez pas lequel utiliser.

source: You embrace change.
fr: Vous embrassez le changement.

source: **Use Python 2 if...**
fr: **Utilisez Python 2 si...**

source: You love Python 2 and are saddened by the future being Python 3.
fr: Vous adorez Python 2 et êtes attristé par le fait que le futur soit Python 3.

source: The stability requirements of your software would be improved by a language and runtime that never changes.
fr: Les prérequis de stabilité de votre logiciel seraient améliorés par un langage et un moteur d'exécution qui ne change jamais.

source: Software that you depend on requires it.
fr: Un logiciel dont vous dépendez le nécessite.

source: So.... 3?
fr: Ainsi... 3?

source: If you're choosing a Python interpreter to use, and aren't opinionated, then I recommend you use the newest Python 3.x, since every version brings new and improved standard library modules, security and bug fixes. Progress is progress.
fr: Si vous choisissez un interpréteur Python à utiliser, et que vous n'avez pas d'opinions arrêtées, alors je vous recommande d'utiliser la dernière version de Python 3.x, comme chaque version apporte des modules de la bibliothèque standard nouveaux et améliorés, des corrections de bug et de sécurité. Le progrès est le progrès.

source: Given such, only use Python 2 if you have a strong reason to, such as a Python 2 exclusive library which has no adequate Python 3 ready alternative, or you (like me) absolutely love and are inspired by Python 2.
fr: Avec ces éléments, utilisez seulement Python 2 si vous avez une raison importante pour cela, comme une bibliothèque exclusive à Python 2 qui n'a pas d'alternative adéquate disponible en Python 3 , ou vous (comme moi) adorez absolument et êtes inspirés par Python 2.

source: Check out `Can I Use Python 3? <https://caniusepython3.com/>`_ to see if any software you're depending on will block your adoption of Python 3.
fr: Consultez `Can I Use Python 3? <https://caniusepython3.com/>`_ pour voir si un logiciel dont vous dépendez peut bloquer votre adoption de Python 3.

source: `Further Reading <http://wiki.python.org/moin/Python2orPython3>`_
fr: `Plus de lecture (en) <http://wiki.python.org/moin/Python2orPython3>`_

source: It is possible to `write code that works on Python 2.6, 2.7, and Python 3 <https://docs.python.org/3/howto/pyporting.html>`_. This ranges from trivial to hard depending upon the kind of software you are writing; if you're a beginner there are far more important things to worry about.
fr: Il est possible `d'écrire du code qui fonctionne sur Python 2.6, 2.7, et sur Python 3 <https://docs.python.org/3/howto/pyporting.html>`_. Cela varie de problèmes triviaux à difficile selon le genre de logiciel que vous écrivez; si vous êtes un débutant, il y a des choses beaucoup plus importantes à vous soucier.

source: Implementations
fr: Implémentations

source: When people speak of *Python* they often mean not just the language but also the CPython implementation. *Python* is actually a specification for a language that can be implemented in many different ways.
fr: Quand les gens parlent de *Python*, ils veulent souvent dire pas seulement le langage mais aussi l'implémentation Cython. *Python* est actuellement une spécification pour un langage qui qui peut être implémentée de multiples façons.

source: `CPython <http://www.python.org>`_ is the reference implementation of Python, written in C. It compiles Python code to intermediate bytecode which is then interpreted by a virtual machine. CPython provides the highest level of compatibility with Python packages and C extension modules.
fr: `CPython <http://www.python.org>`_ est l'implémentation de référence de Python, écrite en C. Il compile le code Python en un bytecode intermédiaire qui est ensuite interprété par une machine virtuelle. CPython fournit le plus important niveau de compatibilité avec les paquets Python et les modules avec extension en C.

source: If you are writing open-source Python code and want to reach the widest possible audience, targeting CPython is best. To use packages which rely on C extensions to function, CPython is your only implementation option.
fr: Si vous écrivez du code Python open-source et que vous voulez toucher une audience la plus large possible, le ciblage de CPython est le meilleur à faire. Pour utiliser des paquets qui s'appuient sur des extensions C pour fonctionner, CPython est votre seule option de mise en œuvre.

source: All versions of the Python language are implemented in C because CPython is the reference implementation.
fr: Toutes les versions du langage Python sont implémentées en C parce que CPython est l'implémentation de référence.

source: `PyPy <http://pypy.org/>`_ is a Python interpreter implemented in a restricted statically-typed subset of the Python language called RPython. The interpreter features a just-in-time compiler and supports multiple back-ends (C, CLI, JVM).
fr: `PyPy <http://pypy.org/>`_ est un interpréteur Python implémenté dans un sous-ensemble restreint statiquement typé du langage Python appelé RPython. L'interpréteur se comporte comme un compilateur "just-in-time" (JIT) et supporte de multiples back-ends (C, CLI, JVM).

source: PyPy aims for maximum compatibility with the reference CPython implementation while improving performance.
fr: PyPy a pour but une compatibilité maximum avec l'implémentation de référence CPython tout en améliorant les performances.

source: If you are looking to increase performance of your Python code, it's worth giving PyPy a try. On a suite of benchmarks, it's currently `over 5 times faster than CPython <http://speed.pypy.org/>`_.
fr: Si vous cherchez à améliorer les performances de votre code Python, cela vaut la peine d'essayer PyPy. Sur une suite de benchmarks, il est actuellement `plus de 5 fois plus rapide que CPython <http://speed.pypy.org/>`_.

source: PyPy supports Python 2.7. PyPy3 [#pypy_ver]_, released in beta, targets Python 3.
fr: PyPy supporte Python 2.7. PyPy3 [#pypy_ver]_, sorti en bêta, cible Python 3.

source: `Jython <http://www.jython.org/>`_ is a Python implementation that compiles Python code to Java bytecode which is then executed by the JVM (Java Virtual Machine). Additionally, it is able to import and use any Java class like a Python module.
fr: `Jython <http://www.jython.org/>`_ est une implémentation Python qui compile du code Python en bytecode Java qui est ensuite exécuté par la JVM (Java Virtual Machine). De plus, il est capable d'importer et d'utiliser n'importe quelle classe Java comme un module Python.

source: If you need to interface with an existing Java codebase or have other reasons to need to write Python code for the JVM, Jython is the best choice.
fr: Si vous avez besoin de vous interfacer avec une base de code Java existante ou avez d'autres raisons d'écrire du code Python pour la JVM, Jython est le meilleur choix.

source: Jython currently supports up to Python 2.7. [#jython_ver]_
fr: Jython supporte actuellement jusqu'à la version Python 2.7. [#jython_ver]_

source: `IronPython <http://ironpython.net/>`_ is an implementation of Python for the .NET framework. It can use both Python and .NET framework libraries, and can also expose Python code to other languages in the .NET framework.
fr: `IronPython <http://ironpython.net/>`_ est une implémentation de Python pour le framework .NET. Il peut utiliser à la fois les bibliothèques des frameworks Python et .NET, et peut aussi exposer du code Python vers d'autres langages dans le framework .NET.

source: `Python Tools for Visual Studio <http://ironpython.net/tools/>`_ integrates IronPython directly into the Visual Studio development environment, making it an ideal choice for Windows developers.
fr: `Python Tools for Visual Studio <http://ironpython.net/tools/>`_ intègre IronPython directement dans l'environnement de développement de Visual Studio, ce qui le rend choix idéal pour les développeurs Windows.

source: IronPython supports Python 2.7. [#iron_ver]_
fr: IronPython supporte Python 2.7. [#iron_ver]_

source: `Python for .NET <http://pythonnet.github.io/>`_ is a package which provides near seamless integration of a natively installed Python installation with the .NET Common Language Runtime (CLR). This is the inverse approach to that taken by IronPython (see above), to which it is more complementary than competing with.
fr: `Python for .NET <http://pythonnet.github.io/>`_ est un paquet qui fournit une intégration presque transparente d'une installation native de Python avec le Common Language Runtime (CLR) de .NET . C'est un approche inverse que celle qui est prise par IronPython (voir ci-dessus), qui est plus complémentaire que concurrente de cette dernière.

source: In conjunction with Mono, PythonNet enables native Python installations on non-Windows operating systems, such as OS X and Linux, to operate within the .NET framework. It can be run in addition to IronPython without conflict.
fr: En association avec Mono, PythonNet permet des installations natives de Python sur des systèmes d'exploitation non-Windows, comme OS X et Linux, pour fonctionner dans le framework .NET. Il peut être exécuté en plus d'IronPython sans conflit.

source: PythonNet supports from Python 2.3 up to Python 2.7. [#pythonnet_ver]_
fr: PythonNet supporte de Python 2.3 jusqu'à Python 2.7. [#pythonnet_ver]_
