Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/intro/community.po
Languages: fr

source: The Community
fr: La communauté

source: Guido van Rossum, the creator of Python, is often referred to as the BDFL — the Benevolent Dictator For Life.
fr: Guido van Rossum, le créateur de Python, est souvent désigné comme le dictateur bienveillant pour la vie (Benevolent Dictator For Life ou BDFL).

source: The mission of the Python Software Foundation is to promote, protect, and advance the Python programming language, and to support and facilitate the growth of a diverse and international community of Python programmers.
fr: La mission de la Python Software Foundation est de promouvoir, de protéger et de faire progresser le langage de programmation Python et de soutenir et faciliter la croissance d'une communauté variée et internationale de programmeurs Python.

source: `Learn More about the PSF <http://www.python.org/psf/>`_.
fr: `En apprendre plus sur la PSF <http://www.python.org/psf/>`_.

source: PEPs are *Python Enhancement Proposals*. They describe changes to Python itself, or the standards around it.
fr: Les PEPs sont les *Python Enhancement Proposals* (Propositions d'amélioration de Python). Elles décrivent des modifications sur Python lui-même, ou sur les standards autour du langage.

source: There are three different types of PEPs (as defined by :pep:`1`):
fr: Il y a trois types différents de PEPs (comme défini par la :pep:`1`):

source: Describes a new feature or implementation.
fr: Décrit une nouvelle fonctionnalité ou une implémentation.

source: **Informational**
fr: **Informatif**

source: Describes a design issue, general guidelines, or information to the community.
fr: Décrit un problème de conception, des orientations générales ou un information pour la communauté.

source: **Process**
fr: **Procédés**

source: Describes a process related to Python.
fr: Décrit un processu lié à Python.

source: Notable PEPs
fr: PEPs notables

source: There are a few PEPs that could be considered required reading:
fr: Il y a quelques PEPs qui peuvent être considérées comme une lecture obligatoire:

source: :pep:`8`: The Python Style Guide.
fr: :pep:`8`: Le guide de style Python.

source: Read this. All of it. Follow it.
fr: Lisez-le, en entier. Suivez-le.

source: :pep:`20`: The Zen of Python.
fr: :pep:`20`: Le "Zen of Python".

source: A list of 19 statements that briefly explain the philosophy behind Python.
fr: Une liste de 19 déclarations qui expliquent brièvement la philosophie derrière Python.

source: :pep:`257`: Docstring Conventions.
fr: :pep:`257`: Les conventions docstring.

source: Gives guidelines for semantics and conventions associated with Python docstrings.
fr: Donne les lignes directrices pour la sémantique et les conventions associées avec les docstrings Python.

source: You can read more at `The PEP Index <http://www.python.org/dev/peps/>`_.
fr: Vous pouvez en lire plus sur `L'index des PEPs <http://www.python.org/dev/peps/>`_.

source: Submitting a PEP
fr: Soumission d'une PEP

source: PEPs are peer-reviewed and accepted/rejected after much discussion. Anyone can write and submit a PEP for review.
fr: Les PEPs sont évaluées par des pairs et acceptées/rejetées après beaucoup de discussions. Tout le monde peut écrire et soumettre une PEP pour évaluation.

source: Here's an overview of the PEP acceptance workflow:
fr: Voici un aperçu du workflow d'acceptation PEP:

source: Python Conferences
fr: Conférences Python

source: The major events for the Python community are developer conferences. The two most notable conferences are PyCon, which is held in the US, and its European sibling, EuroPython.
fr: Les événements majeurs pour la communauté Python sont des conférences de développeurs. Les deux conférences les plus notables sont la PyCon, qui se tient aux Etats-Unis, et son homologue européenne, EuroPython.

source: A comprehensive list of conferences is maintained at `pycon.org <http://www.pycon.org/>`_.
fr: Une liste complète de conférences est maintenue sur `pycon.org <http://www.pycon.org/>`_.

source: Python User Groups
fr: Groupes d'utilisateurs Python

source: User Groups are where a bunch of Python developers meet to present or talk about Python topics of interest. A list of local user groups is maintained at the `Python Software Foundation Wiki <http://wiki.python.org/moin/LocalUserGroups>`_.
fr: Les groupes d'utilisateurs sont où un groupe de développeurs Python qui se réunissent pour présenter ou parler de sujets d'intérêts Python. Une liste des groupes d'utilisateurs locaux est maintenue à la `Python Software Foundation Wiki <http://wiki.python.org/moin/LocalUserGroups>`_.
