Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/intro/duction.po
Languages: fr

source: From the `official Python website <http://python.org/about/>`_:
fr: Depuis le `site web Python officiel <http://python.org/about/>`_:

source: Python is a general-purpose, high-level programming language similar to Tcl, Perl, Ruby, Scheme, or Java. Some of its main key features include:
fr: Python est langage de programmation généraliste de haut niveau similaire à Tcl, Perl, Ruby, Scheme ou Java. Quelques-unes des principales fonctionnalités clés incluent:

source: **very clear, readable syntax**
fr: **une syntaxe très claire, lisible**

source: Python's philosophy focuses on readability, from code blocks delineated with significant whitespace to intuitive keywords in place of inscrutable punctuation.
fr: La philosophie de Python s'axe sur la lisibilité, que ce soit à partir de blocs de code délimités par des espaces significatifs à des mots clés intuitifs à la place de l'usage d'une ponctuation insondable.

source: **extensive standard libraries and third party modules for virtually any task**
fr: **de vastes bibliothèques standard et des modules tiers pour pratiquement toute tâche**

source: Python is sometimes described with the words "batteries included" because of its extensive `standard library <http://docs.python.org/library/>`_, which includes modules for regular expressions, file IO, fraction handling, object serialization, and much more.
fr: Python est parfois décrit avec les mots "batteries included" (ou "batteries incluses") en raison de sa vaste `bibliothèque standard <http://docs.python.org/library/>`_, qui comprend des modules pour les expressions régulières, les entrées/sorties sur les fichiers, la manipulation de fractions, la sérialisation d'objets, et bien plus encore.

source: Additionally, the `Python Package Index <http://pypi.python.org/pypi/>`_ is available for users to submit their packages for widespread use, similar to Perl's `CPAN <http://www.cpan.org>`_. There is a thriving community of very powerful Python frameworks and tools like the `Django <http://www.djangoproject.com>`_ web framework and the `NumPy <http://numpy.scipy.org>`_ set of math routines.
fr: En outre, `l'index des paquets Python <http://pypi.python.org/pypi/>`_ (PYthon Package Index ou PYPI) est mis à disposition pour les utilisateurs afin de soumettre leurs paquets pour une utilisation large, similaire à `CPAN de Perl <http://www.cpan.org>`_. Il y a une communauté florissante de frameworks et d'outils Python très puissants comme le framework web `Django <http://www.djangoproject.com>`_ et l'ensemble de routines mathématiques de `NumPy <http://numpy.scipy.org>`_.

source: **integration with other systems**
fr: **intégration avec d'autres systèmes**

source: Python can integrate with `Java libraries <http://www.jython.org>`_, enabling it to be used with the rich Java environment that corporate programmers are used to. It can also be `extended by C or C++ modules <http://docs.python.org/extending/>`_ when speed is of the essence.
fr: Python peut s'intégrer avec les `bibliothèques Java <http://www.jython.org>`_, ce qui lui permet d'être utilisé avec le riche environnement Java auxquels les programmeurs Entreprise sont habitués. Il peut également être `étendu par des modules C ou C ++ <http://docs.python.org/extending/>`_ lorsque la vitesse est primordiale.

source: **ubiquity on computers**
fr: **Ubiquité sur les ordinateurs**

source: Python is available on Windows, \*nix, and Mac. It runs wherever the Java virtual machine runs, and the reference implementation CPython can help bring Python to wherever there is a working C compiler.
fr: Python est disponible sur Windows, \*nix, et Mac. Il fonctionne partout où la machine virtuelle Java fonctionne, et l'implémentation de référence CPython peut aider à porter Python n'importe où il y a un compilateur fonctionnel C.

source: **friendly community**
fr: **une communauté accueillante**

source: Python has a vibrant and large :ref:`community <the-community>` which maintains wikis, conferences, countless repositories, mailing lists, IRC channels, and so much more. Heck, the Python community is even helping to write this guide!
fr: Python a une communauté grande et dynamique :ref:`communauté <the-community>` qui maintient des wikis, des conférences, d'innombrables dépôts, des listes de diffusion, des canaux IRC, et bien plus encore. Vérifiez, la communauté Python aide même à écrire ce guide!

source: About This Guide
fr: A propos de ce guide

source: Purpose
fr: But

source: The Hitchhiker's Guide to Python exists to provide both novice and expert Python developers a best practice handbook for the installation, configuration, and usage of Python on a daily basis.
fr: Le guide de l’auto-stoppeur pour Python existe pour fournir aux développeurs novices comme experts un manuel des meilleurs pratiques pour l'installation, la configuration et l'usage de Python au quotidien.

source: By the Community
fr: Par la communauté

source: This guide is architected and maintained by `Kenneth Reitz <https://github.com/kennethreitz>`_ in an open fashion. This is a community-driven effort that serves one purpose: to serve the community.
fr: Ce guide est architecturé et maintenu par `Kenneth Reitz <https://github.com/kennethreitz>`_ de manière ouverte. C'est une effort piloté par la communauté qui sert un but: servir la communauté.

source: For the Community
fr: Pour la communauté

source: All contributions to the Guide are welcome, from Pythonistas of all levels. If you think there's a gap in what the Guide covers, fork the Guide on GitHub and submit a pull request.
fr: Toutes les contributions au Guide sont les bienvenues, de Pythoneux de tous les niveaux. Si vous pensez qu'il y a une lacune dans ce que le guide couvre, forkez le guide sur GitHub et soumettez une "pull request".

source: Contributions are welcome from everyone, whether they're an old hand or a first-time Pythonista, and the authors to the Guide will gladly help if you have any questions about the appropriateness, completeness, or accuracy of a contribution.
fr: Les contributions sont bienvenues de la part de tout le monde, que ce soit une vieille main ou un jeune Pythoneux, et les auteurs du guide seront heureux de vous aider si vous avez des questions sur la pertinence, l'exhaustivité ou l'exactitude d'une contribution.

source: To get started working on The Hitchhiker's Guide, see the :doc:`/notes/contribute` page.
fr: Pour commencer à travailler sur le guide de l'auto-stoppeur, voir la page :doc:`/notes/contribute`.
