Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/cli.po
Languages: fr

source: Command-line Applications
fr: Applications en ligne de commande

source: Command-line applications, also referred to as `Console Applications <http://en.wikipedia.org/wiki/Console_application>`_, are computer programs designed to be used from a text interface, such as a `shell <http://en.wikipedia.org/wiki/Shell_(computing)>`_. Command-line applications usually accept various inputs as arguments, often referred to as parameters or sub-commands, as well as options, often referred to as flags or switches.
fr: Les applications en ligne de commande, également appelées `Applications console <http://en.wikipedia.org/wiki/Console_application>`_, sont des programmes informatiques conçus pour être utilisés à partir d'une interface texte, telle qu'un `shell <http://en.wikipedia.org/wiki/Shell_(computing)>`_. Les applications en ligne de commande acceptent généralement différentes entrées comme arguments, souvent appelés paramètres ou sous-commandes, aussi bien que options, souvent désignées comme 'flags' ou 'switches'.

source: Some popular command-line applications include:
fr: Quelques applications en ligne de commande populaires incluent:

source: `Grep <http://en.wikipedia.org/wiki/Grep>`_ - A plain-text data search utility
fr: `Grep <http://en.wikipedia.org/wiki/Grep>`_ - un utilitaire de recherche de données en texte-plein

source: `curl <http://curl.haxx.se/>`_ - A tool for data transfer with URL syntax
fr: `curl <http://curl.haxx.se/>`_ - un outil pour le transfert de données avec une syntaxe URL

source: `httpie <https://github.com/jakubroztocil/httpie>`_ - A command line HTTP client, a user-friendly cURL replacement
fr: `httpie <https://github.com/jakubroztocil/httpie>`_ - un client HTTP en ligne de commande, un remplaçant de cURL convivial

source: `git <http://git-scm.com/>`_ - A distributed version control system
fr: `git <http://git-scm.com/>`_ - Un système de gestion de version distribué

source: `mercurial <http://mercurial.selenic.com/>`_ - A distributed version control system primarily written in Python
fr: `mercurial <http://mercurial.selenic.com/>`_ - Un système de gestion de version distribué principalement écrit en Python

source: `clint <https://pypi.python.org/pypi/clint/>`_ is a Python module which is filled with very useful tools for developing command-line applications. It supports features such as; CLI colors and indents, simple and powerful column printer, iterator based progress bars and implicit argument handling.
fr: `clint <https://pypi.python.org/pypi/clint/>`_ est un module Python qui est contient plein d'outils très utiles pour le développement d'applications en ligne de commande. Il prend en charge des fonctionnalités telles que; la couleur et l'indentation de la console/invite, l'impression de colonnes simple et puissante, les barres de progression basées sur des itérateurs et la manipulation d'argument implicite.

source: `click <http://click.pocoo.org/>`_ is an upcoming Python package for creating command-line interfaces in a composable way with as little code as possible. This “Command-line Interface Creation Kit” is highly configurable but comes with good defaults out of the box.
fr: `click <http://click.pocoo.org/>`_ est un package Python à venir pour créer des interfaces de ligne de commande d'une manière composable avec le moins de code possible. Cette “Command-Line Interface Creation Kit” est hautement configurable, mais est livrée avec une bonne configuration par défaut directement.

source: `docopt <http://docopt.org/>`_ is a lightweight, highly Pythonic package that allows creating command-line interfaces easily and intuitively, by parsing POSIX-style usage instructions.
fr: `docopt <http://docopt.org/>`_ est un paquet très léger et très Pythonique qui permet de créer des interfaces de ligne de commande simple et intuitive, en parsant les instructions d'usage dans le style de POSIX.

source: `Plac <https://pypi.python.org/pypi/plac>`_ is a simple wrapper over the Python standard library `argparse <http://docs.python.org/2/library/argparse.html>`_, which hides most of its complexity by using a declarative interface: the argument parser is inferred rather than written down by imperatively. This module targets especially unsophisticated users, programmers, sys-admins, scientists and in general people writing throw-away scripts for themselves, who choose to create a command-line interface because it is quick and simple.
fr: `Plac <https://pypi.python.org/pypi/plac>`_ est un simple wrapper sur la bibliothèque standard Python `argparse <http://docs.python.org/2/library/argparse.html>`_, qui cache la majeure partie de sa complexité en utilisant une interface déclarative: le parser d'argument est inféré plutôt qu'écrit de manière impérative. Ce module cible en particulier les utilisateurs non-avertis, les programmeurs, les administrateurs système, les scientifiques et en général les gens qui écrivent des scripts jetables pour eux-mêmes, qui choisissent de créer une interface de ligne de commande, car c'est rapide et simple.

source: `Cliff <http://docs.openstack.org/developer/cliff/>`_ is a framework for building command-line programs. It uses setuptools entry points to provide subcommands, output formatters, and other extensions. The framework is meant to be used to create multi-level commands such as subversion and git, where the main program handles some basic argument parsing and then invokes a sub-command to do the work.
fr: `Cliff <http://docs.openstack.org/developer/cliff/>`_ est un framework pour construire des programmes en ligne de commande. Il utilise les points d'entrée de setuptools pour fournir des sous-commandes, des formatteurs de sortie, et d'autres extensions. Le framework est destiné à être utilisé pour créer des commandes à plusieurs niveaux tels que subversion et git, où le programme principal gère le parsing d'argument de base, puis invoque une sous-commande pour faire le travail.
