Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/gui.po
Languages: fr

source: GUI Applications
fr: Applications avec interface graphique utilisateur (GUI)

source: Alphabetical list of GUI Applications.
fr: Liste alphabétique des applications avec interface graphique utilisateur (GUI)

source: `Camelot <http://www.python-camelot.com>`_ provides components for building applications on top of Python, SQLAlchemy and Qt. It is inspired by the Django admin interface.
fr: `Camelot <http://www.python-camelot.com>`_ fournit des composants pour construire des applications par dessus Python, SQLAlchemy et Qt. Il est inspiré par l'interface d'administration de Django.

source: The main resource for information is the website: http://www.python-camelot.com and the mailing list https://groups.google.com/forum/#!forum/project-camelot
fr: La ressource principale pour des informations est le site web: http://www.python-camelot.com and the mailing list https://groups.google.com/forum/#!forum/project-camelot

source: The Cocoa framework is only available on OS X. Don't pick this if you're writing a cross-platform application!
fr: Le framework Cocoa est uniquement disponible sur OS X. Ne l'utilisez pas si vous écrivez une application multi-plateformes.

source: PyGTK provides Python bindings for the GTK+ toolkit. Like the GTK+ library itself, it is currently licensed under the GNU LGPL. It is worth noting that PyGTK only currently supports the Gtk-2.X API (NOT Gtk-3.0). It is currently recommended that PyGTK not be used for new projects and that existing applications be ported from PyGTK to PyGObject.
fr: PyGTK fournit des bindings Python pour la boîte à outils GTK+. Comme la bibliothèque GTK+ elle-même, il est actuellement sous licence GNU LGPL. Il est intéressant de noter que PyGTK ne supporte actuellement que l'API Gtk-2.X (PAS Gtk-3.0). Il est actuellement recommandé de ne pas utiliser PyGTK pour les nouveaux projets et que les applications existantes soient portées de PyGTK à PyGObject.

source: PyGObject aka (PyGi)
fr: PyGObject connu aussi comme (PyGi)

source: `PyGObject <https://wiki.gnome.org/Projects/PyGObject>`_ provides Python bindings, which gives access to the entire GNOME software platform. It is fully compatible with GTK+ 3. Here is a tutorial to get started with `Python GTK+ 3 Tutorial <http://python-gtk-3-tutorial.readthedocs.org/en/latest/>`_.
fr: `PyGObject <https://wiki.gnome.org/Projects/PyGObject>`_ fournit des bindings Python, qui donnent un accès complet à la plate-forme logicielle GNOME. Il est entièrement compatible avec GTK+ 3. Voici un tutoriel pour commencer intitulé `Python GTK+ 3 Tutorial <http://python-gtk-3-tutorial.readthedocs.org/en/latest/>`_.

source: `API Reference <http://lazka.github.io/pgi-docs/>`_
fr: `Référence de l'API <http://lazka.github.io/pgi-docs/>`_

source: `Kivy <http://kivy.org>`_ is a Python library for development of multi-touch enabled media rich applications. The aim is to allow for quick and easy interaction design and rapid prototyping, while making your code reusable and deployable.
fr: `Kivy <http://kivy.org>`_ est une bibliothèque Python pour le développement d'applications riches en média supportant le multi-touch. L'objectif est de permettre la conception d'interaction rapide et facile et le prototypage rapide, tout en rendant votre code réutilisable et déployable.

source: Kivy is written in Python, based on OpenGL and supports different input devices such as: Mouse, Dual Mouse, TUIO, WiiMote, WM_TOUCH, HIDtouch, Apple's products and so on.
fr: Kivy est écrit en Python, basé sur OpenGL et supporte les différents dispositifs d'entrée tels que: souris, la souris double, TUIO, WiiMote, WM_TOUCH, HIDtouch, les produits d'Apple et ainsi de suite.

source: Kivy is actively being developed by a community and is free to use. It operates on all major platforms (Linux, OSX, Windows, Android).
fr: Kivy est activement développé par une communauté et est libre à utiliser. Il fonctionne sur toutes les principales plateformes (Linux, OSX, Windows, Android).

source: The main resource for information is the website: http://kivy.org
fr: La ressource principale pour des informations est le site web: http://kivy.org

source: Only available on OS X. Don't pick this if you're writing a cross-platform application.
fr: Uniquement disponible sur OS X. Ne l'utilisez pas si vous écrivez une application multi-plateformes.

source: PySide is a Python binding of the cross-platform GUI toolkit Qt.
fr: PySide est un binding Python de la boîte à outils graphique multi-plateformes Qt.

source: If your software does not fully comply with the GPL you will need a commercial license!
fr: Si votre logiciel ne se conforme pas complètement à la GPL, vous aurez besoin d'une licence commerciale!

source: PyQt provides Python bindings for the Qt Framework (see below).
fr: PyQt fournit des bindings Python pour le framework Qt (voir ci-dessous).

source: PyjamasDesktop is a port of Pyjamas. PyjamasDesktop is application widget set for desktop and a cross-platform framework. (After release v0.6 PyjamasDesktop is a part of Pyjamas (Pyjs)). Briefly, it allows the exact same Python web application source code to be executed as a standalone desktop application.
fr: PyjamasDesktop est un port de Pyjamas. PyjamasDesktop est un jeu de widgets pour applications prévu pour le bureautique et un framework multi-plateformes. (Après la mise à disposition de la v0.6, PyjamasDesktop est un morceau de Pyjamas (Pyjs)). En bref, il permet au même code d'une application web Python d'être exécuté comme une application de bureau autonome.

source: `Python Wiki for PyjamasDesktop <http://wiki.python.org/moin/PyjamasDesktop>`_.
fr: `Wiki Python pour PyjamasDesktop <http://wiki.python.org/moin/PyjamasDesktop>`_.

source: The main website; `pyjs Desktop <http://pyjs.org/>`_.
fr: Le site principal; `pyjs Desktop <http://pyjs.org/>`_.

source: `Qt <http://qt-project.org/>`_ is a cross-platform application framework that is widely used for developing software with a GUI but can also be used for non-GUI applications.
fr: `Qt <http://qt-project.org/>`_ est un framework multi-plateformes qui est largement utilisé pour développer de logiciels avec une interface graphique, mais peut également être utilisé pour des applications sans interface graphique.

source: Tkinter is a thin object-oriented layer on top of Tcl/Tk. **It has the advantage of being included with the Python standard library, making it the most convenient and compatible toolkit to program with.**
fr: Tkinter est une mince couche orientée par dessus Tcl/Tk. **Il a l'avantage d'être inclus dans la bibliothèque standard Python, ce qui le rend la boîte à outils la plus pratique et compatible pour programmer.**

source: Both Tk and Tkinter are available on most Unix platforms, as well as on Windows and Macintosh systems. Starting with the 8.0 release, Tk offers native look and feel on all platforms.
fr: Tk et Tkinter sont tous les deux disponibles sur la plupart des plateformes Unix, ainsi que sur les systèmes Windows et Macintosh. Depuis la version 8.0, Tk offre une apparence et une impression native sur toutes les plateformes.

source: There's a good multi-language Tk tutorial with Python examples at `TkDocs <http://www.tkdocs.com/tutorial/index.html>`_. There's more information available on the `Python Wiki <http://wiki.python.org/moin/TkInter>`_.
fr: Il y a un bon tutoriel Tk multi-langages avec des exemples Python sur `TkDocs <http://www.tkdocs.com/tutorial/index.html>`_. Plus d'informations sont disponibles sur `Wiki Python <http://wiki.python.org/moin/TkInter>`_.

source: wxPython is a GUI toolkit for the Python programming language. It allows Python programmers to create programs with a robust, highly functional graphical user interface, simply and easily. It is implemented as a Python extension module (native code) that wraps the popular wxWidgets cross platform GUI library, which is written in C++.
fr: wxPython est une boîte à outils d'interface graphique pour le langage de programmation Python. Il permet aux programmeurs Python de créer des programmes avec une interface utilisateur graphique robuste, très fonctionnel, simple et facile. Il est implémenté comme un module d'extension Python (code natif) qui enveloppe la populaire bibliothèque graphique multi-plateformes wxWidgets, qui est écrite en C ++.

source: **Install (Stable) wxPython** *go to http://www.wxpython.org/download.php#stable and download the appropriate package for your OS.*
fr: **Installez wxPython (Stable)** *allez sur http://www.wxpython.org/download.php#stable et téléchargez le paquet approprié pour votre système d'exploitation.*
