Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/imaging.po
Languages: fr

source: Image Manipulation
fr: Manipulation d'images

source: Most image processing and manipulation techniques can be carried out effectively using two libraries: Python Imaging Library (PIL) and OpenSource Computer Vision (OpenCV).
fr: La plupart des techniques de traitement et de manipulation d'images peuvent être effectuées efficacement en utilisant deux bibliothèques: Python Imaging Library (PIL) et Open Source Computer Vision (OpenCV).

source: A brief description of both is given below.
fr: Une brève description des deux est donnée ci-dessous.

source: Python Imaging Library
fr: Bibliothèque Python Imaging Library (PIL)

source: The `Python Imaging Library <http://www.pythonware.com/products/pil/>`_, or PIL for short, is one of the core libraries for image manipulation in Python. Unfortunately, its development has stagnated, with its last release in 2009.
fr: La `Python Imaging Library <http://www.pythonware.com/products/pil/>`_, ou PIL, est l'une des bibliothèques de base pour la manipulation d'images en Python. Malheureusement, son développement a stagné, avec sa dernière version en 2009.

source: Luckily for you, there's an actively-developed fork of PIL called `Pillow <http://python-pillow.github.io/>`_ - it's easier to install, runs on all operating systems, and supports Python 3.
fr: Heureusement pour vous, il y a un fork développé activement de PIL appelé `Pillow <http://python-pillow.github.io/>`_ - il est plus facile à installer, fonctionne sur tous les systèmes d'exploitation, et supporte Python 3.

source: Before installing Pillow, you'll have to install Pillow's prerequisites. Find the instructions for your platform in the `Pillow installation instructions <https://pillow.readthedocs.org/en/3.0.0/installation.html>`_.
fr: Avant d'installer Pillow, vous devrez installer les prérequis pour Pillow. Vous trouverez les instructions de votre plate-forme dans les `instructions d'installation de Pillow <https://pillow.readthedocs.org/en/3.0.0/installation.html>`_.

source: After that, it's straightforward:
fr: Après cela, c'est direct:

source: Example
fr: Exemple

source: There are more examples of the Pillow library in the `Pillow tutorial <http://pillow.readthedocs.org/en/3.0.x/handbook/tutorial.html>`_.
fr: Il y a plus d'exemples pour la bibliothèque Pillow dans le `tutoriel Pillow <http://pillow.readthedocs.org/en/3.0.x/handbook/tutorial.html>`_.

source: OpenSource Computer Vision
fr: OpenSource Computer Vision (OpenCV)

source: OpenSource Computer Vision, more commonly known as OpenCV, is a more advanced image manipulation and processing software than PIL. It has been implemented in several languages and is widely used.
fr: OpenSource Computer Vision, plus connu comme OpenCV, est un logiciel plus avancé de manipulation et de traitement d'images que PIL. Il a été implémenté en plusieurs langages et est largement utilisé.

source: In Python, image processing using OpenCV is implemented using the ``cv2`` and ``NumPy`` modules. The `installation instructions for OpenCV <http://docs.opencv.org/2.4/doc/tutorials/introduction/table_of_content_introduction/table_of_content_introduction.html#table-of-content-introduction>`_ should guide you through configuring the project for yourself.
fr: En Python, le traitement d'image en utilisant OpenCV est implémenté en utilisant les modules ``cv2`` et ``NumPy``. Les `instructions d'installation pour OpenCV <http://docs.opencv.org/2.4/doc/tutorials/introduction/table_of_content_introduction/table_of_content_introduction.html#table-of-content-introduction>`_ devrait vous guider dans la configuration du projet pour vous-même.

source: NumPy can be downloaded from the Python Package Index(PyPI):
fr: NumPy peut être téléchargé à partir du Python Package Index (PyPI):

source: There are more Python-implemented examples of OpenCV in this `collection of tutorials <http://opencv-python-tutroals.readthedocs.org/en/latest/py_tutorials/py_tutorials.html>`_.
fr: Il y a plus d'exemples d'OpenCV implémentés en Python dans cette `collection de tutoriels <http://opencv-python-tutroals.readthedocs.org/en/latest/py_tutorials/py_tutorials.html>`_.
