Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/json.po
Languages: fr

source: The `json <https://docs.python.org/2/library/json.html>`_ library can parse JSON from strings or files. The library parses JSON into a Python dictionary or list. It can also convert Python dictionaries or lists into JSON strings.
fr: La bibliothèque `json <https://docs.python.org/2/library/json.html>`_ peut parser un JSON depuis des chaînes de caractères ou des fichiers. La bibliothèque parse le JSON en un dictionnaire ou une liste Python. Elle peut également convertir les dictionnaires Python ou des listes en chaînes JSON.

source: Parsing JSON
fr: Parsage de JSON

source: Take the following string containing JSON data:
fr: Prenez la chaîne de caractères suivante contenant des données JSON:

source: It can be parsed like this:
fr: Elle peut être parsée comme ceci:

source: and can now be used as a normal dictionary:
fr: et peut maintenant être utilisée comme un dictionnaire normal:

source: You can also convert the following to JSON:
fr: Vous pouvez aussi convertir ce qui suit en JSON:

source: The JSON library was added to Python in version 2.6. If you're using an earlier version of Python, the `simplejson <https://simplejson.readthedocs.org/en/latest/>`_ library is available via PyPI.
fr: La bibliothèque JSON a été ajoutée à Python dans la version 2.6. Si vous utilisez une version antérieure de Python, la bibliothèque `simplejson <https://simplejson.readthedocs.org/en/latest/>`_ est disponible via PyPI.

source: simplejson mimics the json standard library. It is available so that developers that use older versions of Python can use the latest features available in the json lib.
fr: simplejson imite la bibliothèque standard json. Il est disponible pour que les développeurs qui utilisent d'anciennes versions de Python puissent utiliser les dernières fonctionnalités disponibles dans la bibliothèque json.

source: You can start using simplejson when the json library is not available by importing simplejson under a different name:
fr: Vous pouvez commencer à utiliser simplejson lorsque la bibliothèque json n'est pas disponible par l'importation de simplejson sous un autre nom:

source: After importing simplejson as json, the above examples will all work as if you were using the standard json library.
fr: Après l'importation de simplejson comme json, les exemples ci-dessus fonctionneront tous comme si vous utilisiez la bibliothèque json standard.
