Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/scientific.po
Languages: fr

source: Scientific Applications
fr: Applications scientifiques

source: Context
fr: Contexte

source: Python is frequently used for high-performance scientific applications. It is widely used in academia and scientific projects because it is easy to write and performs well.
fr: Python est fréquemment utilisé pour des applications scientifiques haute-performances. Il est largement utilisé dans les projets universitaires et scientifiques car il est facile à écrire et donne de bons résultats.

source: Due to its high performance nature, scientific computing in Python often utilizes external libraries, typically written in faster languages (like C, or FORTRAN for matrix operations). The main libraries used are `NumPy`_, `SciPy`_ and `Matplotlib`_. Going into detail about these libraries is beyond the scope of the Python guide. However, a comprehensive introduction to the scientific Python ecosystem can be found in the `Python Scientific Lecture Notes <http://scipy-lectures.github.com/>`_
fr: En raison de sa nature haute performance, le calcul scientifique en Python utilise souvent des bibliothèques externes, généralement écrites dans des langages plus rapides (comme C ou FORTRAN pour les opérations matricielles). Les principales bibliothèques utilisées sont `NumPy`_, `SciPy`_ et `Matplotlib`_. Entrer dans le détail de ces bibliothèques va au-delà du périmètre couvert par ce guide Python. Cependant, une introduction complète à l'écosystème Python scientifique peut être trouvée dans les `notes de lecture pour le Python scientifique <http://scipy-lectures.github.com/>`_ (en)

source: Tools
fr: Outils

source: `IPython <http://ipython.org/>`_ is an enhanced version of Python interpreter, which provides features of great interest to scientists. The `inline mode` allows graphics and plots to be displayed in the terminal (Qt based version). Moreover, the `notebook` mode supports literate programming and reproducible science generating a web-based Python notebook. This notebook allows you to store chunks of Python code along side the results and additional comments (HTML, LaTeX, Markdown). The notebook can then be shared and exported in various file formats.
fr: `IPython <http://ipython.org/>`_ est une version améliorée de l'interpréteur Python, qui fournit des fonctionnalités d'un grand intérêt pour les scientifiques. Le `mode inline` permet l'affichage de graphiques et de diagrammes dans le terminal (pour la version basée sur Qt). De plus, le mode `notebook` supporte la programmation lettrée et la science reproductible en générant un notebook Python basé sur le Web. Ce notebook vous permet de stocker des bouts de code Python à côté des résultats et des commentaires supplémentaires (HTML, LaTeX, Markdown). Le notebook peut alors être partagé et exporté dans divers formats de fichiers.

source: Libraries
fr: Bibliothèques

source: `NumPy <http://numpy.scipy.org/>`_ is a low level library written in C (and FORTRAN) for high level mathematical functions. NumPy cleverly overcomes the problem of running slower algorithms on Python by using multidimensional arrays and functions that operate on arrays. Any algorithm can then be expressed as a function on arrays, allowing the algorithms to be run quickly.
fr: `NumPy <http://numpy.scipy.org/>`_ est une bibliothèque de bas niveau écrite en C (et FORTRAN) pour les fonctions mathématiques de haut niveau. NumPy dépasse habilement le problème d'exécuter des algorithmes plus lents sur Python en utilisant des tableaux multidimensionnels et des fonctions qui opèrent sur des tableaux. Tout algorithme peut alors être exprimé comme une fonction sur des tableaux, permettant aux algorithmes de exécuter rapidement.

source: NumPy is part of the SciPy project, and is released as a separate library so people who only need the basic requirements can use it without installing the rest of SciPy.
fr: NumPy fait partie du projet SciPy, et est mis à disposition comme bibliothèque séparée afin que les gens qui ont seulement besoin des exigences de base puissent l'utiliser sans installer le reste de SciPy.

source: NumPy is compatible with Python versions 2.4 through to 2.7.2 and 3.1+.
fr: NumPy est compatible avec les versions de Python 2.4 à 2.7.2 et 3.1+.

source: `Numba <http://numba.pydata.org>`_ is a NumPy aware Python compiler (just-in-time (JIT) specializing compiler) which compiles annotated Python (and NumPy) code to LLVM (Low Level Virtual Machine) through special decorators. Briefly, Numba uses a system that compiles Python code with LLVM to code which can be natively executed at runtime.
fr: `Numba <http://numba.pydata.org>`_ est un compilateur Python conscient de NumPy (compilateur spécialisé just-in-time (JIT)) qui compile le code Python (et NumPy) annoté pour LLVM (Low Level Virtual Machine) via des décorateurs spéciaux. En bref, Numba utilise un système qui compile le code Python avec LLVM en code qui peut être exécuté nativement à l'exécution.

source: `SciPy <http://scipy.org/>`_ is a library that uses NumPy for more mathematical functions. SciPy uses NumPy arrays as the basic data structure, and comes with modules for various commonly used tasks in scientific programming, including linear algebra, integration (calculus), ordinary differential equation solving and signal processing.
fr: `SciPy <http://scipy.org/>`_ est une bibliothèque qui utilise NumPy pour plus de fonctions mathématiques. SciPy utilise des tableaux numpy comme structure de base pour les données, et est livré avec des modules pour diverses tâches couramment utilisées dans la programmation scientifique, incluant l'algèbre linéaire, le calcul intégral (calcul différentiel), la résolution d'équation différentielle ordinaire et le traitement du signal.

source: `Matplotlib <http://matplotlib.sourceforge.net/>`_ is a flexible plotting library for creating interactive 2D and 3D plots that can also be saved as manuscript-quality figures. The API in many ways reflects that of `MATLAB <http://www.mathworks.com/products/matlab/>`_, easing transition of MATLAB users to Python. Many examples, along with the source code to re-create them, are available in the `matplotlib gallery <http://matplotlib.sourceforge.net/gallery.html>`_.
fr: `Matplotlib <http://matplotlib.sourceforge.net/>`_ est une bibliothèque de création de diagrammes flexible pour créer des diagrammes 2D et 3D interactifs qui peuvent également être enregistrés comme des figures d'une qualité suffisante pour illustrer des manuscrits. L'API reflète de plusieurs façons celle de `MATLAB <http://www.mathworks.com/products/matlab/>`_, facilitant la transition des utilisateurs MATLAB à Python. De nombreux exemples, avec le code source pour les recréer, sont disponibles dans la `galerie de matplotlib <http://matplotlib.sourceforge.net/gallery.html>`_.

source: `Pandas <http://pandas.pydata.org/>`_ is data manipulation library based on Numpy which provides many useful functions for accessing, indexing, merging and grouping data easily. The main data structure (DataFrame) is close to what could be found in the R statistical package; that is, heterogeneous data tables with name indexing, time series operations and auto-alignment of data.
fr: `Pandas <http://pandas.pydata.org/>`_ est une bibliothèque de manipulation de données basée sur Numpy qui fournit de nombreuses fonctions utiles pour accéder, indexer, fusionner et le regrouper des données facilement. La structure de données principale (DataFrame) est proche de ce qui peut être trouvé dans le paquet statistique R; autrement dit, des tableaux de données hétérogènes avec l'indexation par nom, les opérations sur les séries temporelles et l'auto-alignement des données.

source: `Rpy2 <http://rpy.sourceforge.net/rpy2.html>`_ is a Python binding for the R statistical package allowing the execution of R functions from Python and passing data back and forth between the two environments. Rpy2 is the object oriented implementation of the `Rpy <http://rpy.sourceforge.net/rpy.html>`_ bindings.
fr: `Rpy2 <http://rpy.sourceforge.net/rpy2.html>`_ est le binding Python pour le logiciel statistique R permettant l'exécution de fonctions de R depuis Python et transmettant les données dans les deux sens entre les deux environnements. Rpy2 est l'implémentation orientée objet des bindings `Rpy <http://rpy.sourceforge.net/rpy.html>`_.

source: `PsychoPy <http://www.psychopy.org/>`_ is a library for cognitive scientists allowing the creation of cognitive psychology and neuroscience experiments. The library handles presentation of stimuli, scripting of experimental design and data collection.
fr: `PsychoPy <http://www.psychopy.org/>`_ est une bibliothèque pour la psychologie cognitive et lex expérimentations en neuroscience. La bibliothèque gère la présentation des stimuli, le scripting de conception expérimentale et la collecte de données.

source: Resources
fr: Ressources

source: Installation of scientific Python packages can be troublesome, as many of these packages are implemented as Python C extensions which need to be compiled. This section lists various so-called scientific Python distributions which provide precompiled and easy-to-install collections of scientific Python packages.
fr: L'installation de paquets Python scientifiques peut être compliquée, comme beaucoup de ces paquets sont mis en œuvre comme des extensions Python en C qui doivent être compilées. Cette section liste les différentes distributions Python dites scientifiques qui fournissent des collections précompilées et faciles à installer de paquets Python scientifiques.

source: Unofficial Windows Binaries for Python Extension Packages
fr: Binaires Windows non-officiels pour les paquets d'extension Python

source: Many people who do scientific computing are on Windows, yet many of the scientific computing packages are notoriously difficult to build and install on this platform. `Christoph Gohlke <http://www.lfd.uci.edu/~gohlke/pythonlibs/>`_ however, has compiled a list of Windows binaries for many useful Python packages. The list of packages has grown from a mainly scientific Python resource to a more general list. If you're on Windows, you may want to check it out.
fr: Beaucoup de gens qui font le calcul scientifique sont sous Windows, et encore beaucoup de paquets de calcul scientifique sont notoirement difficiles à builder et à installer sur cette plateforme. `Christoph Gohlke <http://www.lfd.uci.edu/~gohlke/pythonlibs/>`_ cependant, a compilé une liste de binaires Windows pour de nombreux paquets Python utiles. La liste des paquets a grossi en devenant une ressource Python principalement scientifique à une liste plus générale. Si vous êtes sur Windows, vous pouvez y jeter un œil.

source: `Continuum Analytics <http://continuum.io/>`_ offers the `Anaconda Python Distribution <https://store.continuum.io/cshop/anaconda>`_ which includes all the common scientific Python packages as well as many packages related to data analytics and big data. Anaconda itself is free, and Continuum sells a number of proprietary add-ons. Free licenses for the add-ons are available for academics and researchers.
fr: `Continuum Analytics <http://continuum.io/>`_ met à disposition la `distribution Python Anaconda Python <https://store.continuum.io/cshop/anaconda>`_ qui inclue tous les paquets Python scientifiques les plus courants, ainsi que de nombreux paquets liés à l'analyse de données et au big data. Anaconda lui-même est gratuit, et Continuum vend un certain nombre d'add-ons propriétaires. Des licences gratuites pour ces add-ons sont disponibles pour les universitaires et les chercheurs.

source: `Canopy <https://www.enthought.com/products/canopy/>`_ is another scientific Python distribution, produced by `Enthought <https://www.enthought.com/>`_. A limited 'Canopy Express' variant is available for free, but Enthought charges for the full distribution. Free licenses are available for academics.
fr: `Canopy <https://www.enthought.com/products/canopy/>`_ est une autre distribution de Python scientifique, produit par `Enthought <https://www.enthought.com/>`_. Une variante limitée 'Canopy Express' est disponible gratuitement, mais Enthought facture pour la distribution complète. Des licences gratuites sont disponibles pour les universitaires.
