Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/scrape.po
Languages: fr

source: HTML Scraping
fr: Scraping HTML

source: Web sites are written using HTML, which means that each web page is a structured document. Sometimes it would be great to obtain some data from them and preserve the structure while we're at it. Web sites don't always provide their data in comfortable formats such as ``csv`` or ``json``.
fr: Les sites web sont écrits en utilisant HTML, ce qui signifie que chaque page Web est un document structuré. Parfois, il serait bien d'obtenir des données à partir d'elles et de préserver la structure pendant que nous y sommes. Les sites web ne fournissent pas toujours leurs données dans des formats confortables tels que le ``csv`` ou ``json``.

source: This is where web scraping comes in. Web scraping is the practice of using a computer program to sift through a web page and gather the data that you need in a format most useful to you while at the same time preserving the structure of the data.
fr: C'est là où le web scraping entre en jeu. Le web scraping est la pratique d'utiliser un programme d'ordinateur pour passer au crible d'une page Web et de recueillir les données dont vous avez besoin dans un format plus utile pour vous tout en préservant la structure de la donnée.

source: lxml and Requests
fr: lxml et Requests

source: `lxml <http://lxml.de/>`_ is a pretty extensive library written for parsing XML and HTML documents very quickly, even handling messed up tags in the process. We will also be using the `Requests <http://docs.python-requests.org/en/latest/>`_ module instead of the already built-in urllib2 module due to improvements in speed and readability. You can easily install both using ``pip install lxml`` and ``pip install requests``.
fr: `lxml <http://lxml.de/>`_ est une bibliothèque assez étendue, écrite pour analyser des documents XML et HTML très rapidement, manipulant même des balises invalides au cours du processus. Nous allons aussi utiliser le module `Requests <http://docs.python-requests.org/en/latest/>`_ à la place du module urllib2 natif à cause d'améliorations en terme de vitesse et de lisibilité. Vous pouvez facilement installer les deux en utilisant ``pip install lxml`` et ``pip install requests``.

source: Let's start with the imports:
fr: Commençons avec les imports:

source: Next we will use ``requests.get`` to retrieve the web page with our data, parse it using the ``html`` module and save the results in ``tree``:
fr: Ensuite, nous utiliserons ``requests.get`` pour récupérer la page web avec notre donnée, la parser en utilisant le module ``html`` et sauver les résultats dans `` tree``:

source: (We need to use ``page.content`` rather than ``page.text`` because ``html.fromstring`` implicitly expects ``bytes`` as input.)
fr: (Nous avons besoin d'utiliser ``page.content`` plutôt que ``page.text`` parce que ``html.fromstring`` attend implicitement des ``bytes`` en entrée.)

source: ``tree`` now contains the whole HTML file in a nice tree structure which we can go over two different ways: XPath and CSSSelect. In this example, we will focus on the former.
fr: ``tree`` contient maintenant le fichier HTML entier dans une belle structure arborescente que nous pouvons parcourir de deux façons différentes: XPath et CSSSelect. Dans cet exemple, nous allons nous concentrer sur le premier.

source: XPath is a way of locating information in structured documents such as HTML or XML documents. A good introduction to XPath is on `W3Schools <http://www.w3schools.com/xsl/xpath_intro.asp>`_ .
fr: XPath est un moyen de trouver de l'information dans des documents structurés tels que des documents HTML ou XML. Une bonne introduction à XPath est sur `W3Schools <http://www.w3schools.com/xsl/xpath_intro.asp>`_ .

source: There are also various tools for obtaining the XPath of elements such as FireBug for Firefox or the Chrome Inspector. If you're using Chrome, you can right click an element, choose 'Inspect element', highlight the code, right click again and choose 'Copy XPath'.
fr: Il existe également divers outils pour obtenir le XPath d'éléments comme Firebug pour Firefox ou l'Inspecteur Chrome. Si vous utilisez Chrome, vous pouvez faire un clic droit sur un élément, choisissez 'Inspecter', mettez en surbrillance le code, faites un clic droit à nouveau et choisissez 'Copy' puis 'Copy XPath'

source: After a quick analysis, we see that in our page the data is contained in two elements - one is a div with title 'buyer-name' and the other is a span with class 'item-price':
fr: Après une analyse rapide, nous voyons que dans notre page les données sont contenues dans deux éléments - l'un est une div avec le titre 'buyer-name' et l'autre est un span avec la classe 'item-price':

source: Knowing this we can create the correct XPath query and use the lxml ``xpath`` function like this:
fr: Sachant cela, nous pouvons créer la requête XPath correcte et utiliser la fonction ``xpath`` lxml comme ceci:

source: Let's see what we got exactly:
fr: Voyons voir ce que nous avons exactement:

source: Congratulations! We have successfully scraped all the data we wanted from a web page using lxml and Requests. We have it stored in memory as two lists. Now we can do all sorts of cool stuff with it: we can analyze it using Python or we can save it to a file and share it with the world.
fr: Félicitations! Nous avons scrapé avec succès toutes les données que nous voulions à partir d'une page Web en utilisant lxml et Requests. Nous les avons stocké en mémoire, dans deux listes. Maintenant, nous pouvons faire toutes sortes de trucs cools avec elles: nous pouvons l'analyser en utilisant Python ou nous pouvons l'enregistrer dans un fichier et les partager avec le monde.

source: Some more cool ideas to think about are modifying this script to iterate through the rest of the pages of this example dataset, or rewriting this application to use threads for improved speed.
fr: Quelques idées plus cools sur lesquelles réfléchir sont de modifier ce script pour parcourir le reste des pages de ce jeu de données exemple, ou la réécriture de cette application pour utiliser les threads pour améliorer la vitesse.
