Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/speed.po
Languages: fr

source: Speed
fr: Vitesse

source: CPython, the most commonly used implementation of Python, is slow for CPU bound tasks. `PyPy`_ is fast.
fr: CPython, l'implémentation la plus couramment utilisée de Python, est lente pour les tâches liées au CPU (processeur). `PyPy`_ est rapide.

source: Using a slightly modified version of `David Beazley's`_ CPU bound test code (added loop for multiple tests), you can see the difference between CPython and PyPy's processing.
fr: En utilisant une version légèrement modifiée du code de test lié au CPU de `David Beazley's`_ (boucle ajoutée pour de multiples tests), vous pouvez voir la différence entre le traitement CPython et PyPy.

source: Context
fr: Contexte

source: The GIL
fr: Le GIL

source: `The GIL`_ (Global Interpreter Lock) is how Python allows multiple threads to operate at the same time. Python's memory management isn't entirely thread-safe, so the GIL is required to prevent multiple threads from running the same Python code at once.
fr: `The GIL`_ (Global Interpreter Lock) est comment Python permet à plusieurs threads de fonctionner en même temps. La gestion de la mémoire de Python est pas entièrement thread-safe, de sorte que le GIL est requis pour empêcher plusieurs threads d'exécuter le même code Python à la fois.

source: David Beazley has a great `guide`_ on how the GIL operates. He also covers the `new GIL`_ in Python 3.2. His results show that maximizing performance in a Python application requires a strong understanding of the GIL, how it affects your specific application, how many cores you have, and where your application bottlenecks are.
fr: David Beazley a un bon `guide`_ sur la manière dont le GIL opère. I lcouvre aussi le `new GIL`_ dans Python 3.2. Ses résultats montrent que maximiser les performances dans une application Python nécessite une bonne compréhension de la GIL, comment il affecte votre application spécifique, combien de cœurs que vous avez, et où sont vos goulots d'étranglement dans l'application.

source: C Extensions
fr: Extensions C

source: `Special care`_ must be taken when writing C extensions to make sure you register your threads with the interpreter.
fr: Une `Special care`_ doit être prise lors de l'écriture d'extensions C pour vous assurer que vous enregistrez vos threads avec l'interpréteur.

source: `Cython <http://cython.org/>`_ implements a superset of the Python language with which you are able to write C and C++ modules for Python. Cython also allows you to call functions from compiled C libraries. Using Cython allows you to take advantage of Python's strong typing of variables and operations.
fr: `Cython <http://cython.org/>`_ implémente un sur-ensemble du langage Python avec lequel vous êtes en mesure d'écrire des modules C et C ++ pour Python. Cython vous permet également d'appeler des fonctions depuis des bibliothèques compilées C. Utiliser Cython vous permet de tirer avantage du typage fort des variables Python et des opérations.

source: Here's an example of strong typing with Cython:
fr: Voici un exemple de typage fort avec Cython:

source: This implementation of an algorithm to find prime numbers has some additional keywords compared to the next one, which is implemented in pure Python:
fr: L'implémentation d'un algorithme pour trouver des nombres premiers a quelques mots-clés supplémentaires par rapport à la suivante, qui est implémentée en pur Python:

source: Notice that in the Cython version you declare integers and integer arrays to be compiled into C types while also creating a Python list:
fr: Notez que dans la version Cython, vous déclarez les entiers et les tableaux d'entiers qui seront compilés en types C, tout en créant aussi une liste Python:

source: What is the difference? In the upper Cython version you can see the declaration of the variable types and the integer array in a similar way as in standard C. For example `cdef int n,k,i` in line 3. This additional type declaration (i.e. integer) allows the Cython compiler to generate more efficient C code from the second version. While standard Python code is saved in :file:`*.py` files, Cython code is saved in :file:`*.pyx` files.
fr: Quelle est la différence? Dans la version Cython ci-dessus, vous pouvez voir la déclaration des types de variables et le tableau entier d'une manière similaire à celle du standard C. Par exemple `cdef int n,k,i` dans la ligne 3. Cette déclaration de type supplémentaire (c'est à dire entier) permet au compilateur Cython de générer du code C plus efficace à partir de la deuxième version. Alors que le code standard de Python est sauvé dans des fichiers :file:`*.py`, le code Cython est sauvé dans des fichiers :file:`*.pyx`.

source: What's the difference in speed? Let's try it!
fr: Quelle est la différence de vitesse? Essayons!

source: These lines both need a remark:
fr: Ces deux lignes nécessitent une remarque:

source: The `pyximport` module allows you to import :file:`*.pyx` files (e.g., :file:`primesCy.pyx`) with the Cython-compiled version of the `primes` function. The `pyximport.install()` command allows the Python interpreter to start the Cython compiler directly to generate C-code, which is automatically compiled to a :file:`*.so` C-library. Cython is then able to import this library for you in your Python code, easily and efficiently. With the `time.time()` function you are able to compare the time between these 2 different calls to find 500 prime numbers. On a standard notebook (dual core AMD E-450 1.6 GHz), the measured values are:
fr: Le module `pyximport` vous permet d'importer les fichiers :file:`*.pyx` (par exemple, :file:`primesCy.pyx`) avec la version compilée par Cython de la fonction `primes`. La commande `pyximport.install()`permet à l'interpréteur Python de démarrer directement le compilateur Cython pour générer le code C, qui est automatiquement compilé en une bibliothèque C :file:`*.so`. Cython est alors capable d'importer cette bibliothèque pour vous dans votre code Python, facilement et efficacement. Avec la fonction `time.time()`, vous êtes en mesure de comparer le temps entre ces 2 différents appels pour trouver 500 nombres premiers. Sur un ordinateur portable standard (dual core AMD E-450 1,6 GHz), les valeurs mesurées sont:

source: And here the output of an embedded `ARM beaglebone <http://beagleboard.org/Products/BeagleBone>`_ machine:
fr: Et voici la sortie sur une machine `ARM beaglebone <http://beagleboard.org/Products/BeagleBone>`_ intégreé:

source: Write about Numba and the autojit compiler for NumPy
fr: Écrire à propos de Numba et du compilateur autojit pour NumPy

source: Concurrency
fr: Concurrence

source: The `concurrent.futures`_ module is a module in the standard library that provides a "high-level interface for asynchronously executing callables". It abstracts away a lot of the more complicated details about using multiple threads or processes for concurrency, and allows the user to focus on accomplishing the task at hand.
fr: Le module `concurrent.futures`_ est un module dans la bibliothèque standard qui fournit une "interface de haut-niveau pour exécuter des callables de manière asynchrone". Il abstrait une grande partie des détails les plus compliqués sur l'utilisation de plusieurs threads ou processus pour la concurrence, et permet à l'utilisateur de se concentrer sur l'accomplissement de la tâche à accomplir.

source: The `concurrent.futures`_ module exposes two main classes, the `ThreadPoolExecutor` and the `ProcessPoolExecutor`. The ThreadPoolExecutor will create a pool of worker threads that a user can submit jobs to. These jobs will then be executed in another thread when the next worker thread becomes available.
fr: Le module `concurrent.futures`_ expose deux classes principales, `ThreadPoolExecutor` et `ProcessPoolExecutor`. Le ThreadPoolExecutor va créer un pool de worker threads auquel un utilisateur peut soumettre des jobs à faire. Ces jobs seront ensuite exécutés dans un autre thread quand le prochain worker thread va devenir disponible.

source: The ProcessPoolExecutor works in the same way, except instead of using multiple threads for its workers, it will use multiple processes. This makes it possible to side-step the GIL, however because of the way things are passed to worker processes, only picklable objects can be executed and returned.
fr: Le ProcessPoolExecutor fonctionne de la même manière, sauf au lieu d'utiliser plusieurs threads pour ses workers, elle utilisera de multiples processus. Cela permet de mettre de côté le GIL, cependant à cause de la façon dont les choses sont passées à des processus workers, seuls les objets picklables peuvent être exécutés et retournés.

source: Because of the way the GIL works, a good rule of thumb is to use a ThreadPoolExecutor when the task being executed involves a lot of blocking (i.e. making requests over the network) and to use a ProcessPoolExecutor executor when the task is computationally expensive.
fr: En raison de la manière dont le GIL fonctionne, une bonne règle de base est d'utiliser une ThreadPoolExecutor lorsque la tâche en cours d'exécution implique beaucoup de blocage (à savoir faire des requêtes sur le réseau) et d'utiliser un exécuteur ProcessPoolExecutor lorsque la tâche est informatiquement coûteuse.

source: There are two main ways of executing things in parallel using the two Executors. One way is with the `map(func, iterables)` method. This works almost exactly like the builtin `map()` function, except it will execute everything in parallel. :
fr: Il existe deux principales manières d'exécuter des choses en parallèle en utilisant les deux exécuteurs. Une façon est avec la méthode `map(func, iterables)`. Cela fonctionne presque exactement comme la fonction intégrée `map()`, sauf qu'il exécutera tout en parallèle. :

source: For even more control, the `submit(func, *args, **kwargs)` method will schedule a callable to be executed ( as `func(*args, **kwargs)`) and returns a `Future`_ object that represents the execution of the callable.
fr: Pour encore plus de contrôle, la méthode `submit(func, *args, **kwargs)` programmera qu'un callable soit exécuté ( comme `func(*args, **kwargs)`) et retourne un objet `Future`_ qui représente l'exécution du callable.

source: The Future object provides various methods that can be used to check on the progress of the scheduled callable. These include:
fr: L'objet Future fournit diverses méthodes qui peuvent être utilisées pour vérifier l'état d'avancement du callable programmé. Cela inclut:

source: Attempt to cancel the call.
fr: Tentative d'annulation de l'appel.

source: Return True if the call was successfully cancelled.
fr: Retourne True si l'appel a été annulé avec succès.

source: Return True if the call is currently being executed and cannot be cancelled.
fr: Retourne True si l'appel a été exécuté à ce moment et ne peut pas annulé.

source: Return True if the call was successfully cancelled or finished running.
fr: Retourne True si l'appel a été annulé avec succès ou a fini de s'exécuter.

source: Return the value returned by the call. Note that this call will block until the scheduled callable returns by default.
fr: Retourne la valeur retournée par l'appel. Notez que cet appel sera bloquant jusqu'à le callable programmé soit retourné par défaut.

source: Return the exception raised by the call. If no exception was raised then this returns `None`. Note that this will block just like `result()`.
fr: Retourne l'exception levée par l'appel. Si aucune exception n'a été levée alors cela retourne `None`. Notez que cela va bloquer tout comme `result()`.

source: Attach a callback function that will be executed (as `fn(future)`) when the scheduled callable returns.
fr: Attache une fonction de callback qui sera exécutée (comme `fn(future)`) quand le callable prévu sera retourné.

source: The `concurrent.futures`_ module contains two helper functions for working with Futures. The `as_completed(futures)` function returns an iterator over the list of futures, yielding the futures as they complete.
fr: Le module `concurrent.futures`_ contient deux helpers pour travailler avec Futures. La fonction `as_completed(futures)` retourne un itérateur sur la liste des futures, en faisant un yield des futures jusqu'à ce qu'elles soient complètes.

source: The `wait(futures)` function will simply block until all futures in the list of futures provided have completed.
fr: La fonction `wait(futures)` va tout simplement bloquer jusqu'à ce que toutes les futures dans la liste des futures soient terminées.

source: For more information, on using the `concurrent.futures`_ module, consult the official documentation.
fr: Pour plus d'informations, sur l'utilisation du module `concurrent.futures`_, consulter la documentation officielle.

source: The standard library comes with a `threading`_ module that allows a user to work with multiple threads manually.
fr: La bibliothèque standard est livré avec un module `threading`_ qui permet à un utilisateur de travailler avec plusieurs threads manuellement.

source: Running a function in another thread is as simple as passing a callable and it's arguments to `Thread`'s constructor and then calling `start()`:
fr: Exécuter une fonction dans un autre thread est aussi simple que de passer un callable et ses arguments constructeur du `Thread' et d'appeler ensuite `start()`:

source: To wait until the thread has terminated, call `join()`:
fr: Pour attendre jusqu'à ce que le thread soit terminé, appelez `join()`:

source: After calling `join()`, it is always a good idea to check whether the thread is still alive (because the join call timed out):
fr: Après l'appel du `join()`, c'est toujours une bonne idée de vérifier si le thread est toujours en vie (parce que l'appel join a expiré):

source: Because multiple threads have access to the same section of memory, sometimes there might be situations where two or more threads are trying to write to the same resource at the same time or where the output is dependent on the sequence or timing of certain events. This is called a `data race`_ or race condition. When this happens, the output will be garbled or you may encounter problems which are difficult to debug. A good example is this `stackoverflow post`_.
fr: Parce que plusieurs threads ont accès à la même section de la mémoire, parfois il peut y avoir des situations où deux ou plusieurs threads tentent d'écrire sur la même ressource en même temps ou lorsque la sortie est dépendante de la séquence ou du timing de certains événements. Ceci est appelé une `data race`_ ou "race condition". Lorsque cela se produit, la sortie sera dénaturée ou vous pouvez rencontrer des problèmes qui sont difficiles à débuguer. Un bon exemple est ce `stackoverflow post`_.

source: The way this can be avoided is by using a `Lock`_ that each thread needs to acquire before writing to a shared resource. Locks can be acquired and released through either the contextmanager protocol (`with` statement), or by using `acquire()` and `release()` directly. Here is a (rather contrived) example:
fr: La façon dont cela peut être évité est d'utiliser un `Lock`_ que chaque thread aura besoin d'acquérir avant d'écrire dans une ressource partagée. Les locks peuvent être acquis et libérés soit par le protocole de contextmanager (déclaration `with`), ou en utilisant `acquire()` et `release()` directement. Voici un exemple (plutôt artificiel):

source: Here, we have a bunch of threads checking for changes on a list of sites and whenever there are any changes, they attempt to write those changes to a file by calling `log(changes)`. When `log()` is called, it will wait to acquire the lock with `with file_lock:`. This ensures that at any one time, only one thread is writing to the file.
fr: Ici, nous avons un tas de threads vérifiant des changements sur une liste de sites et chaque fois qu'il y a des changements, ils tentent d'écrire ces modifications dans un fichier en appelant `log(changes)`. Lorsque `log()` est appelé, il attendra d'acquérir le lock avec `avec file_lock:`. Cela garantit qu'à tout moment, seulement un seul thread est en train d'écrire dans le fichier.

source: Spawning Processes
fr: Processus de spawning
