Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/web.po
Languages: fr

source: `Chameleon <https://chameleon.readthedocs.org/>`_ Page Templates are an HTML/XML template engine implementation of the `Template Attribute Language (TAL) <http://en.wikipedia.org/wiki/Template_Attribute_Language>`_, `TAL Expression Syntax (TALES) <http://chameleon.readthedocs.org/en/latest/reference.html#expressions-tales>`_, and `Macro Expansion TAL (Metal) <http://chameleon.readthedocs.org/en/latest/reference.html#macros-metal>`_ syntaxes.
fr: Les Page Templates de `Chameleon <https://chameleon.readthedocs.org/>`_ sont l'implémentation dans un moteur de template HTML/XML des syntaxes `Template Attribute Language (TAL) <http://en.wikipedia.org/wiki/Template_Attribute_Language>`_, `TAL Expression Syntax (TALES) <http://chameleon.readthedocs.org/en/latest/reference.html#expressions-tales>`_, et `Macro Expansion TAL (Metal) <http://chameleon.readthedocs.org/en/latest/reference.html#macros-metal>`_.

source: Chameleon is available for Python 2.5 and up (including 3.x and pypy), and is commonly used by the `Pyramid Framework <http://trypyramid.com>`_.
fr: Chameleon est disponible pour Python 2.5 et plus (y compris 3.x et pypy), et est couramment utilisé par le `Framework Pyramid <http://trypyramid.com>`_.

source: Page Templates add within your document structure special element attributes and text markup. Using a set of simple language constructs, you control the document flow, element repetition, text replacement and translation. Because of the attribute-based syntax, unrendered page templates are valid HTML and can be viewed in a browser and even edited in WYSIWYG editors. This can make round-trip collaboration with designers and prototyping with static files in a browser easier.
fr: "Page Templates" ajoute au sein de votre structure de document des éléments d'attributs spéciaux et du texte de markup. En utilisant un ensemble de constructions de langage simples, vous contrôlez le flux du document, la répétition d'élément , le remplacement de texte et de la traduction. A cause de la syntaxe basée sur des attributs, les templates de page non-rendus sont valides HTML et peuvent être regardés dans un navigateur et même édités dans des éditeurs WYSIWYG. Cela peut permettre la collaboration par aller-retour avec des designers et le prototypage avec des fichiers statiques dans un navigateur plus facile.

source: The basic TAL language is simple enough to grasp from an example:
fr: Le langage TAL de base est assez simple à comprendre à partir d'un exemple:

source: The `<span tal:replace="expression" />` pattern for text insertion is common enough that if you do not require strict validity in your unrendered templates, you can replace it with a more terse and readable syntax that uses the pattern `${expression}`, as follows:
fr: Le pattern `<span tal:replace="expression" />` pour l'insertion de texte est suffisamment courant pour que vous ne demandiez pas une validité stricte dans vos templates non-rendus. Vous pouvez le remplacer par une syntaxe plus concise et lisible qui utilise le pattern `${expression}`, comme suit:

source: But keep in mind that the full `<span tal:replace="expression">Default Text</span>` syntax also allows for default content in the unrendered template.
fr: Mais gardez à l'esprit que la syntaxe complète `<span tal:replace="expression">texte par défaut</span>` permet aussi d'avoir un contenu par défaut dans le modèle non-rendu.

source: Being from the Pyramid world, Chameleon is not widely used.
fr: Venant du monde Pyramid, Chameleon n'est pas largement utilisé.

source: `Mako <http://www.makotemplates.org/>`_ is a template language that compiles to Python for maximum performance. Its syntax and api is borrowed from the best parts of other templating languages like Django and Jinja2 templates. It is the default template language included with the `Pylons and Pyramid <http://www.pylonsproject.org/>`_ web frameworks.
fr: `Mako <http://www.makotemplates.org/>`_ est un langage de template qui compile en Python pour une performance maximale. Sa syntaxe et son api sont empruntées des meilleures parties d'autres langages de templating comme les modèles Django et Jinja2. Il est le langage de template par défaut inclus avec les frameworks web `Pylons et Pyramid <http://www.pylonsproject.org/>`_.

source: An example template in Mako looks like:
fr: Un template exemple en Mako ressemble à ceci:

source: To render a very basic template, you can do the following:
fr: Pour faire le rendu d'un template très basique, vous pouvez faire ce qui suit:

source: Mako is well respected within the Python web community.
fr: Mako est bien respecté au sein de la communauté web Python.

source: References
fr: Références

source: `The mod_python project is now officially dead <http://blog.dscpl.com.au/2010/06/modpython-project-is-now-officially.html>`_
fr: `Le projet mod_python est maintenant officiellement mort <http://blog.dscpl.com.au/2010/06/modpython-project-is-now-officially.html>`_

source: `Benchmark of Python WSGI Servers <http://nichol.as/benchmark-of-python-web-servers>`_
fr: `Benchmark de serveurs WSGI Python <http://nichol.as/benchmark-of-python-web-servers>`_
