Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/web.po
Languages: fr

source: Web Applications
fr: Applications Web

source: As a powerful scripting language adapted to both fast prototyping and bigger projects, Python is widely used in web application development.
fr: En tant que puissant langage de scripting adapté à la fois au prototypage rapide et à de plus gros projets, Python est largement utilisé dans le développement d'applications web.

source: Context
fr: Contexte

source: The Web Server Gateway Interface (or "WSGI" for short) is a standard interface between web servers and Python web application frameworks. By standardizing behavior and communication between web servers and Python web frameworks, WSGI makes it possible to write portable Python web code that can be deployed in any :ref:`WSGI-compliant web server <wsgi-servers-ref>`. WSGI is documented in :pep:`3333`.
fr: Le Web Server Gateway Interface (ou "WSGI" pour faire court) est une interface standard entre les serveurs Web et les frameworks web Python. En normalisant le comportement et la communication entre les serveurs Web et les frameworks web Python, WSGI permet d'écrire du code web Python portable qui peut être déployé dans tout :ref:`serveur Web conforme à WSGI <wsgi-servers-ref>`. WSGI est documentée dans la :pep:`3333`.

source: Broadly speaking, a web framework consists of a set of libraries and a main handler within which you can build custom code to implement a web application (i.e. an interactive web site). Most web frameworks include patterns and utilities to accomplish at least the following:
fr: D'une manière générale, un framework web se compose d'un ensemble de bibliothèques et un gestionnaire principal au sein duquel vous pouvez construire un code personnalisé pour implémenter une application Web (par exemple, un site web interactif). La plupart des frameworks web incluent des modèles et des utilitaires pour accomplir au moins ce qui suit:

source: URL Routing
fr: Routing d'URL

source: Matches an incoming HTTP request to a particular piece of Python code to be invoked
fr: Fait correspondre une requête HTTP entrante vers un bout de code Python particulier pour être invoqué

source: Request and Response Objects
fr: Objets Requête et Réponse

source: Encapsulate the information received from or sent to a user's browser
fr: Encapsule l'information reçue ou expédiée au navigateur d'un utilisateur

source: Template Engine
fr: Moteur de template

source: Allows for separating Python code implementing an application's logic from the HTML (or other) output that it produces
fr: Permet la séparation du code Python implémentant la logique d'une application de la sortie HTML (ou autre) qu'elle produit

source: Development Web Server
fr: Serveur web de développement

source: Runs an HTTP server on development machines to enable rapid development; often automatically reloads server-side code when files are updated
fr: Exécute un serveur HTTP sur les machines de développement pour permettre un développement rapide; souvent recharge automatiquement le code côté serveur quand les fichiers sont mis à jour

source: `Django <http://www.djangoproject.com>`_ is a "batteries included" web application framework, and is an excellent choice for creating content-oriented websites. By providing many utilities and patterns out of the box, Django aims to make it possible to build complex, database-backed web applications quickly, while encouraging best practices in code written using it.
fr: `Django <http://www.djangoproject.com>`_ est un framework d'application web "tout en un", et est un excellent choix pour la création de sites Web orientés contenu. En fournissant utilitaires et patterns par défaut, Django a pour but de permettre de construire rapidement des applications web complexes Web, reposant sur des base de données, tout en encourageant les bonnes pratiques dans le code écrit qui l'utilise.

source: Django has a large and active community, and many pre-built `re-usable modules <http://djangopackages.com/>`_ that can be incorporated into a new project as-is, or customized to fit your needs.
fr: Django a une communauté importante et active, et de nombreux modules pré-construits `réutilisables <http://djangopackages.com/>`_ qui peuvent être incorporés dans un nouveau projet tel quel, ou personnalisé pour répondre à vos besoins.

source: There are annual Django conferences `in the United States <http://djangocon.us>`_ and `in Europe <http://djangocon.eu>`_.
fr: Il y a des conférences annuelles de Django `aux États-Unis <http://djangocon.us>`_ et `en Europe <http://djangocon.eu>`_.

source: The majority of new Python web applications today are built with Django.
fr: La majorité des nouvelles applications web Python d'aujourd'hui sont construites avec Django.

source: `Flask <http://flask.pocoo.org/>`_ is a "microframework" for Python, and is an excellent choice for building smaller applications, APIs, and web services.
fr: `Flask <http://flask.pocoo.org/>`_ est un "microframework" pour Python, et est un excellent choix pour la construction de petites applications, d'APIs et des services Web.

source: Building an app with Flask is a lot like writing standard Python modules, except some functions have routes attached to them. It's really beautiful.
fr: Construire une application avec Flask est un peu comme l'écriture des modules standards de Python, sauf certaines fonctions ont des routes qui leur sont rattachées. C'est vraiment très beau.

source: Rather than aiming to provide everything you could possibly need, Flask implements the most commonly-used core components of a web application framework, like URL routing, request and response objects, and templates.
fr: Plutôt que de viser à fournir tout ce dont vous pourriez avoir besoin, Flask implémente les composants noyaux les plus couramment utilisés d'un framework web, comme le routage d'URL, les objets request et response et les templates.

source: If you use Flask, it is up to you to choose other components for your application, if any. For example, database access or form generation and validation are not built-in functions of Flask.
fr: Si vous utilisez Flask, c'est à vous de choisir d'autres composants pour votre application, le cas échéant. Par exemple, l'accès aux base de données ou la génération et la validation de formulaires ne sont pas des fonctions natives dans Flask.

source: This is great, because many web applications don't need those features. For those that do, there are many `Extensions <http://flask.pocoo.org/extensions/>`_ available that may suit your needs. Or, you can easily use any library you want yourself!
fr: C'est super, car de nombreuses applications Web ne nécessitent pas ces fonctionnalités. Pour celles qui en ont besoin, il y a de nombreuses `extensions <http://flask.pocoo.org/extensions/>`_ disponibles qui peuvent répondre à vos besoins. Ou, vous pouvez facilement utiliser toute bibliothèque dont vous voulez vous-même!

source: Flask is default choice for any Python web application that isn't a good fit for Django.
fr: Flask est le choix par défaut pour toutes les applications web Python qui ne sont pas adaptées à Django.

source: `Tornado <http://www.tornadoweb.org/>`_ is an asyncronous web framework for Python that has its own event loop. This allows it to natively support WebSockets, for example. Well-written Tornado applications are known to have excellent performance characteristics.
fr: `Tornado <http://www.tornadoweb.org/>`_ est un framework web asynchrone pour Python qui a sa propre boucle d'événements. Cela lui permet de supporter nativement les WebSockets, par exemple. Les applications Tornado bien écrites sont connues pour avoir d'excellentes performances.

source: I do not recommend using Tornado unless you think you need it.
fr: Je ne recommande pas d'utiliser Tornado sauf si vous pensez que vous en avez besoin.

source: `Pyramid <https://trypyramid.com/>`_ is a very flexible framework with a heavy focus on modularity. It comes with a small number of libraries ("batteries") built-in, and encourages users to extend its base functionality.
fr: `Pyramid <https://trypyramid.com/>`_ est un framework très souple se concentrant fortement sur la modularité. Il est livré avec un petit nombre de bibliothèques ("toutes en unes") intégrées, et encourage les utilisateurs à étendre ses fonctionnalités de base.

source: Pyramid does not have a large user base, unlike Django and Flask. It's a capable framework, but not a very popular choice for new Python web applications today.
fr: Pyramid n'a pas une grosse base d'utilisateurs, contrairement à Django et Flask. C'est un framework intelligent, mais pas un choix très populaire pour les nouvelles applications web Python de nos jours.

source: Web Servers
fr: Serveurs web

source: `Nginx <http://nginx.org/>`_ (pronounced "engine-x") is a web server and reverse-proxy for HTTP, SMTP and other protocols. It is known for its high performance, relative simplicity, and compatibility with many application servers (like WSGI servers). It also includes handy features like load-balancing, basic authentication, streaming, and others. Designed to serve high-load websites, Nginx is gradually becoming quite popular.
fr: `Nginx <http://nginx.org/>`_ (prononcé "engine-x ") est un serveur web et un reverse-proxy pour HTTP, SMTP et d'autres protocoles. Il est connu pour sa haute performance, la simplicité relative, et sa compatibilité avec de nombreux serveurs d'applications (comme les serveurs WSGI). Il inclut aussi des fonctionnalités pratiques comme le load-balancing, l'authentification basique, le streaming, et d'autres encore. Conçu pour servir des sites à forte charge, Nginx est progressivement en train de devenir populaire.

source: WSGI Servers
fr: Serveurs WSGI

source: Stand-alone WSGI servers typically use less resources than traditional web servers and provide top performance [3]_.
fr: Les serveurs WSGI autonomes utilisent généralement moins de ressources que les serveurs web traditionnels et offrent les meilleures performances [3]_.

source: `Gunicorn <http://gunicorn.org/>`_ (Green Unicorn) is a pure-python WSGI server used to serve Python applications. Unlike other Python web servers, it has a thoughtful user-interface, and is extremely easy to use and configure.
fr: `Gunicorn <http://gunicorn.org/>`_ (Green Unicorn) est un serveur de WSGI en pur-python utilisé pour servir des applications Python. Contrairement à d'autres serveurs web Python, il a une interface utilisateur réfléchie, et est extrêmement facile à utiliser et à configurer.

source: Gunicorn has sane and reasonable defaults for configurations. However, some other servers, like uWSGI, are tremendously more customizable, and therefore, are much more difficult to effectively use.
fr: Gunicorn a des configurations par défaut saines et raisonnables. Cependant, certains autres serveurs, comme uWSGI, sont largement plus personnalisables, et par conséquent, sont beaucoup plus difficiles à utiliser efficacement.

source: Gunicorn is the recommended choice for new Python web applications today.
fr: Gunicorn est le choix recommandé pour de nouvelles applications Python web aujourd'hui.

source: `Waitress <http://waitress.readthedocs.org>`_ is a pure-python WSGI server that claims "very acceptable performance". Its documentation is not very detailed, but it does offer some nice functionality that Gunicorn doesn't have (e.g. HTTP request buffering).
fr: `Waitress <http://waitress.readthedocs.org>`_ est un serveur de WSGI pur-python qui affirme avoir des "performances très acceptables". Sa documentation est pas très détaillée, mais elle offre quelques fonctionnalités intéressantes que Gunicorn n'a pas (par exemple la mise en mémoire tampon de requête HTTP).

source: Waitress is gaining popularity within the Python web development community.
fr: Waitress gagne en popularité au sein de la communauté de développement web Python.

source: `uWSGI <https://uwsgi-docs.readthedocs.org>`_ is a full stack for building hosting services. In addition to process management, process monitoring, and other functionality, uWSGI acts as an application server for various programming languages and protocols - including Python and WSGI. uWSGI can either be run as a stand-alone web router, or be run behind a full web server (such as Nginx or Apache). In the latter case, a web server can configure uWSGI and an application's operation over the `uwsgi protocol <https://uwsgi-docs.readthedocs.org/en/latest/Protocol.html>`_. uWSGI's web server support allows for dynamically configuring Python, passing environment variables and further tuning. For full details, see `uWSGI magic variables <https://uwsgi-docs.readthedocs.org/en/latest/Vars.html>`_.
fr: `uWSGI <https://uwsgi-docs.readthedocs.org>`_ est une pile complète pour construire des services d'hébergement. En plus de la gestion des processus, la surveillance des processus, et d'autres fonctionnalités, uWSGI agit comme un serveur d'applications pour différents langages de programmation et protocoles - y compris Python et WSGI. uWSGI peut soit être exécuté comme un routeur Web autonome, ou être exécuté derrière un serveur web complet (comme Nginx ou Apache). Dans ce dernier cas, un serveur Web peut configurer uWSGI et le fonctionnement d'une application par dessus le `protocole uwsgi <https://uwsgi-docs.readthedocs.org/en/latest/Protocol.html>`_. Le support d'un serveur Web uWSGI permet la configuration dynamique de Python, en passant des variables d'environnement et plus de réglages. Pour plus de détails, reportez-vous `aux variables magiques uWSGI <https://uwsgi-docs.readthedocs.org/en/latest/Vars.html>`_.

source: I do not recommend using uWSGI unless you know why you need it.
fr: Je ne recommande pas d'utiliser uWSGI sauf si vous savez pourquoi vous en avez besoin.

source: Server Best Practices
fr: Meilleures pratiques serveur

source: The majority of self-hosted Python applications today are hosted with a WSGI server such as :ref:`Gunicorn <gunicorn-ref>`, either directly or behind a lightweight web server such as :ref:`nginx <nginx-ref>`.
fr: La majorité des applications auto-hébergées Python aujourd'hui est hébergée avec un serveur WSGI tels que :ref:`Gunicorn <gunicorn-ref>`, soit directement, soit derrière un serveur web léger tel que :ref:`nginx <nginx-ref>`.

source: The WSGI servers serve the Python applications while the web server handles tasks better suited for it such as static file serving, request routing, DDoS protection, and basic authentication.
fr: Les serveurs WSGI servent les applications Python pendant que le serveur Web gère les tâches mieux adaptées pour lui comme la mise à disposition des fichiers statiques, les requêtes de routage, la protection DDoS, et l'authentification basique.

source: Hosting
fr: Hébergement

source: Platform-as-a-Service (PaaS) is a type of cloud computing infrastructure which abstracts and manages infrastructure, routing, and scaling of web applications. When using a PaaS, application developers can focus on writing application code rather than needing to be concerned with deployment details.
fr: Un Platform-as-a-Service (PaaS) est un type d'infrastructure de "cloud computing" qui fait abstraction et gère l'infrastructure, le routage et le scaling des applications Web. Lorsque vous utilisez un PaaS, les développeurs d'applications peuvent se concentrer sur l'écriture du code de l'application plutôt que de se préoccuper des détails du déploiement.

source: `Heroku <http://www.heroku.com/python>`_ offers first-class support for Python 2.7–3.5 applications.
fr: `Heroku <http://www.heroku.com/python>`_ offre un soutien de première classe pour les applications Python 2,7–3,5

source: Heroku supports all types of Python web applications, servers, and frameworks. Applications can be developed on Heroku for free. Once your application is ready for production, you can upgrade to a Hobby or Professional application.
fr: Heroku supporte tous les types d'applications Python Web, serveurs et frameworks. Les applications peuvent être développées sur Heroku gratuitement. Une fois que votre application est prête pour la production, vous pouvez passer votre application en formule Hobby ou Professional.

source: Heroku maintains `detailed articles <https://devcenter.heroku.com/categories/python>`_ on using Python with Heroku, as well as `step-by-step instructions <https://devcenter.heroku.com/articles/getting-started-with-python>`_ on how to set up your first application.
fr: Heroku maintient des `articles détaillés <https://devcenter.heroku.com/categories/python>`_ sur l'utilisation de Python avec Heroku, ainsi que `des instructions pas à pas <https://devcenter.heroku.com/articles/getting-started-with-python>`_ sur comment configurer votre première application.

source: Heroku is the recommended PaaS for deploying Python web applications today.
fr: Heroku est le PaaS recommandé pour le déploiement d'applications web Python aujourd'hui.

source: `Gondor <https://gondor.io/>`_ is a PaaS specialized for deploying Django and Pinax applications. Gondor recommends Django version 1.6 and supports any WSGI application on Python version 2.7. Gondor can automatically configure your Django site if you use :file:`local_settings.py` for site-specific configuration information.
fr: `Gondor <https://gondor.io/>`_ est un PaaS spécialisé pour le déploiement d'applications Django et Pinax. Gondor recommande Django version 1.6 et prend en charge toutes les applications WSGI sur Python version 2.7. Gondor peut configurer automatiquement votre site Django si vous utilisez :file:`local_settings.py` pour les informations de configuration spécifiques au site.

source: Gondor has a guide on deploying `Django projects <https://gondor.io/support/django/setup/>`_.
fr: Gondor a un guide sur le déploiement de `projets Django <https://gondor.io/support/django/setup/>`_.

source: Gondor is run by a small company and focuses on helping businesses find success with Python and Django.
fr: Gondor est géré par une petite entreprise et se concentre pour aider les entreprises à trouver le succès avec Python et Django.

source: Most WSGI applications are responding to HTTP requests to serve content in HTML or other markup languages. Instead of generating directly textual content from Python, the concept of separation of concerns advises us to use templates. A template engine manages a suite of template files, with a system of hierarchy and inclusion to avoid unnecessary repetition, and is in charge of rendering (generating) the actual content, filling the static content of the templates with the dynamic content generated by the application.
fr: La plupart des applications WSGI répondent à des requêtes HTTP pour servir du contenu en HTML ou d'autres langages de balisage. Au lieu de générer directement le contenu textuel depuis Python, le concept de séparation des problèmes nous conseille d'utiliser des templates. Un moteur de template gère un ensemble de fichiers de templates, avec un système de hiérarchie et d'inclusion pour éviter des répétitions inutiles, et est en charge du rendu (génération) du contenu proprement dit, remplissant le contenu statique des templates avec le contenu dynamique généré par l'application .

source: As template files are sometimes written by designers or front-end developers, it can be difficult to handle increasing complexity.
fr: Comme les fichiers de template sont parfois écrits par des designers ou développeurs front-end, il peut être difficile de gérer une complexité croissante.

source: Some general good practices apply to the part of the application passing dynamic content to the template engine, and to the templates themselves.
fr: Quelques bonnes pratiques générales s'appliquent à la partie de l'application qui passe le contenu dynamique au moteur de template, et aux templates eux-mêmes

source: Template files should be passed only the dynamic content that is needed for rendering the template. Avoid the temptation to pass additional content "just in case": it is easier to add some missing variable when needed than to remove a likely unused variable later.
fr: Les fichiers de template ne doivent passer que le contenu dynamique nécessaire pour faire le rendu du template. Évitez la tentation de passer du contenu supplémentaire "juste au cas où": il est plus facile d'ajouter une variable manquante en cas de besoin que de supprimer une variable inutilisée plus tard.

source: Many template engines allow for complex statements or assignments in the template itself, and many allow some Python code to be evaluated in the templates. This convenience can lead to uncontrolled increase in complexity, and often make it harder to find bugs.
fr: Beaucoup de moteurs de template des déclarations complexes ou des affectations dans le template lui-même, et beaucoup autorisent qu'un peu de code Python soit évalué dans les templates. Cette facilité peut entraîner une augmentation incontrôlée de la complexité, et souvent rendre plus difficile de trouver les bugs.

source: It is often necessary to mix JavaScript templates with HTML templates. A sane approach to this design is to isolate the parts where the HTML template passes some variable content to the JavaScript code.
fr: Il est souvent nécessaire de mélanger les templates JavaScript avec des templates HTML. Une approche saine à cette conception est d'isoler les parties où le template HTML passe un contenu variable au code JavaScript.

source: `Jinja2 <http://jinja.pocoo.org/>`_ is a very well-regarded template engine.
fr: `Jinja2 <http://jinja.pocoo.org/>`_ est un moteur de template très respecté.

source: It uses a text-based template language and can thus be used to generate any type markup, not just HTML. It allows customization of filters, tags, tests and globals. It features many improvements over Django's templating system.
fr: Il utilise un langage de template basé sur du texte et peut donc être utilisé pour générer n'importe quel type de markup, et pas seulement du HTML. Il permet la personnalisation des filtres, de tags, de tests et des globals. Il dispose de nombreuses améliorations par rapport au système de template de Django.

source: Here some important html tags in Jinja2:
fr: Voici quelques balises html importantes dans Jinja2:

source: The next listings is an example of a web site in combination with the Tornado web server. Tornado is not very complicated to use.
fr: L'ensemble des listings suivants est un exemple de site web en combinaison avec le serveur web Tornado. Tornado est pas très compliqué à utiliser.

source: The :file:`base.html` file can be used as base for all site pages which are for example implemented in the content block.
fr: Le fichier :file:`base.html` peut être utilisé comme base pour toutes les pages du site qui sont par exemple implémentées dans le bloc de contenu.

source: The next listing is our site page (:file:`site.html`) loaded in the Python app which extends :file:`base.html`. The content block is automatically set into the corresponding block in the :file:`base.html` page.
fr: Le prochain listing est notre page de site (:file:`site.html`) chargé dans l'application Python qui étend :file:`base.html`. Le bloc de contenu est automatiquement défini dans le bloc correspondant dans la page :file:`base.html`.

source: Jinja2 is the recommended templating library for new Python web applications.
fr: Jinja2 est la bibliothèque de templating recommandée pour les nouvelles applications Python web.
