Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/scenarios/xml.po
Languages: fr

source: XML parsing
fr: Parsage XML

source: `untangle <https://github.com/stchris/untangle>`_ is a simple library which takes an XML document and returns a Python object which mirrors the nodes and attributes in its structure.
fr: `untangle <https://github.com/stchris/untangle>`_ est une bibliothèque simple qui prend un document XML et retourne un objet Python qui reflète les nœuds et les attributs dans sa structure.

source: For example, an XML file like this:
fr: Par exemple, un fichier XML comme ceci:

source: can be loaded like this:
fr: peut être chargé comme ceci:

source: and then you can get the child elements name like this:
fr: et ensuite vous pouvez obtenir le nom des éléments fils comme ceci:

source: untangle also supports loading XML from a string or an URL.
fr: untangle supporte aussi le chargement de XML depuis une chaîne de caractères ou une URL.

source: `xmltodict <http://github.com/martinblech/xmltodict>`_ is another simple library that aims at making XML feel like working with JSON.
fr: `xmltodict <http://github.com/martinblech/xmltodict>`_ est une autre bibliothèque simple qui vise à faire que le XML donne l'impression de travailler avec JSON

source: An XML file like this:
fr: Un fichier XML comme ceci:

source: can be loaded into a Python dict like this:
fr: peut être chargé dans un dictionnaire Python comme ceci:

source: and then you can access elements, attributes and values like this:
fr: et ensuite, vous pouvez accéder aux éléments, attributs et valeurs comme ceci:

source: xmltodict also lets you roundtrip back to XML with the unparse function, has a streaming mode suitable for handling files that don't fit in memory and supports namespaces.
fr: xmltodict vous permet aussi des aller-retours au XML avec la fonction unparse, dispose d'un mode streaming adapté à la manipulation des fichiers qui ne rentrent pas en mémoire et supporte les espaces de noms.
