Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/writing/documentation.po
Languages: fr

source: Readability is a primary focus for Python developers, in both project and code documentation. Following some simple best practices can save both you and others a lot of time.
fr: La lisibilité est une priorité pour les développeurs Python, à la fois dans la documentation du projet et du code. Suivre quelques bonnes pratiques simples peut vous sauver, vous et d'autres, beaucoup de temps.

source: Project Documentation
fr: Documentation de projet

source: A :file:`README` file at the root directory should give general information to both users and maintainers of a project. It should be raw text or written in some very easy to read markup, such as :ref:`reStructuredText-ref` or Markdown. It should contain a few lines explaining the purpose of the project or library (without assuming the user knows anything about the project), the URL of the main source for the software, and some basic credit information. This file is the main entry point for readers of the code.
fr: Un fichier :file:`README` à la racine du répertoire devrait donner des informations générales à la fois pour les utilisateurs et les mainteneurs d'un projet. Il devrait être du texte brut ou écrit dans avec un markup très facile à lire, par exemple :ref:`reStructuredText-ref` ou Markdown. Il devrait contenir quelques lignes expliquant le but du projet ou de la bibliothèque (sans supposer que l'utilisateur ne sait rien sur le projet), l'URL de la source principale du logiciel, ainsi que des informations de crédit basiques. Ce fichier est le principal point pour les lecteurs du code.

source: An :file:`INSTALL` file is less necessary with Python. The installation instructions are often reduced to one command, such as ``pip install module`` or ``python setup.py install`` and added to the :file:`README` file.
fr: Un fichier :file:`INSTALL` est moins nécessaire avec Python. Les instructions d'installation sont souvent réduites à une commande, comme ``pip install module`` ou ``python setup.py install`` et ajoutée au fichier :file:`README`.

source: A :file:`LICENSE` file should *always* be present and specify the license under which the software is made available to the public.
fr: Un fichier :file:`LICENSE` devrait *toujours* être présent et préciser la licence sous laquelle le logiciel est mis à la disposition du public.

source: A :file:`TODO` file or a ``TODO`` section in :file:`README` should list the planned development for the code.
fr: Un fichier :file:`TODO` file ou une section ``TODO`` dans le :file:`README` devrait lister le développement prévu pour le code.

source: A :file:`CHANGELOG` file or section in :file:`README` should compile a short overview of the changes in the code base for the latest versions.
fr: Un fichier :file:`CHANGELOG` ou une section dans dans le :file:`README` doit compiler un bref aperçu des changements dans la base de code pour les versions les plus récentes.

source: Project Publication
fr: Publication de projet

source: Depending on the project, your documentation might include some or all of the following components:
fr: Selon le projet, la documentation peut inclure tout ou partie des composants suivants:

source: An *introduction* should show a very short overview of what can be done with the product, using one or two extremely simplified use cases. This is the thirty-second pitch for your project.
fr: Une *introduction* devrait montrer une très bref aperçu de ce qui peut être fait avec le produit, en utilisant un ou deux cas d'utilisation extrêmement simplifiés. C'est le pitch de 30 seconds de votre projet.

source: A *tutorial* should show some primary use cases in more detail. The reader will follow a step-by-step procedure to set-up a working prototype.
fr: Un *tutoriel* devrait montrer certains cas d'utilisation de base plus en détail. Le lecteur suivra une procédure pas à pas pour configurer un prototype fonctionnel.

source: An *API reference* is typically generated from the code (see :ref:`docstrings <docstring-ref>`). It will list all publicly available interfaces, parameters, and return values.
fr: Une *référence d'API* est généralement générée à partir du code (voir :ref:`docstrings <docstring-ref>`). Elle liste toutes les interfaces, les paramètres et les valeurs de retour publiques.

source: *Developer documentation* is intended for potential contributors. This can include code convention and general design strategy of the project.
fr: *La documentation développeur* est destinée aux contributeurs potentiels. Cela peut inclure les conventions de code et la stratégie de conception générale du projet.

source: Sphinx_ is far and away the most popular Python documentation tool. **Use it.** It converts :ref:`restructuredtext-ref` markup language into a range of output formats including HTML, LaTeX (for printable PDF versions), manual pages, and plain text.
fr: Sphinx_ est de loin l'outil le plus populaire de la documentation Python. **Utilisez-le** Il convertit le langage de markup :ref:`restructuredtext-ref` dans une gamme de formats de sortie incluant HTML, LaTeX (pour les versions imprimables PDF), les pages de manuel et le texte brut.

source: There is also **great**, **free** hosting for your Sphinx_ docs: `Read The Docs`_. Use it. You can configure it with commit hooks to your source repository so that rebuilding your documentation will happen automatically.
fr: Il y a aussi un hébergement **génial** et **gratuit** pour votre documentation Sphinx_: `Read The Docs`_. Utilisez-le. Vous pouvez le configurer avec des hooks de commit liés à votre dépôt source. Ainsi, la re-génération de votre documentation se fera automatiquement.

source: Sphinx is famous for its API generation, but it also works well for general project documentation. This Guide is built with Sphinx_ and is hosted on `Read The Docs`_
fr: Sphinx est célèbre pour sa production d'API, mais il fonctionne aussi bien pour la documentation générale de projet. Ce guide est construit avec Sphinx_ et est hébergé sur `Read The Docs`_

source: Most Python documentation is written with reStructuredText_. It's like Markdown with all the optional extensions built in.
fr: La plupart de la documentation Python est écrite avec reStructuredText_. C'est comme le Markdown avec toutes les extensions optionnelles intégrées.

source: The `reStructuredText Primer`_ and the `reStructuredText Quick Reference`_ should help you familiarize yourself with its syntax.
fr: Le `reStructuredText Primer`_ et le `reStructuredText Quick Reference`_ devraient vous aider à vous familiariser avec sa syntaxe.

source: Code Documentation Advice
fr: Conseils de documentation de code

source: Comments clarify the code and they are added with purpose of making the code easier to understand. In Python, comments begin with a hash (number sign) (``#``).
fr: Les commentaires clarifient le code et ils sont ajoutés dans le but de rendre le code plus facile à comprendre. En Python, les commentaires commencent par un dièse (signe dièse)(``#``).

source: In Python, *docstrings* describe modules, classes, and functions:
fr: En Python, les *docstrings* décrivent les modules, les classes et les fonctions:

source: In general, follow the comment section of :pep:`8#comments` (the "Python Style Guide"). More information about docstrings can be found at :pep:`0257#specification` (The Docstring Conventions Guide).
fr: En général, suivez la section des commentaires de la :pep:`8#comments` (le "guide de style Python"). Plus d'informations sur les docstrings peuvent être trouvées sur la :pep:`0257#specification` (Le guide convention Docstring).

source: Commenting Sections of Code
fr: Commenter des section de code

source: *Do not use triple-quote strings to comment code*. This is not a good practice, because line-oriented command-line tools such as grep will not be aware that the commented code is inactive. It is better to add hashes at the proper indentation level for every commented line. Your editor probably has the ability to do this easily, and it is worth learning the comment/uncomment toggle.
fr: *N'utilisez pas des chaînes avec triple-guillemets pour commenter le code*. Ce n'est pas une bonne pratique, parce que les outils orientés lignes en ligne de commande tels que grep ne seront pas conscients que le code commenté est inactif. Il est préférable d'ajouter des dièses au niveau d'indentation correct pour chaque ligne commentée. Votre éditeur a probablement la capacité à faire cela facilement, et cela vaut la peine d'apprendre le bouton pour commenter/décommenter.

source: Docstrings and Magic
fr: Docstrings et la magie

source: Some tools use docstrings to embed more-than-documentation behavior, such as unit test logic. Those can be nice, but you won't ever go wrong with vanilla "here's what this does."
fr: Certains outils utilisent docstrings pour intégrer un comportement étant plus que de la documentation, tels que la logique de test unitaire. Ceux-ci peuvent être bien, mais vous ne vous tromperez jamais avec "voici ce que cela fait."

source: Docstrings versus Block comments
fr: Docstrings versus commentaires de bloc

source: These aren't interchangeable. For a function or class, the leading comment block is a programmer's note. The docstring describes the *operation* of the function or class:
fr: Ceux-ci ne sont pas interchangeables. Pour une fonction ou une classe, le premier bloc de commentaire est une note d'un programmeur. Le docstring décrit le *fonctionnement* de la fonction ou de la classe:

source: Other Tools
fr: Autres outils

source: You might see these in the wild. Use :ref:`sphinx-ref`.
fr: Vous pouvez voir ceux-là dans la nature. Utilisez :ref:`sphinx-ref`.

source: Pycco is a "literate-programming-style documentation generator" and is a port of the node.js Docco_. It makes code into a side-by-side HTML code and documentation.
fr: Pycco est un "générateur de documentation basé sur un style de Programmation lettrée" et est un port de Docco_ en node.js. Il transforme le code en un rendu HTML avec code et documentation côte à côte.

source: Ronn builds Unix manuals. It converts human readable textfiles to roff for terminal display, and also to HTML for the web.
fr: Ronn génère les manuels Unix. Il convertit des fichiers texte lisibles par l'homme en roff pour affichage dans le terminal, et également en format HTML pour le web.

source: Epydoc is discontinued. Use :ref:`sphinx-ref` instead.
fr: Epydoc est interrompue. Utilisez :ref:`sphinx-ref` à la place.

source: MkDocs is a fast and simple static site generator that's geared towards building project documentation with Markdown.
fr: MkDocs est un générateur de site statique simple et rapide qui est orientée vers la construction de la documentation de projet avec Markdown.
