Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/writing/logging.po
Languages: fr

source: The :mod:`logging` module has been a part of Python's Standard Library since version 2.3. It is succinctly described in :pep:`282`. The documentation is notoriously hard to read, except for the `basic logging tutorial`_.
fr: Le module :mod:`logging` fait parti de la bibliothèque standard de Python depuis la version 2.3. Il est succinctement décrit dans la :pep:`282`. La documentation est notoirement difficile à lire, à l'exception du `basic logging tutorial`_.

source: Logging serves two purposes:
fr: Le logging sert deux buts:

source: **Diagnostic logging** records events related to the application's operation. If a user calls in to report an error, for example, the logs can be searched for context.
fr: **Le logging de diagnostic** enregistre les événements liés au fonctionnement de l'application. Si un utilisateur appelle pour signaler une erreur, par exemple, les logs peuvent être recherchés pour avoir un contexte.

source: **Audit logging** records events for business analysis. A user's transactions can be extracted and combined with other user details for reports or to optimize a business goal.
fr: **logging d'audit** enregistre les événements pour l'analyse des affaires. Les transactions d'un utilisateur peuvent être extraites et combinées avec d'autres détails de l'utilisateur pour les rapports ou pour optimiser un objectif d'affaires.

source: ... or Print?
fr: ... ou Print?

source: The only time that ``print`` is a better option than logging is when the goal is to display a help statement for a command line application. Other reasons why logging is better than ``print``:
fr: La seule fois que ``print`` est une meilleure option que le logging est lorsque l'objectif est d'afficher une déclaration d'aide pour une application en ligne de commande. D'autres raisons pour lesquelles le logging est mieux que ``print``:

source: The `log record`_, which is created with every logging event, contains readily available diagnostic information such as the file name, full path, function, and line number of the logging event.
fr: Le `log record`_, qui a été créé avec chaque événement de logging, contient des informations de diagnostic facilement disponibles tels que le nom du fichier, le chemin complet, la fonction et le numéro de ligne de l'événement de logging.

source: Events logged in included modules are automatically accessible via the root logger to your application's logging stream, unless you filter them out.
fr: Les événements loggués dans les modules inclus sont automatiquement accessibles via la racine du logger au flux de logs de votre application, à moins que vous ne les filtriez.

source: Logging can be selectively silenced by using the method :meth:`logging.Logger.setLevel` or disabled by setting the attribute :attr:`logging.Logger.disabled` to ``True``.
fr: Le logging peut être réduite au silence de manière sélective en utilisant la méthode :meth:`logging.Logger.setLevel` ou désactivée en définissant l'attribut :attr:`logging.Logger.disabled` à ``True``.

source: Logging in a Library
fr: Logging dans une bibliothèque

source: Notes for `configuring logging for a library`_ are in the `logging tutorial`_. Because the *user*, not the library, should dictate what happens when a logging event occurs, one admonition bears repeating:
fr: Les notes pour `configuring logging for a library`_ sont dans le `logging tutorial`_. Parce que *l'utilisateur*, pas la bibliothèque, devrait dicter ce qui se passe quand un événement de logging a lieu, une admonition à accepter est de se répéter:

source: It is strongly advised that you do not add any handlers other than NullHandler to your library’s loggers.
fr: Il est fortement recommandé de ne pas ajouter de handlers autres que NullHandler aux loggers de votre bibliothèque.

source: Best practice when instantiating loggers in a library is to only create them using the ``__name__`` global variable: the :mod:`logging` module creates a hierarchy of loggers using dot notation, so using ``__name__`` ensures no name collisions.
fr: Les meilleures pratiques lors de l'instanciation des loggers dans une bibliothèque est de seulement les créer en utilisant la variable globale ``__name__``: le module :mod:`logging` crée une hiérarchie de loggers en utilisant la notation point, donc utiliser ``__name__`` assure l'absence de collisions de noms.

source: Here is an example of best practice from the `requests source`_ -- place this in your ``__init__.py``
fr: Voici un exemple de bonne pratique depuis la `requests source`_ -- placez ceci dans votre ``__init__.py``

source: Logging in an Application
fr: Logging dans une application

source: The `twelve factor app <http://12factor.net>`_, an authoritative reference for good practice in application development, contains a section on `logging best practice <http://12factor.net/logs>`_. It emphatically advocates for treating log events as an event stream, and for sending that event stream to standard output to be handled by the application environment.
fr: Le site `twelve factor app <http://12factor.net>`_, une référence faisant autorité pour les bonnes pratiques dans le développement d'application, contient une section sur `les meilleures pratiques de logging <http://12factor.net/logs>`_. Elle prône avec insistance pour le traitement des événements de journal comme un flux d'événements, et pour envoyer ce flux d'événements à la sortie standard pour être traité par l'environnement d'application.

source: There are at least three ways to configure a logger:
fr: Il y a au moins 3 manières de configurer un logger:

source: Using an INI-formatted file:
fr: En utilisant un fichier formaté sous forme INI

source: **Pro**: possible to update configuration while running using the function :func:`logging.config.listen` to listen on a socket.
fr: **Avantages**: possible de mettre à jour la configuration lors de l'exécution en utilisant la fonction :func:`logging.config.listen` pour écouter sur un socket.

source: **Con**: less control (*e.g.* custom subclassed filters or loggers) than possible when configuring a logger in code.
fr: **Inconvénients**: moins de contrôle (*par exemple* pour des loggers ou filtres comme sous-classes) que possible lors de la configuration d'un logger dans le code.

source: Using a dictionary or a JSON-formatted file:
fr: En utilisant un dictionnaire ou un fichier formaté sous forme JSON:

source: **Pro**: in addition to updating while running, it is possible to load from a file using the :mod:`json` module, in the standard library since Python 2.6.
fr: **Avantages**: en plus de la mise à jour tout en exécutant, il est possible de charger à partir d'un fichier en utilisant le module :mod:`json`, dans la bibliothèque standard depuis Python 2.6.

source: **Con**: less control than when configuring a logger in code.
fr: **Inconvénients**: moins de contrôle que quand configuration d'un logger dans le code.

source: Using code:
fr: En utilisant du code:

source: **Pro**: complete control over the configuration.
fr: **Avantages**: contrôle complet sur la configuration.

source: **Con**: modifications require a change to source code.
fr: **Inconvénients**: modifications nécessitent un changement du code source.

source: Example Configuration via an INI File
fr: Exemple de configuration via un fichier INI

source: Let us say the file is named ``logging_config.ini``. More details for the file format are in the `logging configuration`_ section of the `logging tutorial`_.
fr: Disons que le fichier est nommé ``logging_config.ini``. Plus de détails pour le format de fichier se trouvent dans la section `logging configuration`_ du `logging tutorial`_.

source: Then use :meth:`logging.config.fileConfig` in the code:
fr: Ensuite, utilisez :meth:`logging.config.fileConfig` dans le code:

source: Example Configuration via a Dictionary
fr: Exemple de configuration via un dictionnaire

source: As of Python 2.7, you can use a dictionary with configuration details. :pep:`391` contains a list of the mandatory and optional elements in the configuration dictionary.
fr: A partir de Python 2.7, vous pouvez utiliser un dictionnaire avec les détails de configuration. La :pep:`391` contient une liste des éléments obligatoires et optionnels dans le dictionnaire de configuration.

source: Example Configuration Directly in Code
fr: Exemple de configuration directement dans le code
