Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/writing/reading.po
Languages: fr

source: Reading Great Code
fr: Lire du bon code

source: One of the core tenets behind the design of Python is creating readable code. The motivation behind this design is simple: The number one thing that Python programmers do is read code.
fr: L'un des principaux principes derrière la conception de Python est la création d'un code lisible. La motivation derrière cette conception est simple: La première chose que les programmeurs Python font est de lire le code.

source: One of the secrets of becoming a great Python programmer is to read, understand, and comprehend excellent code.
fr: L'un des secrets pour devenir un grand programmeur Python est de lire, de comprendre et d'appréhender un excellent code.

source: Excellent code typically follows the guidelines outlined in :ref:`code_style`, and does its best to express a clear and concise intent to the reader.
fr: Une excellent code suit généralement les lignes directrices énoncées dans :ref:`code_style`, et fait de son mieux pour exprimer une intention claire et concise au lecteur.

source: Included below is a list of recommended Python projects for reading. Each one of these projects is a paragon of Python coding.
fr: Ce qui est inclus ci-dessous est une liste de projets Python recommandés pour lecture. Chacun de ces projets est un parangon de codage Python.

source: `Howdoi <https://github.com/gleitz/howdoi>`_ Howdoi is a code search tool, written in Python.
fr: `Howdoi <https://github.com/gleitz/howdoi>`_ Howdoi est un outil de recherche de code, écrit en Python.

source: `Flask <https://github.com/mitsuhiko/flask>`_ Flask is a microframework for Python based on Werkzeug and Jinja2. It's intended for getting started very quickly and was developed with best intentions in mind.
fr: `Flask <https://github.com/mitsuhiko/flask>`_ Flask est un microframework pour Python basé sur Werkzeug et Jinja2. Il est destiné pour bien démarrer très rapidement et a été développé avec les meilleures intentions à l'esprit.

source: `Diamond <https://github.com/python-diamond/Diamond>`_ Diamond is a python daemon that collects metrics and publishes them to Graphite or other backends. It is capable of collecting cpu, memory, network, i/o, load and disk metrics. Additionally, it features an API for implementing custom collectors for gathering metrics from almost any source.
fr: `Diamond <https://github.com/python-diamond/Diamond>`_ Diamond est un daemon python qui recueille les métriques et les publie vers Graphite ou d'autres backends. Il est capable de collecter les métriques du cpu, de la mémoire, du réseau, des i/o, de la charge et des disques. En outre, il dispose d'une API pour implémenter des collecteurs personnalisés pour la collecte des métriques à partir de presque toutes les sources.

source: `Werkzeug <https://github.com/mitsuhiko/werkzeug>`_ Werkzeug started as simple collection of various utilities for WSGI applications and has become one of the most advanced WSGI utility modules. It includes a powerful debugger, full-featured request and response objects, HTTP utilities to handle entity tags, cache control headers, HTTP dates, cookie handling, file uploads, a powerful URL routing system and a bunch of community-contributed addon modules.
fr: `Werkzeug <https://github.com/mitsuhiko/werkzeug>`_ Werkzeug a commencé comme simple collection de divers utilitaires pour les applications WSGI et est devenu l'un des modules utilitaire WSGI les plus avancées. Il comprend un débogueur puissant, la gestion des objets request et response complet, des utilitaires HTTP pour gérer les tags d'entité, les en-têtes de contrôle de cache, les dates HTTP, la gestion des cookies, le téléchargement de fichiers, un système puissant de routage URL et un tas de modules addons contribués par la communauté.

source: `Requests <https://github.com/kennethreitz/requests>`_ Requests is an Apache2 Licensed HTTP library, written in Python, for human beings.
fr: `Requests <https://github.com/kennethreitz/requests>`_ Requests est une bibliothèque HTTP sous licence Apache 2, écrite en Python, pour les êtres humains.

source: `Tablib <https://github.com/kennethreitz/tablib>`_ Tablib is a format-agnostic tabular dataset library, written in Python.
fr: `Tablib <https://github.com/kennethreitz/tablib>`_ Tablib est une bibliothèque pour la gestion de jeux de données tabulaires, agnostique en terme de format, écrite en Python.

source: Include code examples of exemplary code from each of the projects listed. Explain why it is excellent code. Use complex examples.
fr: Inclure des exemples de code de code exemplaire de chacun des projets énumérés. Expliquer pourquoi c'est un excellent code. Utilisez des exemples complexes.

source: Explain techniques to rapidly identify data structures, algorithms and determine what the code is doing.
fr: Expliquer les techniques pour identifier rapidement les structures de données, les algorithmes et déterminer ce que le code fait.
