Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/writing/structure.po
Languages: fr

source: The dynamic typing of Python is often considered to be a weakness, and indeed it can lead to complexities and hard-to-debug code. Something named 'a' can be set to many different things, and the developer or the maintainer needs to track this name in the code to make sure it has not been set to a completely unrelated object.
fr: Le typage dynamique de Python est souvent considéré comme une faiblesse, et en effet, elle peut conduire à la complexité et à du code difficile à débugguer. Quelque chose nommée 'a' peut être assigné à de nombreuses choses différentes, et le développeur ou le mainteneur doit suivre ce nom dans le code pour s'assurer qu'il n'a pas été assigné à un objet complètement différent.

source: Some guidelines help to avoid this issue:
fr: Quelques lignes directrices pour éviter ce problème:

source: Avoid using the same variable name for different things.
fr: Évitez d'utiliser le même nom de variable pour des choses différentes.

source: **Bad**
fr: **Mauvais**

source: **Good**
fr: **Bon**

source: Using short functions or methods helps reduce the risk of using the same name for two unrelated things.
fr: Utiliser des fonctions ou des méthodes courtes permet de réduire le risque d'utiliser le même nom pour deux choses indépendantes.

source: It is better to use different names even for things that are related, when they have a different type:
fr: Il est préférable d'utiliser des noms différents, même pour des choses qui sont liées, quand elles ont un type différent:

source: There is no efficiency gain when reusing names: the assignments will have to create new objects anyway. However, when the complexity grows and each assignment is separated by other lines of code, including 'if' branches and loops, it becomes harder to ascertain what a given variable's type is.
fr: Il n'y a pas de gain d'efficacité lors de la réutilisation de noms: les affectations devront créer de nouveaux objets de toute façon. Toutefois, lorsque la complexité augmente et chaque affectation est séparée par d'autres lignes de code, incluant des branches 'si' et des boucles, il devient plus difficile d'établir quel est le type d'une variable donnée.

source: Some coding practices, like functional programming, recommend never reassigning a variable. In Java this is done with the `final` keyword. Python does not have a `final` keyword and it would be against its philosophy anyway. However, it may be a good discipline to avoid assigning to a variable more than once, and it helps in grasping the concept of mutable and immutable types.
fr: Certaines pratiques de codage, comme la programmation fonctionnelle, recommandent de ne jamais réaffecter une variable. En Java cela se fait avec le mot-clé `final`. Python n'a pas de mot-clé `final` et cela irait à l'encontre de sa philosophie de toute façon. Cependant, cela peut être une bonne discipline pour éviter d'assigner à une variable plus d'une fois, et cela aide à comprendre le concept de types mutables et immutables.

source: Mutable and immutable types
fr: Types mutables et immutables

source: Python has two kinds of built-in or user-defined types.
fr: Python a deux sortes de types intégrés/définis par l'utilisateur.

source: Mutable types are those that allow in-place modification of the content. Typical mutables are lists and dictionaries: All lists have mutating methods, like :py:meth:`list.append` or :py:meth:`list.pop`, and can be modified in place. The same goes for dictionaries.
fr: Les types mutables sont ceux qui permettent la modification sur place du contenu. Des mutables typiques sont les listes et les dictionnaires: toutes les listes ont des méthodes mutables, comme :py:meth:`list.append` ou :py:meth:`list.pop`, et peuvent être modifiées sur place. La même chose vaut pour les dictionnaires.

source: Immutable types provide no method for changing their content. For instance, the variable x set to the integer 6 has no "increment" method. If you want to compute x + 1, you have to create another integer and give it a name.
fr: Les types immuables fournissent aucune méthode pour modifier leur contenu. Par exemple, la variable x définie à l'entier 6 n'a pas de méthode "increment". Si vous voulez calculer x + 1, vous devez créer un autre entier et lui donner un nom.

source: One consequence of this difference in behavior is that mutable types are not "stable", and therefore cannot be used as dictionary keys.
fr: Une conséquence de cette différence de comportement est que les types mutables ne sont pas "stables", et ne peuvent donc être utilisées comme clés du dictionnaire.

source: Using properly mutable types for things that are mutable in nature and immutable types for things that are fixed in nature helps to clarify the intent of the code.
fr: L'utilisation correcte des types mutables pour des choses qui sont mutables par nature et des types immutables pour des choses qui sont fixes par nature aide à clarifier l'intention du code.

source: For example, the immutable equivalent of a list is the tuple, created with ``(1, 2)``. This tuple is a pair that cannot be changed in-place, and can be used as a key for a dictionary.
fr: Par exemple, l'équivalent immutable d'une liste est le tuple, créé avec ``(1, 2)``. Ce tuple est une paire qui ne peut pas être changé sur place, et qui peut être utilisée comme clé pour un dictionnaire.

source: One peculiarity of Python that can surprise beginners is that strings are immutable. This means that when constructing a string from its parts, it is much more efficient to accumulate the parts in a list, which is mutable, and then glue ('join') the parts together when the full string is needed. One thing to notice, however, is that list comprehensions are better and faster than constructing a list in a loop with calls to ``append()``.
fr: Une particularité de Python qui peut surprendre les débutants est que les chaînes sont immutables. Cela signifie que lors de la construction d'une chaîne à partir de ses parties, il est beaucoup plus efficace d'accumuler les parties dans une liste, qui est mutable, puis coller ('join') les morceaux ensemble lorsque la chaîne complète est nécessaire. Une chose à remarquer, cependant, est que les compréhensions de liste sont mieux et plus rapides que la construction d'une liste dans une boucle avec des appels à ``append()``.

source: One final thing to mention about strings is that using ``join()`` is not always best. In the instances where you are creating a new string from a pre-determined number of strings, using the addition operator is actually faster, but in cases like above or in cases where you are adding to an existing string, using ``join()`` should be your preferred method.
fr: Une dernière chose à mentionner sur les chaînes est que l'utilisation ``join()`` n'est est pas toujours ce qu'il y a de mieux. Dans les cas où vous créez une nouvelle chaîne depuis un nombre prédéterminé de chaînes, utiliser l'opérateur d'addition est vraiment plus rapide, mais dans des cas comme ci-dessus ou dans des cas où vous ajoutez à une chaîne existante, utiliser ``join()`` devrait être votre méthode de préférence.

source: You can also use the :ref:`% <python:string-formatting>` formatting operator to concatenate a pre-determined number of strings besides :py:meth:`str.join` and ``+``. However, :pep:`3101`, discourages the usage of the ``%`` operator in favor of the :py:meth:`str.format` method.
fr: Vous pouvez également utiliser l'opérateur de formatage :ref:`% <python:string-formatting>` pour concaténer un nombre prédéterminé de chaînes en plus de :py:meth:`str.join` et ``+``. Cependant, la :pep:`3101`, décourage l'utilisation de l'opérateur ``%`` en faveur de la méthode :py:meth:`str.format`.

source: Vendorizing Dependencies
fr: Inclure les dépendances dans l'arbre de source de votre dépôt de code

source: Further Reading
fr: Lectures complémentaires
