Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/writing/structure.po
Languages: fr

source: Structuring Your Project
fr: Structurer votre projet

source: By "structure" we mean the decisions you make concerning how your project best meets its objective. We need to consider how to best leverage Python's features to create clean, effective code. In practical terms, "structure" means making clean code whose logic and dependencies are clear as well as how the files and folders are organized in the filesystem.
fr: Par "structurer" nous entendons les décisions que vous faites concernant comment votre projet atteint au mieux son objectif. Nous avons besoin de considérer comment exploiter au mieux les fonctionnalités de Python pour créer un code propre et efficace. En termes pratiques, "structurer" signifie produire du code propre dont la logique et les dépendances sont claires ainsi que la façon dont les fichiers et dossiers sont organisés dans le système de fichiers.

source: Which functions should go into which modules? How does data flow through the project? What features and functions can be grouped together and isolated? By answering questions like these you can begin to plan, in a broad sense, what your finished product will look like.
fr: Quelle fonctions doivent aller dans quels modules? Comment circule la donnée dans le projet? Quelles fonctionnalités et fonctions peuvent être groupées ensemble et isolées? En répondant à des questions comme cela, vous pouvez commencer à planifier, au sens large, ce à quoi votre produit fini ressemblera.

source: In this section we take a closer look at Python's module and import systems as they are the central elements to enforcing structure in your project. We then discuss various perspectives on how to build code which can be extended and tested reliably.
fr: Dans cette section, nous allons jeter un œil de plus près sur les systèmes de module et d'import de Python comme ils sont les éléments centraux pour faire respecter une structure dans votre projet. Nous discuterons ensuite des diverses perspectives sur comment construire du code qui peut être étendu et testé de manière fiable.

source: Structure of the Repository
fr: Structure du dépôt

source: It's Important.
fr: C'est important

source: Just as Code Style, API Design, and Automation are essential for a healthy development cycle, Repository structure is a crucial part of your project's `architecture <http://www.amazon.com/gp/product/1257638017/ref=as_li_ss_tl?ie=UTF8&tag=bookforkind-20&linkCode=as2&camp=1789&creative=39095&creativeASIN=1257638017>`__.
fr: Juste comme le style de codage, le design d'API, et l'automatisation sont essentiels à un cycle de développement sain, la structure d'un dépôt est une part cruciale de l'`architecture <http://www.amazon.com/gp/product/1257638017/ref=as_li_ss_tl?ie=UTF8&tag=bookforkind-20&linkCode=as2&camp=1789&creative=39095&creativeASIN=1257638017>`__ de votre projet.

source: When a potential user or contributor lands on your repository's page, they see a few things:
fr: Quand un utilisateur potentiel ou un contributeur arrive sur la page d'un dépôt, ils voient certaines choses:

source: Project Name
fr: Le nom du projet

source: Project Description
fr: La description du projet

source: Bunch O' Files
fr: Un tas de fichiers

source: Only when they scroll below the fold will the user see your project's README.
fr: C'est seulement quand ils font défiler la page que les utilisateurs verront le README de votre projet.

source: If your repo is a massive dump of files or a nested mess of directories, they might look elsewhere before even reading your beautiful documentation.
fr: Si votre dépôt est un amas massif de fichiers ou une pagaille imbriquée de répertoires, ils risquent de regarder ailleurs avant même de lire votre belle documentation.

source: Dress for the job you want, not the job you have.
fr: Habillez vous pour le job que vous voulez, pas pour le job que vous avez.

source: Of course, first impressions aren't everything. You and your colleagues will spend countless hours working with this repository, eventually becoming intimately familiar with every nook and cranny. The layout of it is important.
fr: Bien sûr, les premières impressions ne sont pas tout. Vous et vos collègues allez passer un nombre d'heures incalculable à travailler sur ce dépôt, finalement devenir intimement familier avec tous les coins et recoins. Son organisation est importante.

source: Sample Repository
fr: Dépôt exemple

source: **tl;dr**: This is what `Kenneth Reitz <http://kennethreitz.org>`_ recommends.
fr: **tl;dr** (acronyme de "Too Long, I Didn't Read it"): C'est ce que `Kenneth Reitz <http://kennethreitz.org>`_ recommande.

source: This repository is `available on GitHub <https://github.com/kennethreitz/samplemod>`__.
fr: Ce dépôt est `disponible sur GitHub <https://github.com/kennethreitz/samplemod>`__.

source: Let's get into some specifics.
fr: Entrons dans quelques détails.

source: The Actual Module
fr: Le module actuel

source: Location
fr: Emplacement

source: ``./sample/`` or ``./sample.py``
fr: ``./sample/`` ou ``./sample.py``

source: Purpose
fr: But

source: The code of interest
fr: Le code qui nous intéresse

source: Your module package is the core focus of the repository. It should not be tucked away:
fr: Votre paquet de module est le point central du dépôt. Il ne devrait pas être mis à l'écart:

source: If your module consists of only a single file, you can place it directly in the root of your repository:
fr: Si votre module consiste en un seul fichier, vous pouvez le placer directement à la racine de votre répertoire:

source: Your library does not belong in an ambiguous src or python subdirectory.
fr: Votre bibliothèque n'appartient pas à un sous-répertoire ambigu comme src ou python.

source: License
fr: Licence

source: Lawyering up.
fr: Se couvrir juridiquement.

source: This is arguably the most important part of your repository, aside from the source code itself. The full license text and copyright claims should exist in this file.
fr: Ceci est sans doute la partie la plus importante de votre dépôt, en dehors du code source lui-même. Les revendications de copyright et le texte de la licence complet devraient être dans ce fichier.

source: If you aren't sure which license you should use for your project, check out `choosealicense.com <http://choosealicense.com>`_.
fr: Si vous n'êtes pas sûr de la licence que vous souhaitez utiliser pour votre projet, consultez `choosealicense.com <http://choosealicense.com>`_.

source: Of course, you are also free to publish code without a license, but this would prevent many people from potentially using your code.
fr: Bien sûr, vous êtes aussi libre de publier votre code sans une licence, mais cela risque potentiellement d'empêcher de nombreuses personnes d'utiliser votre code.

source: Package and distribution management.
fr: Gestion de la distribution et de la création de paquets

source: If your module package is at the root of your repository, this should obviously be at the root as well.
fr: Si votre paquet de module est à la racine de votre dépôt, ceci devrait évidemment être aussi à la racine.

source: Requirements File
fr: Fichier requirements

source: Development dependencies.
fr: Dépendances de développement.

source: A `pip requirements file <https://pip.pypa.io/en/stable/user_guide/#requirements-files>`__ should be placed at the root of the repository. It should specify the dependencies required to contribute to the project: testing, building, and generating documentation.
fr: Un `fichier requirements de pip <https://pip.pypa.io/en/stable/user_guide/#requirements-files>`__ devrait être placé à la racine du dépôt. Il devrait spécifier les dépendances requises pour contribuer au projet: les tests, les builds et la génération de la documentation.

source: If your project has no development dependencies, or you prefer development environment setup via ``setup.py``, this file may be unnecessary.
fr: Si votre projet n'a pas de dépendances de développement ou vous préférez la configuration de l'environnement de développement via ``setup.py``, ce fichier peut s'avérer non nécessaire.

source: Package reference documentation.
fr: Documentation de référence des paquets.

source: There is little reason for this to exist elsewhere.
fr: Il y a très peu de raison pour cela qu'il existe ailleurs.

source: Test Suite
fr: Suite de tests

source: ``./test_sample.py`` or ``./tests``
fr: ``./test_sample.py`` ou ``./tests``

source: Package integration and unit tests.
fr: Intégration de paquets et tests unitaires

source: Starting out, a small test suite will often exist in a single file:
fr: En débutant, une petite suite de tests existera souvent dans un seul fichier:

source: Once a test suite grows, you can move your tests to a directory, like so:
fr: Une fois que la suite de tests grossit, vous pouvez déplacer vos tests dans un répertoire, comme ceci:

source: Obviously, these test modules must import your packaged module to test it. You can do this a few ways:
fr: Évidemment, ces modules de test doivent importer votre module empaqueté pour le tester. Vous pouvez le faire de plusieurs façons:

source: Expect the package to be installed in site-packages.
fr: Attendre que le paquet soit installé dans site-packages.

source: Use a simple (but *explicit*) path modification to resolve the package properly.
fr: Utiliser un modification de chemin simple (mais *explicite*) pour résoudre le paquet correctement.

source: I highly recommend the latter. Requiring a developer to run `setup.py <http://setup.py>`__ develop to test an actively changing codebase also requires them to have an isolated environment setup for each instance of the codebase.
fr: Je recommande fortement ce dernier. Demander à un développeur de lancer `setup.py <http://setup.py>`__ develop pour tester une base de code qui change activement lui demande aussi d'avoir une configuration d'environnement isolé pour chaque instance de la base de code.

source: To give the individual tests import context, create a tests/context.py file:
fr: Pour donner un contexte d'importation aux tests individuels, créez un fichier tests/config.py.

source: Then, within the individual test modules, import the module like so:
fr: Ensuite, dans les modules de test individuels, importez le module comme ceci:

source: This will always work as expected, regardless of installation method.
fr: Cela fonctionnera toujours comme prévu quelle que soit la méthode d'installation.

source: Some people will assert that you should distribute your tests within your module itself -- I disagree. It often increases complexity for your users; many test suites often require additional dependencies and runtime contexts.
fr: Certains personnes avanceront que vous devriez distribuer vos tests à l'intérieur du module lui-même -- Je ne suis pas d'accord. Cela augmente souvent la complexité pour vos utilisateurs; de nombreuses suites de test nécessitent souvent des dépendances et des contextes d'exécution supplémentaires.

source: Generic management tasks.
fr: Tâches de gestion génériques.

source: If you look at most of my projects or any Pocoo project, you'll notice a Makefile laying around. Why? These projects aren't written in C... In short, make is a incredibly useful tool for defining generic tasks for your project.
fr: Si vous jetez un œil à la plupart de mes projets ou n'importe quel projet de Pocoo, vous remarquerez un Makefile qui traîne autour. Pourquoi? Ces projets ne sont pas écrits en C... En bref, make est un outil incroyablement utile pour définir des tâches génériques pour votre projet.

source: **Sample Makefile:**
fr: **Makefile exemple:**

source: Other generic management scripts (e.g. ``manage.py`` or ``fabfile.py``) belong at the root of the repository as well.
fr: D'autres scripts de gestion génériques (comme ``manage.py`` ou ``fabfile.py``) appartiennent aussi à la racine du dépôt.

source: Regarding Django Applications
fr: En ce qui concerne les applications Django

source: I've noticed a new trend in Django applications since the release of Django 1.4. Many developers are structuring their repositories poorly due to the new bundled application templates.
fr: J'ai noté une nouvelle tendance dans les applications Django depuis la sortie de Django 1.4. De nombreux développeurs structurent leurs dépôts de manière médiocre à cause des nouveaux modèles d'applications mis à disposition.

source: How? Well, they go to their bare and fresh repository and run the following, as they always have:
fr: Comment? Bien, ils vont dans leur nouveau dépôt encore nu et frais et exécutent ce qui suit, comme ils l'ont toujours fait:

source: The resulting repository structure looks like this:
fr: La structure du dépôt résultant ressemble à ceci:

source: Don't do this.
fr: Ne faites pas ça.

source: Repetitive paths are confusing for both your tools and your developers. Unnecessary nesting doesn't help anybody (unless they're nostalgic for monolithic SVN repos).
fr: Des chemins répétitifs sont sources de confusion à la fois pour vos outils et vos développeurs. Une imbrication inutile n'aide personne (à moins d'être nostalgique des dépôts SVN monolithiques)

source: Let's do it properly:
fr: Faisons-le proprement:

source: Note the "``.``".
fr: Notez le "``.``".

source: The resulting structure:
fr: La structure résultante:

source: Structure of Code is Key
fr: La structure du code est la clé

source: Thanks to the way imports and modules are handled in Python, it is relatively easy to structure a Python project. Easy, here, means that you do not have many constraints and that the module importing model is easy to grasp. Therefore, you are left with the pure architectural task of crafting the different parts of your project and their interactions.
fr: Grâce à la façon dont les imports et les modules sont traités en Python, il est relativement facile de structurer un projet Python. Facile, ici, signifie que vous n'avez pas beaucoup de contraintes et que le modèle qui fait l'import du module est facile à comprendre. Par conséquent, vous vous retrouvez avec la tâche architecturale pure de concevoir les différentes parties de votre projet et de leurs interactions.

source: Easy structuring of a project means it is also easy to do it poorly. Some signs of a poorly structured project include:
fr: Une structuration facile de projet signifie que c'est aussi facile de mal le faire. Certains signes d'un projet mal structuré incluent:

source: Multiple and messy circular dependencies: if your classes Table and Chair in :file:`furn.py` need to import Carpenter from :file:`workers.py` to answer a question such as ``table.isdoneby()``, and if conversely the class Carpenter needs to import Table and Chair, to answer the question ``carpenter.whatdo()``, then you have a circular dependency. In this case you will have to resort to fragile hacks such as using import statements inside methods or functions.
fr: Des dépendances circulaires multiples et désordonnées: si vos classes Table et Chair dans :file:`furn.py` ont besoin d'importer Carpenter depuis :file:`workers.py` pour répondre à une question comme ``table.isdoneby()``, et si au contraire la classe Carpenter a besoin d'importer Table et Chair, pour répondre à la question ``carpenter.whatdo()``, alors vous avez une dépendance circulaire. Dans ce cas, vous devrez recourir à des hacks fragiles telles que l'utilisation de déclarations d'importation à l'intérieur de méthodes ou de fonctions.

source: Hidden coupling: each and every change in Table's implementation breaks 20 tests in unrelated test cases because it breaks Carpenter's code, which requires very careful surgery to adapt the change. This means you have too many assumptions about Table in Carpenter's code or the reverse.
fr: Couplage caché: chaque changement dans l'implémentation de Table casse 20 tests dans des cas de tests non liés parce qu'il casse le code de Carpenter, qui nécessite une intervention ciblée très prudente pour adapter le changement. Cela signifie que vous avez trop d'hypothèses à propos de Table dans le code de Carpenter ou l'inverse.

source: Heavy usage of global state or context: instead of explicitly passing ``(height, width, type, wood)`` to each other, Table and Carpenter rely on global variables that can be modified and are modified on the fly by different agents. You need to scrutinize all access to these global variables to understand why a rectangular table became a square, and discover that remote template code is also modifying this context, messing with table dimensions.
fr: Un usage intensif d'un état ou d'un contexte global: au lieu de passer explicitement ``(height, width, type, wood)`` de l'un à l'autre, Table et Carpenter s’appuient sur des variables globales qui peuvent être modifiées et sont modifiées à la volée par différents agents. Vous devez examiner tous les accès à ces variables globales pour comprendre pourquoi une table rectangulaire est devenu un carré, et découvrir que le code du modèle distant est aussi en train de modifier ce contexte, mettant le désordre dans les dimensions de la table.

source: Spaghetti code: multiple pages of nested if clauses and for loops with a lot of copy-pasted procedural code and no proper segmentation are known as spaghetti code. Python's meaningful indentation (one of its most controversial features) make it very hard to maintain this kind of code. So the good news is that you might not see too much of it.
fr: Code Spaghetti: plusieurs pages de clauses if imbriquée et de boucles for avec beaucoup de code procédural copie-collé et aucune segmentation adéquate sont connus comme du code spaghetti. L'indentation significative de Python (une de ses caractéristiques les plus controversées) rend très difficile de maintenir ce genre de code. Donc, la bonne nouvelle est que vous pourriez ne pas en voir de trop.

source: Ravioli code is more likely in Python: it consists of hundreds of similar little pieces of logic, often classes or objects, without proper structure. If you never can remember if you have to use FurnitureTable, AssetTable or Table, or even TableNew for your task at hand, you might be swimming in ravioli code.
fr: Le code Ravioli est plus probable en Python: il se compose de centaines de petits morceaux semblables de logique, souvent des classes ou des objets, sans structure appropriée. Si vous ne pouvez vous rappeler si vous avez à utiliser FurnitureTable, AssetTable ou Table, ou même TableNew pour votre tâche, vous pourriez être en train de nager dans du code ravioli.

source: Python modules are one of the main abstraction layers available and probably the most natural one. Abstraction layers allow separating code into parts holding related data and functionality.
fr: Les modules Python sont l'une des principales couches d'abstraction disponible et probablement la plus naturelle. Les couches d'abstraction permettent la séparation du code dans des parties contenant des données et des fonctionnalités connexes.

source: For example, a layer of a project can handle interfacing with user actions, while another would handle low-level manipulation of data. The most natural way to separate these two layers is to regroup all interfacing functionality in one file, and all low-level operations in another file. In this case, the interface file needs to import the low-level file. This is done with the ``import`` and ``from ... import`` statements.
fr: Par exemple, une couche d'un projet peut gérer l'interface avec les actions utilisateurs, tandis qu'un autre gérerait la manipulation de bas-niveau des données. La façon la plus naturelle de séparer ces deux couches est de regrouper toutes les fonctionnalités d'interface dans un seul fichier, et toutes les opérations de bas-niveau dans un autre fichier. Dans ce cas, le fichier d'interface doit importer le fichier de bas-niveau. Cela se fait avec les déclarations ``import`` et ``from ... import``.

source: As soon as you use `import` statements you use modules. These can be either built-in modules such as `os` and `sys`, third-party modules you have installed in your environment, or your project's internal modules.
fr: Dès que vous utilisez les déclarations `import`, vous utilisez des modules. Ceux-ci peuvent être soit des modules intégrés comme `os` et `sys`, soit des modules tiers que vous avez installé dans votre environnement, ou dans les modules internes de votre projet.

source: To keep in line with the style guide, keep module names short, lowercase, and be sure to avoid using special symbols like the dot (.) or question mark (?). So a file name like :file:`my.spam.py` is one you should avoid! Naming this way will interfere with the way Python looks for modules.
fr: Pour rester aligné avec le guide de style, garder les noms de modules courts, en minuscules, et assurez-vous d'éviter d'utiliser des symboles spéciaux comme le point (.) ou le point d'interrogation (?). Donc, un nom de fichier comme :file:`my.spam.py` est l'un de ceux que vous devriez éviter! Nommer de cette façon interfère avec la manière dont Python cherche pour les modules.

source: In the case of `my.spam.py` Python expects to find a :file:`spam.py` file in a folder named :file:`my` which is not the case. There is an `example <http://docs.python.org/tutorial/modules.html#packages>`_ of how the dot notation should be used in the Python docs.
fr: Dans le cas de my.spam.py`, Python attend de trouver un fichier :file:`spam.py` dans un dossier nommé :file:`my`, ce qui n'est pas le cas. Il y a un `exemple <http://docs.python.org/tutorial/modules.html#packages>`_ de la comment la notation par point devrait être utilisée dans la documentation Python.

source: If you'd like you could name your module :file:`my_spam.py`, but even our friend the underscore should not be seen often in module names.
fr: Si vous souhaitez, vous pouvez nommer votre module :file:`my_spam.py`, mais même notre ami le underscore (tiret bas) ne devrait pas être vu souvent dans les noms de modules.

source: Aside from some naming restrictions, nothing special is required for a Python file to be a module, but you need to understand the import mechanism in order to use this concept properly and avoid some issues.
fr: Mis à part quelques restrictions de nommage, rien de spécial n'est nécessaire pour qu'un fichier Python puisse être un module, mais vous avez besoin de comprendre le mécanisme d'import afin d'utiliser ce concept correctement et éviter certains problèmes.

source: Concretely, the ``import modu`` statement will look for the proper file, which is :file:`modu.py` in the same directory as the caller if it exists. If it is not found, the Python interpreter will search for :file:`modu.py` in the "path" recursively and raise an ImportError exception if it is not found.
fr: Concrètement, la déclaration ``import modu`` va chercher le fichier approprié, qui est :file:`modu.py` dans le même répertoire que l'appelant si il existe. Si il n'est pas trouvé, l'interpréteur Python va rechercher :file:`modu.py` dans le "path" récursivement et lever une exception ImportError si il n'est pas trouvé.

source: Once :file:`modu.py` is found, the Python interpreter will execute the module in an isolated scope. Any top-level statement in :file:`modu.py` will be executed, including other imports if any. Function and class definitions are stored in the module's dictionary.
fr: Une fois que :file:`modu.py` est trouvé, l'interpréteur Python va exécuter le module dans une portée isolée. N'importe quelle déclaration à la racine de :file:`modu.py` sera exécutée, incluant les autres imports le cas échéant. Les définitions de fonction et classe sont stockées dans le dictionnaire du module.
