Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/writing/structure.po
Languages: fr

source: Then, the module's variables, functions, and classes will be available to the caller through the module's namespace, a central concept in programming that is particularly helpful and powerful in Python.
fr: Ensuite, les variables, les fonctions et les classes du module seront mises à disposition de l'appelant via l'espace de nom du module, un concept central dans la programmation qui est particulièrement utile et puissant en Python.

source: In many languages, an ``include file`` directive is used by the preprocessor to take all code found in the file and 'copy' it into the caller's code. It is different in Python: the included code is isolated in a module namespace, which means that you generally don't have to worry that the included code could have unwanted effects, e.g. override an existing function with the same name.
fr: Dans de nombreuses langages, une directive ``include file`` est utilisée par le préprocesseur pour prendre tout le code trouvé dans le fichier et le 'copier' dans le code de l'appelant. C'est différent en Python: le code inclus est isolé dans un espace de nom de module, ce qui signifie que vous n'avez pas généralement à vous soucier que le code inclus puisse avoir des effets indésirables, par exemple remplacer une fonction existante avec le même nom.

source: It is possible to simulate the more standard behavior by using a special syntax of the import statement: ``from modu import *``. This is generally considered bad practice. **Using** ``import *`` **makes code harder to read and makes dependencies less compartmentalized**.
fr: Il est possible de simuler le comportement plus standard en utilisant une syntaxe particulière de la déclaration d'import: ``from modu import *``. Ceci est généralement considéré comme une mauvaise pratique. **L'utilisation** d'``import *`` **rend le code plus difficile à lire et rend les dépendances moins cloisonnées**.

source: Using ``from modu import func`` is a way to pinpoint the function you want to import and put it in the global namespace. While much less harmful than ``import *`` because it shows explicitly what is imported in the global namespace, its only advantage over a simpler ``import modu`` is that it will save a little typing.
fr: L'utilisation de ``from modu import func`` est un moyen de cibler la fonction que vous souhaitez importer et la mettre dans l'espace de nom global. Bien que beaucoup moins néfaste que ``import *`` parce que cela montre explicitement ce qui est importé dans l'espace de nom global, son seul avantage par rapport à un ``import modu``, plus simple est qu'il permettra d'économiser un peu de frappe clavier.

source: **Very bad**
fr: **Très mauvais**

source: **Better**
fr: **Mieux**

source: **Best**
fr: **Le mieux**

source: As mentioned in the :ref:`code_style` section, readability is one of the main features of Python. Readability means to avoid useless boilerplate text and clutter, therefore some efforts are spent trying to achieve a certain level of brevity. But terseness and obscurity are the limits where brevity should stop. Being able to tell immediately where a class or function comes from, as in the ``modu.func`` idiom, greatly improves code readability and understandability in all but the simplest single file projects.
fr: Comme mentionné dans la section :ref:`code_style`, la lisibilité est l'une des principales caractéristiques de Python. La lisibilité signifie éviter du texte standard inutile et le désordre, donc des efforts sont consacrés pour essayer de parvenir à un certain niveau de concision. Mais le laconisme et l'obscur sont les limites où la brièveté doit cesser. Être en mesure de dire immédiatement d'où une classe ou une fonction provient, comme dans l'idiome ``modu.func``, améliore grandement la lisibilité du code et la compréhensibilité dans tous les projets même ceux avec le plus simple fichier unique.

source: Packages
fr: Paquets

source: Python provides a very straightforward packaging system, which is simply an extension of the module mechanism to a directory.
fr: Python fournit un système de packaging très simple, qui est simplement une extension du mécanisme de module à un répertoire.

source: Any directory with an :file:`__init__.py` file is considered a Python package. The different modules in the package are imported in a similar manner as plain modules, but with a special behavior for the :file:`__init__.py` file, which is used to gather all package-wide definitions.
fr: Tout répertoire avec un fichier :file:`__init__.py` est considéré comme un paquet Python. Les différents modules dans le paquet sont importés d'une manière similaire comme des modules simples, mais avec un comportement spécial pour le fichier :file:`__init__.py`, qui est utilisé pour rassembler toutes les définitions à l'échelle des paquets.

source: A file :file:`modu.py` in the directory :file:`pack/` is imported with the statement ``import pack.modu``. This statement will look for an :file:`__init__.py` file in :file:`pack`, execute all of its top-level statements. Then it will look for a file named :file:`pack/modu.py` and execute all of its top-level statements. After these operations, any variable, function, or class defined in :file:`modu.py` is available in the pack.modu namespace.
fr: Un fichier :file:`modu.py` dans le répertoire :file:`pack/` est importé avec la déclaration ``import pack.modu``. Cette déclaration va chercher un fichier :file:`__init__.py` dans :file:`pack`, exécuter toutes ses déclarations de premier niveau. Puis elle va chercher un fichier nommé :file:`pack/modu.py` et exécuter tous ses déclarations de premier niveau. Après ces opérations, n'importe quelle variable, fonction ou classe définie dans :file:`modu.py` est disponible dans l'espace de nom pack.modu.

source: A commonly seen issue is to add too much code to :file:`__init__.py` files. When the project complexity grows, there may be sub-packages and sub-sub-packages in a deep directory structure. In this case, importing a single item from a sub-sub-package will require executing all :file:`__init__.py` files met while traversing the tree.
fr: Un problème couramment vu est d'ajouter trop de code aux fichiers :file:`__init__.py`. Lorsque la complexité du projet grossit, il peut y avoir des sous-paquets et sous-sous-paquets dans une structure de répertoire profonde. Dans ce cas, importer un seul élément à partir d'un sous-sous-paquet nécessitera d'exécuter tous les fichiers :file:`__init__.py` rencontrés en traversant l'arbre.

source: Leaving an :file:`__init__.py` file empty is considered normal and even a good practice, if the package's modules and sub-packages do not need to share any code.
fr: Laisser un fichier :file:`__init__.py` vide est considéré comme normal et même une bonne pratique, si les modules du paquet et des sous-paquets n'ont pas besoin de partager aucun code.

source: Lastly, a convenient syntax is available for importing deeply nested packages: ``import very.deep.module as mod``. This allows you to use `mod` in place of the verbose repetition of ``very.deep.module``.
fr: Enfin, une syntaxe pratique est disponible pour importer des paquets imbriquées profondément: ``import very.deep.module as mod``. Cela vous permet d'utiliser `mod` à la place de la répétition verbeuse de ``very.deep.module``.

source: Object-oriented programming
fr: Programmation orientée objet

source: Python is sometimes described as an object-oriented programming language. This can be somewhat misleading and needs to be clarified.
fr: Python est parfois décrit comme un langage de programmation orienté objet. Cela peut être quelque peu trompeur et doit être clarifié.

source: In Python, everything is an object, and can be handled as such. This is what is meant when we say, for example, that functions are first-class objects. Functions, classes, strings, and even types are objects in Python: like any object, they have a type, they can be passed as function arguments, and they may have methods and properties. In this understanding, Python is an object-oriented language.
fr: En Python, tout est un objet, et peut être manipulé en tant que tel. Voilà ce que l'on entend quand nous disons, par exemple, que les fonctions sont des objets de première classe. Les fonctions, les classes, les chaînes et même les types sont des objets en Python: comme tout objet, ils ont un type, ils peuvent être passés comme arguments de fonction, et ils peuvent avoir des méthodes et propriétés. Sur ce point, Python est un langage orienté objet.

source: However, unlike Java, Python does not impose object-oriented programming as the main programming paradigm. It is perfectly viable for a Python project to not be object-oriented, i.e. to use no or very few class definitions, class inheritance, or any other mechanisms that are specific to object-oriented programming.
fr: Cependant, contrairement à Java, Python n'impose pas la programmation orientée objet comme paradigme de programmation principal. Il est parfaitement viable pour un projet de Python de ne pas être orienté objet, à savoir de ne pas utiliser ou très peu de définitions de classes, d'héritage de classe, ou d'autres mécanismes qui sont spécifiques à la programmation orientée objet.

source: Moreover, as seen in the modules_ section, the way Python handles modules and namespaces gives the developer a natural way to ensure the encapsulation and separation of abstraction layers, both being the most common reasons to use object-orientation. Therefore, Python programmers have more latitude to not use object-orientation, when it is not required by the business model.
fr: En outre, comme on le voit dans la section modules_, la façon dont Python gère les modules et les espaces de nom donne au développeur un moyen naturel pour assurer l'encapsulation et la séparation des couches d'abstraction, les deux étant les raisons les plus courantes d'utiliser l'orientation objet. Par conséquent, les programmeurs Python ont plus de latitude pour ne pas utiliser l'orientation objet, quand elle n'est pas requise par le modèle métier.

source: There are some reasons to avoid unnecessary object-orientation. Defining custom classes is useful when we want to glue together some state and some functionality. The problem, as pointed out by the discussions about functional programming, comes from the "state" part of the equation.
fr: Il y a quelques raisons pour éviter inutilement l'orientation objet. Définir des classes personnalisées est utile lorsque l'on veut coller ensemble un état et certaines fonctionnalités. Le problème, comme l'a souligné les discussions sur la programmation fonctionnelle, vient de la partie "state" de l'équation.

source: In some architectures, typically web applications, multiple instances of Python processes are spawned to respond to external requests that can happen at the same time. In this case, holding some state into instantiated objects, which means keeping some static information about the world, is prone to concurrency problems or race-conditions. Sometimes, between the initialization of the state of an object (usually done with the ``__init__()`` method) and the actual use of the object state through one of its methods, the world may have changed, and the retained state may be outdated. For example, a request may load an item in memory and mark it as read by a user. If another request requires the deletion of this item at the same time, it may happen that the deletion actually occurs after the first process loaded the item, and then we have to mark as read a deleted object.
fr: Dans certaines architectures, typiquement des applications Web, plusieurs instances de processus Python sont lancées pour répondre aux demandes externes qui peuvent se produire en même temps. Dans ce cas, tenir quelques états dans des objets instanciés, ce qui signifie garder des informations statiques sur le monde, est sujet à des problèmes de concurrence ou de race-conditions. Parfois, entre l'initialisation de l'état d'un objet (généralement fait avec la méthode ``__init__()``) et l'utilisation réelle de l'état de l'objet à travers l'une de ses méthodes, le monde peut avoir changé, et l'état retenu peut ne plus être à jour. Par exemple, une requête peut charger un élément en mémoire et le marquer comme lu par un utilisateur. Si une autre requête nécessite la suppression de cet article dans le même temps, il peut arriver que la suppression se produise pour de vrai après que le premier processus ait chargé l'élément, et ensuite nous devons marquer comme lu un objet supprimé.

source: This and other issues led to the idea that using stateless functions is a better programming paradigm.
fr: Ceci et d'autres problèmes a conduit à l'idée que l'utilisation des fonctions sans état est un meilleur paradigme de programmation.

source: Another way to say the same thing is to suggest using functions and procedures with as few implicit contexts and side-effects as possible. A function's implicit context is made up of any of the global variables or items in the persistence layer that are accessed from within the function. Side-effects are the changes that a function makes to its implicit context. If a function saves or deletes data in a global variable or in the persistence layer, it is said to have a side-effect.
fr: Une autre façon de dire la même chose est de suggérer l'utilisation des fonctions et procédures avec le moins de contextes implicites et d'effets de bord possibles. Le contexte d'une fonction implicite est composée de n'importe quelles variables ou objets globaux dans la couche de persistance qui sont accessibles depuis l'intérieur de la fonction. Les effets de bord sont les changements qu'une fonction fait à son contexte implicite. Si une fonction sauve ou supprime la donnée dans une variable globale ou dans la couche de persistance, elle est dite comme ayant un effet de bord.

source: Carefully isolating functions with context and side-effects from functions with logic (called pure functions) allow the following benefits:
fr: Isoler soigneusement les fonctions avec un contexte et des effets de bord depuis des fonctions avec une logique (appelé fonctions pures) permet les avantages suivants:

source: Pure functions are deterministic: given a fixed input, the output will always be the same.
fr: Les fonctions pures sont déterministes: pour une entrée donnée fixe, la sortie sera toujours la même.

source: Pure functions are much easier to change or replace if they need to be refactored or optimized.
fr: Les fonctions pures sont beaucoup plus faciles à changer ou remplacer si elles doivent être refactorisées ou optimisées.

source: Pure functions are easier to test with unit-tests: There is less need for complex context setup and data cleaning afterwards.
fr: Les fonctions pures sont plus faciles à tester avec des tests unitaires: il y a moins besoin d'une configuration du contexte complexe et d'un nettoyage des données après.

source: Pure functions are easier to manipulate, decorate, and pass around.
fr: Les fonctions pures sont plus faciles à manipuler, décorer, et déplacer.

source: In summary, pure functions are more efficient building blocks than classes and objects for some architectures because they have no context or side-effects.
fr: En résumé, les fonctions pures sont des blocs de construction plus efficaces que les classes et les objets pour certaines architectures parce qu'elles n'ont pas de contexte ou d'effets de bord.

source: Obviously, object-orientation is useful and even necessary in many cases, for example when developing graphical desktop applications or games, where the things that are manipulated (windows, buttons, avatars, vehicles) have a relatively long life of their own in the computer's memory.
fr: Évidemment, l'orientation objet est utile et même nécessaire dans de nombreux cas, par exemple lors du développement d'applications graphiques de bureau ou des jeux, où les choses qui sont manipulés (fenêtres, boutons, avatars, véhicules) ont une vie relativement longue par elle-même dans la mémoire de l'ordinateur.

source: Decorators
fr: Décorateurs

source: The Python language provides a simple yet powerful syntax called 'decorators'. A decorator is a function or a class that wraps (or decorates) a function or a method. The 'decorated' function or method will replace the original 'undecorated' function or method. Because functions are first-class objects in Python, this can be done 'manually', but using the @decorator syntax is clearer and thus preferred.
fr: Le langage Python fournit une syntaxe simple mais puissante appelée 'décorateurs'. Un décorateur est une fonction ou une classe qui enveloppe (ou décore) une fonction ou une méthode. La fonction ou méthode 'décorée" remplacera la fonction ou méthode originale 'non décorée' . Parce que les fonctions sont des objets de première classe en Python, cela peut être fait 'manuellement', mais utiliser la syntaxe @decorator est plus clair et donc préféré.

source: This mechanism is useful for separating concerns and avoiding external un-related logic 'polluting' the core logic of the function or method. A good example of a piece of functionality that is better handled with decoration is memorization or caching: you want to store the results of an expensive function in a table and use them directly instead of recomputing them when they have already been computed. This is clearly not part of the function logic.
fr: Ce mécanisme est utile pour la "Separation of concerns" et évite à une logique externe non liée de "polluer" la logique de base de la fonction ou de la méthode. Un bon exemple de morceau de fonctionnalité qui est mieux géré avec la décoration est la mémorisation ou la mise en cache: vous voulez stocker les résultats d'une fonction coûteuse dans une table et les utiliser directement au lieu de les recalculer quand ils ont déjà été calculés. Ceci ne fait clairement pas partie de la logique de la fonction.

source: Context Managers
fr: Gestionnaires de contexte

source: A context manager is a Python object that provides extra contextual information to an action. This extra information takes the form of running a callable upon initiating the context using the ``with`` statement, as well as running a callable upon completing all the code inside the ``with`` block. The most well known example of using a context manager is shown here, opening on a file:
fr: Un gestionnaire de contexte est un objet Python qui fournit une information contextuelle supplémentaire à une action. Cette information supplémentaire prend la forme de l'exécution d'un callable lors de l'initialisation d'un contexte à l'aide de la déclaration ``with``, ainsi que l'exécution d'un callable après avoir terminé tout le code à l'intérieur du bloc ``with``. L'exemple le plus connu d'utilisation d'un gestionnaire de contexte est montré ici, à l'ouverture d'un fichier:

source: Anyone familiar with this pattern knows that invoking ``open`` in this fashion ensures that ``f``'s ``close`` method will be called at some point. This reduces a developer's cognitive load and makes the code easier to read.
fr: Quiconque est familier avec ce pattern sait que l'invocation ``open`` de cette façon s'assure que la fonction ``close``de ``f`` sera appelée à un moment donné. Cela réduit la charge cognitive d'un développeur et rend le code plus facile à lire.

source: There are two easy ways to implement this functionality yourself: using a class or using a generator. Let's implement the above functionality ourselves, starting with the class approach:
fr: Il existe deux moyens faciles d’implémenter cette fonctionnalité vous-même: en utilisant une classe ou à l'aide d'un générateur. Implémentons la fonctionnalité ci-dessus nous-mêmes, en commençant par l'approche par classe:

source: This is just a regular Python object with two extra methods that are used by the ``with`` statement. CustomOpen is first instantiated and then its ``__enter__`` method is called and whatever ``__enter__`` returns is assigned to ``f`` in the ``as f`` part of the statement. When the contents of the ``with`` block is finished executing, the ``__exit__`` method is then called.
fr: C'est juste un objet Python régulier avec deux méthodes supplémentaires qui sont utilisés par la déclaration ``with``. CustomOpen est d'abord instancié puis sa méthode ``__enter__`` est appelée et tout ce que ``__enter__`` retourne est assigné à ``f`` dans la partie ``as _f`` de la déclaration. Lorsque le contenu du bloc ``with`` a fini de s'exécuter, la méthode ``__exit__`` est alors appelée.

source: And now the generator approach using Python's own `contextlib <https://docs.python.org/2/library/contextlib.html>`_:
fr: Et maintenant, l'approche par générateur en utilisant la bibliothèque `contextlib <https://docs.python.org/2/library/contextlib.html>`_ de Python:

source: This works in exactly the same way as the class example above, albeit it's more terse. The ``custom_open`` function executes until it reaches the ``yield`` statement. It then gives control back to the ``with`` statement, which assigns whatever was ``yield``'ed to `f` in the ``as f`` portion. The ``finally`` clause ensures that ``close()`` is called whether or not there was an exception inside the ``with``.
fr: Cela fonctionne exactement de la même manière que l'exemple de classe ci-dessus, mais il est plus laconique. La fonction ``custom_open`` s'exécute jusqu'à la déclaration ``yield``. Il rend alors le contrôle à la déclaration ``with``, qui assigne tout ce qui était ``yield``'é à `f`dans la portion `as f`. La clause ``finally`` s'assure que ``close()`` est appelé s'il y avait ou non une exception à l'intérieur du ``with``.

source: Since the two approaches appear the same, we should follow the Zen of Python to decide when to use which. The class approach might be better if there's a considerable amount of logic to encapsulate. The function approach might be better for situations where we're dealing with a simple action.
fr: Étant donné que les deux approches semblent similaires, nous devrions suivre le Zen de Python pour décider quand utiliser laquelle. L'approche classe pourrait être mieux s'il y a une quantité considérable de logique à encapsuler. L'approche fonction pourrait être préférable pour des situations où nous avons affaire à une action simple.

source: Dynamic typing
fr: Typage dynamique

source: Python is dynamically typed, which means that variables do not have a fixed type. In fact, in Python, variables are very different from what they are in many other languages, specifically statically-typed languages. Variables are not a segment of the computer's memory where some value is written, they are 'tags' or 'names' pointing to objects. It is therefore possible for the variable 'a' to be set to the value 1, then to the value 'a string', then to a function.
fr: Python est typé dynamiquement, ce qui signifie que les variables n'ont pas un type fixe. En fait, en Python, les variables sont très différentes de ce qu'elles sont dans de nombreux autres langages, en particulier les langages typés statiquement. Les variables ne sont pas un segment de la mémoire de l'ordinateur où une certaine valeur est écrite, elles sont des 'tags' ou des 'noms' pointant vers des objets. Il est donc possible pour la variable 'a' d'être définie à la valeur 1, puis à la valeur 'a string', puis à une fonction.
