Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/writing/style.po
Languages: fr

source: Code Style
fr: Style de code

source: If you ask Python programmers what they like most about Python, they will often cite its high readability. Indeed, a high level of readability is at the heart of the design of the Python language, following the recognized fact that code is read much more often than it is written.
fr: Si vous demandez aux programmeurs Python ce qu'ils aiment le plus à propos de Python, ils citeront souvent sa grande lisibilité. En effet, un haut niveau de lisibilité est au cœur de la conception du langage Python, après le fait reconnu que le code est lu beaucoup plus souvent que ce qui est écrit.

source: One reason for the high readability of Python code is its relatively complete set of Code Style guidelines and "Pythonic" idioms.
fr: Une raison de la haute lisibilité du code Python est son jeu relativement complet d'instructions de style de code et ses idiomes "Pythoniques".

source: When a veteran Python developer (a Pythonista) calls portions of code not "Pythonic", they usually mean that these lines of code do not follow the common guidelines and fail to express its intent in what is considered the best (hear: most readable) way.
fr: Quand un développeur Python vétéran (un Pythoniste) appelle des portions de code non "Pythoniques", il veut dire généralement que ces lignes de code ne suivent pas les instructions communes et ne parviennent pas à exprimer leur intention dans ce qui est considéré comme la meilleure façon (entendez: la manière la plus lisible).

source: On some border cases, no best way has been agreed upon on how to express an intent in Python code, but these cases are rare.
fr: Dans certains cas limites, aucune meilleure pratique n'a été convenue sur la façon d'exprimer une intention en code Python, mais ces cas sont rares.

source: General concepts
fr: Concepts généraux

source: Explicit code
fr: Code explicite

source: While any kind of black magic is possible with Python, the most explicit and straightforward manner is preferred.
fr: Alors que toute sorte de magie noire est possible avec Python, la manière la plus explicite et directe est préférable.

source: **Bad**
fr: **Mauvais**

source: **Good**
fr: **Bon**

source: In the good code above, x and y are explicitly received from the caller, and an explicit dictionary is returned. The developer using this function knows exactly what to do by reading the first and last lines, which is not the case with the bad example.
fr: Dans le bon code ci-dessus, x et y sont explicitement reçus de l'appelant, et un dictionnaire explicite est retourné. Le développeur utilisant cette fonction sait exactement ce qu'il faut faire en lisant la première et la dernière ligne, ce qui n'est pas le cas avec le mauvais exemple.

source: One statement per line
fr: Une déclaration par ligne

source: While some compound statements such as list comprehensions are allowed and appreciated for their brevity and their expressiveness, it is bad practice to have two disjointed statements on the same line of code.
fr: Bien que certaines déclarations composées comme les compréhensions de liste soient autorisées et appréciées pour leur brièveté et leur expressivité, c'est une mauvaise pratique d'avoir deux déclarations disjointes sur la même ligne de code.

source: Function arguments
fr: Arguments de fonction

source: Arguments can be passed to functions in four different ways.
fr: Les arguments peuvent être passés aux fonctions de quatre manières différentes.

source: **Positional arguments** are mandatory and have no default values. They are the simplest form of arguments and they can be used for the few function arguments that are fully part of the function's meaning and their order is natural. For instance, in ``send(message, recipient)`` or ``point(x, y)`` the user of the function has no difficulty remembering that those two functions require two arguments, and in which order.
fr: **Les arguments positionnels** sont obligatoires et n'ont pas de valeurs par défaut. Ils sont la forme la plus simple des arguments et ils peuvent être utilisés pour les quelques arguments de fonction qui sont partie intégrante de la signification de la fonction et leur ordre est naturel. Par exemple, dans ``send(message, recipient)`` ou ``point(x, y)`` l'utilisateur de la fonction n'a pas de difficulté à se souvenir que ces deux fonctions nécessitent deux arguments, et dans quel ordre.

source: In those two cases, it is possible to use argument names when calling the functions and, doing so, it is possible to switch the order of arguments, calling for instance ``send(recipient='World', message='Hello')`` and ``point(y=2, x=1)`` but this reduces readability and is unnecessarily verbose, compared to the more straightforward calls to ``send('Hello', 'World')`` and ``point(1, 2)``.
fr: Dans ces deux cas, il est possible d'utiliser des noms d'argument lors de l'appel des fonctions et, ce faisant, il est possible de changer l'ordre des arguments, appelant par exemple ``send(recipient='World', message='Hello')`` et ``point(y=2, x=1)``, mais cela réduit la lisibilité et est inutilement verbeux, par rapport aux appels plus simples à ``send('Hello', 'World')`` et ``point(1, 2)``.

source: **Keyword arguments** are not mandatory and have default values. They are often used for optional parameters sent to the function. When a function has more than two or three positional parameters, its signature is more difficult to remember and using keyword arguments with default values is helpful. For instance, a more complete ``send`` function could be defined as ``send(message, to, cc=None, bcc=None)``. Here ``cc`` and ``bcc`` are optional, and evaluate to ``None`` when they are not passed another value.
fr: **Les arguments nommés** ne sont pas obligatoires et ont des valeurs par défaut. Ils sont souvent utilisés pour les paramètres facultatifs envoyés à la fonction. Quand une fonction a plus de deux ou trois paramètres positionnels, sa signature est plus difficile à retenir et l'utilisation d'arguments nommés avec des valeurs par défaut est utile. Par exemple, une fonction ``send`` plus complète pourrait être définie comme ``send(message, to, cc=None, bcc=None)``. Ici ``cc`` et ``bcc`` sont facultatifs, et sont évalués à ``None`` quand ils ne reçoivent pas une autre valeur.

source: Calling a function with keyword arguments can be done in multiple ways in Python, for example it is possible to follow the order of arguments in the definition without explicitly naming the arguments, like in ``send('Hello', 'World', 'Cthulhu', 'God')``, sending a blind carbon copy to God. It would also be possible to name arguments in another order, like in ``send('Hello again', 'World', bcc='God', cc='Cthulhu')``. Those two possibilities are better avoided without any strong reason to not follow the syntax that is the closest to the function definition: ``send('Hello', 'World', cc='Cthulhu', bcc='God')``.
fr: L'appel d'une fonction avec des arguments nommés peut être fait de plusieurs façons en Python. Par exemple, il est possible de suivre l'ordre des arguments dans la définition sans nommer explicitement les arguments, comme dans ``send('Hello', 'World', 'Cthulhu', 'God')``, envoyant une copie carbone invisible à God. Il serait également possible de nommer des arguments dans un autre ordre, comme dans ``send('Hello again', 'World', bcc='God', cc='Cthulhu')``. Ces deux possibilités sont mieux évitées sans aucune vraie raison de ne pas suivre la syntaxe qui est le plus proche de la définition de la fonction: ``send('Hello', 'World', cc='Cthulhu', bcc='God')``.

source: As a side note, following `YAGNI <http://en.wikipedia.org/wiki/You_ain't_gonna_need_it>`_ principle, it is often harder to remove an optional argument (and its logic inside the function) that was added "just in case" and is seemingly never used, than to add a new optional argument and its logic when needed.
fr: Comme note à garder de côté, en suivant le principe `YAGNI <http://en.wikipedia.org/wiki/You_ain't_gonna_need_it>`_, il est souvent plus difficile d'enlever un argument optionnel (et sa logique dans la fonction) qui a été ajouté "juste au cas où" et n'est apparemment jamais utilisé, que d'ajouter un nouvel argument optionnel et sa logique en cas de besoin.

source: The **arbitrary argument list** is the third way to pass arguments to a function. If the function intention is better expressed by a signature with an extensible number of positional arguments, it can be defined with the ``*args`` constructs. In the function body, ``args`` will be a tuple of all the remaining positional arguments. For example, ``send(message, *args)`` can be called with each recipient as an argument:``send('Hello', 'God', 'Mom', 'Cthulhu')``, and in the function body ``args`` will be equal to ``('God', 'Mom', 'Cthulhu')``.
fr: La **liste d'arguments arbitraires** est la troisième façon de passer des arguments à une fonction. Si l'intention de la fonction est mieux exprimée par une signature avec un nombre extensible d'arguments positionnels, elle peut être définie avec les constructions ``args``. Dans le corps de la fonction, ``args`` sera un tuple de tous les arguments positionnels restants. Par exemple, ``send(message, *args)`` peut être appelé avec chaque destinataire comme argument: ``send('Hello', 'God', 'Mom', 'Cthulhu')``, et dans le corps de la fonction ``args`` sera égal à ``('God', 'Mom', 'Cthulhu')``.

source: However, this construct has some drawbacks and should be used with caution. If a function receives a list of arguments of the same nature, it is often more clear to define it as a function of one argument, that argument being a list or any sequence. Here, if ``send`` has multiple recipients, it is better to define it explicitly: ``send(message, recipients)`` and call it with ``send('Hello', ['God', 'Mom', 'Cthulhu'])``. This way, the user of the function can manipulate the recipient list as a list beforehand, and it opens the possibility to pass any sequence, including iterators, that cannot be unpacked as other sequences.
fr: Cependant, cette construction présente des inconvénients et doit être utilisée avec prudence. Si une fonction reçoit une liste d'arguments de même nature, il est souvent plus clair de la définir comme une fonction d'un seul argument, cet argument étant une liste ou n'importe quelle séquence. Ici, si ``send`` a plusieurs destinataires, il est préférable de la définir explicitement: ``send(message, recipients)`` et de l'appeler avec ``send('Hello', ['God', 'Mom', 'Cthulhu'])``. De cette façon, l'utilisateur de la fonction peut manipuler la liste des destinataires sous forme de liste à l'avance, et cela ouvre la possibilité de passer un ordre quelconque, y compris les itérateurs, qui ne peuvent être unpacked comme d'autres séquences.

source: The **arbitrary keyword argument dictionary** is the last way to pass arguments to functions. If the function requires an undetermined series of named arguments, it is possible to use the ``**kwargs`` construct. In the function body, ``kwargs`` will be a dictionary of all the passed named arguments that have not been caught by other keyword arguments in the function signature.
fr: Le **dictionnaire d'arguments mot-clé arbitraire** est le dernier moyen de passer des arguments aux fonctions. Si la fonction nécessite une série indéterminée d'arguments nommés, il est possible d'utiliser la construction ``**kwargs``. Dans le corps de la fonction, ``kwargs`` sera un dictionnaire de tous les arguments nommés passés qui n'ont pas été récupérés par d'autres arguments mot-clés dans la signature de la fonction.

source: The same caution as in the case of *arbitrary argument list* is necessary, for similar reasons: these powerful techniques are to be used when there is a proven necessity to use them, and they should not be used if the simpler and clearer construct is sufficient to express the function's intention.
fr: La même prudence que dans le cas de *liste d'arguments arbitraires* est nécessaire, pour des raisons similaires: ces techniques puissantes doivent être utilisés quand il y a une nécessité avérée de les utiliser, et elles ne devraient pas être utilisées si la construction simple et plus claire est suffisante pour exprimer l'intention de la fonction.

source: It is up to the programmer writing the function to determine which arguments are positional arguments and which are optional keyword arguments, and to decide whether to use the advanced techniques of arbitrary argument passing. If the advice above is followed wisely, it is possible and enjoyable to write Python functions that are:
fr: Il appartient au programmeur d'écrire la fonction pour déterminer quels arguments sont des arguments positionnels et qui sont des arguments optionnels mots-clés, et de décider d'utiliser ou non les techniques avancées de passage d'arguments arbitraires. Si le conseil ci-dessus est suivi à bon escient, il est possible et agréable d'écrire des fonctions Python qui sont:

source: easy to read (the name and arguments need no explanations)
fr: faciles à lire (le nom et les arguments n'ont pas besoin d'explications)

source: easy to change (adding a new keyword argument does not break other parts of the code)
fr: faciles à changer (l'ajout d'un nouveau mot-clé en argument ne casse pas les autres parties du code)

source: Avoid the magical wand
fr: Éviter la baguette magique

source: A powerful tool for hackers, Python comes with a very rich set of hooks and tools allowing you to do almost any kind of tricky tricks. For instance, it is possible to do each of the following:
fr: Un outil puissant pour les hackers, Python vient avec un jeu très riche de hooks et d'outils vous permettant de faire presque tout sorte de trucs délicats. Par exemple, il est possible de faire chacun des éléments suivants:

source: change how objects are created and instantiated
fr: changer comment les objets sont créés et instanciés

source: change how the Python interpreter imports modules
fr: changer comment l'interpréteur Python importe les modules

source: it is even possible (and recommended if needed) to embed C routines in Python.
fr: il est même possible (et recommandé si nécessaire) pour intégrer des routines C dans Python.

source: However, all these options have many drawbacks and it is always better to use the most straightforward way to achieve your goal. The main drawback is that readability suffers greatly when using these constructs. Many code analysis tools, such as pylint or pyflakes, will be unable to parse this "magic" code.
fr: Cependant, toutes ces options présentent de nombreux inconvénients et il est toujours préférable d'utiliser le moyen le plus simple pour atteindre votre objectif. Le principal inconvénient est que la lisibilité souffre beaucoup lors de l'utilisation de ces constructions. De nombreux outils d'analyse de code, comme pylint ou pyflakes, ne pourront pas analyser ce code "magique".

source: We consider that a Python developer should know about these nearly infinite possibilities, because it instills confidence that no impassable problem will be on the way. However, knowing how and particularly when **not** to use them is very important.
fr: Nous considérons qu'un développeur Python devrait connaître ces possibilités presque infinies, car cela inspire la confiance qu'aucun problème infranchissable ne sera sur le chemin. Cependant, savoir comment et surtout quand ne **pas** les utiliser est très important.

source: Like a kung fu master, a Pythonista knows how to kill with a single finger, and never to actually do it.
fr: Comme un maître de kung-fu, un Pythoniste sait comment tuer avec un seul doigt, et ne jamais le faire pour de vrai.

source: We are all responsible users
fr: Nous sommes tous des utilisateurs responsables

source: As seen above, Python allows many tricks, and some of them are potentially dangerous. A good example is that any client code can override an object's properties and methods: there is no "private" keyword in Python. This philosophy, very different from highly defensive languages like Java, which give a lot of mechanisms to prevent any misuse, is expressed by the saying: "We are all responsible users".
fr: Comme on le voit ci-dessus, Python permet de nombreuses astuces, et certains d'entre elles sont potentiellement dangereuses. Un bon exemple est que tout code client peut surcharger les propriétés et les méthodes d'un objet: il n'y a pas mot-clé "private" en Python. Cette philosophie, très différente des langages très défensifs comme Java, qui donnent beaucoup de mécanismes pour empêcher toute utilisation abusive, est exprimée par le dicton: "Nous sommes tous les utilisateurs responsables".

source: This doesn't mean that, for example, no properties are considered private, and that no proper encapsulation is possible in Python. Rather, instead of relying on concrete walls erected by the developers between their code and other's, the Python community prefers to rely on a set of conventions indicating that these elements should not be accessed directly.
fr: Cela ne veut pas dire que, par exemple, que des propriétés ne sont pas considérées comme privées, et qu'aucune encapsulation appropriée n'est possible en Python. Au contraire, au lieu de compter sur les murs de béton érigés par les développeurs entre leur code et les autres, la communauté Python préfère compter sur un ensemble de conventions indiquant que ces éléments ne doivent pas être directement accessibles.

source: The main convention for private properties and implementation details is to prefix all "internals" with an underscore. If the client code breaks this rule and accesses these marked elements, any misbehavior or problems encountered if the code is modified is the responsibility of the client code.
fr: La convention principale pour les propriétés privées et les détails d'implémentation est de préfixer toutes les "caractéristiques internes" avec un tiret bas. Si le code client enfreint cette règle et accède à ces éléments marqués, tous les mauvais comportements ou problèmes rencontrés si le code est modifié est de la responsabilité du code client.

source: Using this convention generously is encouraged: any method or property that is not intended to be used by client code should be prefixed with an underscore. This will guarantee a better separation of duties and easier modification of existing code; it will always be possible to publicize a private property, but making a public property private might be a much harder operation.
fr: L'utilisation de cette convention généreusement est encouragée: toute méthode ou une propriété qui ne sont pas destinées à être utilisées par le code client doivent être préfixées avec un tiret bas. Cela permettra de garantir une meilleure séparation des tâches et une modification plus facile du code existant; il sera toujours possible d'exposer une propriété privée, mais rendre une propriété publique privée pourrait être une opération beaucoup plus difficile.

source: Returning values
fr: Valeurs retournées

source: When a function grows in complexity it is not uncommon to use multiple return statements inside the function's body. However, in order to keep a clear intent and a sustainable readability level, it is preferable to avoid returning meaningful values from many output points in the body.
fr: Quand une fonction croît en complexité, il n'est pas rare d'utiliser des instructions de retour multiples à l'intérieur du corps de la fonction. Cependant, afin de maintenir une intention claire et un niveau de lisibilité durable, il est préférable d'éviter de retourner des valeurs significatives à partir de nombreux points de sortie dans le corps.

source: There are two main cases for returning values in a function: the result of the function return when it has been processed normally, and the error cases that indicate a wrong input parameter or any other reason for the function to not be able to complete its computation or task.
fr: Il existe deux principaux cas pour retourner des valeurs dans une fonction: le résultat du retour de la fonction quand il a été traité normalement, et les cas d'erreur indiquant un paramètre d'entrée erroné ou toute autre raison pour la fonction de ne pas être capable de compléter son calcul ou sa tâche.

source: If you do not wish to raise exceptions for the second case, then returning a value, such as None or False, indicating that the function could not perform correctly might be needed. In this case, it is better to return as early as the incorrect context has been detected. It will help to flatten the structure of the function: all the code after the return-because-of-error statement can assume the condition is met to further compute the function's main result. Having multiple such return statements is often necessary.
fr: Si vous ne souhaitez pas de lever des exceptions pour le second cas, puis retourner une valeur, comme None ou False, indiquer que la fonction pourrait ne pas fonctionner correctement pourrait être nécessaire. Dans ce cas, il est préférable de la retourner aussitôt que le contexte incorrect a été détecté. Cela aidera à aplatir la structure de la fonction: tout le code après l'instruction retour-parce-que-erreur peut assumer que la condition est remplie pour continuer à calculer le résultat principal de la fonction. Avoir de telles multiples déclarations de retour est souvent nécessaire.

source: However, when a function has multiple main exit points for its normal course, it becomes difficult to debug the returned result, so it may be preferable to keep a single exit point. This will also help factoring out some code paths, and the multiple exit points are a probable indication that such a refactoring is needed.
fr: Cependant, lorsqu'une fonction a plusieurs principaux points de sortie pour son fonctionnement normal, il devient difficile de débugguer le résultat retourné, donc il peut être préférable de garder un seul point de sortie. Cela permettra également d'aider à refactoriser quelques chemins dans le code, et les points de sortie multiples sont une indication probable qu'un tel refactoring est nécessaire.

source: Idioms
fr: Idiomes

source: A programming idiom, put simply, is a *way* to write code. The notion of programming idioms is discussed amply at `c2 <http://c2.com/cgi/wiki?ProgrammingIdiom>`_ and at `Stack Overflow <http://stackoverflow.com/questions/302459/what-is-a-programming-idiom>`_.
fr: Un idiome de langage, dit simplement, est un *moyen* d'écrire du code. La notion d'idiomes de programmation est discutée amplement sur `c2 <http://c2.com/cgi/wiki?ProgrammingIdiom>`_ et sur `Stack Overflow <http://stackoverflow.com/questions/302459/what-is-a-programming-idiom>`_.

source: Idiomatic Python code is often referred to as being *Pythonic*.
fr: Du code Python idiomatique est souvent désigné comme étant *Pythonique*.

source: Although there usually is one --- and preferably only one --- obvious way to do it; *the* way to write idiomatic Python code can be non-obvious to Python beginners. So, good idioms must be consciously acquired.
fr: Bien qu'il y ait habituellement une --- et de préférence une seule --- manière évidente de le faire; *la* façon d'écrire du code Python idiomatique peut être non évidente pour les débutants Python. Donc, les bons idiomes doivent être consciemment acquis.

source: Some common Python idioms follow:
fr: Certains idiomes Python communs suivent:
