Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/writing/style.po
Languages: fr

source: If you know the length of a list or tuple, you can assign names to its elements with unpacking. For example, since ``enumerate()`` will provide a tuple of two elements for each item in list:
fr: Si vous connaissez la longueur d'une liste ou d'un tuple, vous pouvez attribuer des noms à ses éléments avec l'unpacking. Par exemple, étant donné que ``enumerate()`` fournira un tuple de deux éléments pour chaque élément dans la liste:

source: You can use this to swap variables as well:
fr: Vous pouvez l'utiliser pour intervertir des variables ainsi:

source: Nested unpacking works too:
fr: L'unpacking imbriqué marche aussi:

source: In Python 3, a new method of extended unpacking was introduced by :pep:`3132`:
fr: En Python 3, une nouvelle méthode d'unpacking étendue a été introduite par la :pep:`3132`:

source: Create an ignored variable
fr: Créer une variable ignorée

source: If you need to assign something (for instance, in :ref:`unpacking-ref`) but will not need that variable, use ``__``:
fr: Si vous avez besoin d'assigner quelque chose (par exemple, dans :ref:`unpacking-ref`) mais que vous n'avez pas besoin de cette variable, utilisez ``__``:

source: Many Python style guides recommend the use of a single underscore "``_``" for throwaway variables rather than the double underscore "``__``" recommended here. The issue is that "``_``" is commonly used as an alias for the :func:`~gettext.gettext` function, and is also used at the interactive prompt to hold the value of the last operation. Using a double underscore instead is just as clear and almost as convenient, and eliminates the risk of accidentally interfering with either of these other use cases.
fr: Beaucoup de guides de style Python recommandent l'utilisation d'un seul tiret bas "``_``" pour les variables jetables plutôt que les tirets bas doubles "``__``" recommandés ici. Le problème est que "``_``" est couramment utilisé comme un alias pour la fonction :func:`~gettext.gettext`, et est également utilisé dans l'invite interactive pour garder la valeur de la dernière opération. L'utilisation d'un tiret bas double est à la place est tout aussi clair et presque aussi pratique, et élimine le risque d'interférer accidentellement avec l'un de ces autres cas d'utilisation.

source: Create a length-N list of the same thing
fr: Créer un liste de longueur N de la même chose

source: Use the Python list ``*`` operator:
fr: Utilisez l'opérateur de liste ``*`` de Python:

source: Create a length-N list of lists
fr: Créez un liste de longueur N de listes

source: Because lists are mutable, the ``*`` operator (as above) will create a list of N references to the `same` list, which is not likely what you want. Instead, use a list comprehension:
fr: parce que les listes sont mutables, l'opérateur ``*`` (comme ci-dessus) créera une liste de N références vers la `même` liste, ce qui est probablement pas ce que vous voulez. A la place, utilisez une compréhension de liste:

source: Note: Use range() instead of xrange() in Python 3
fr: Note: utilisez range() à la place de xrange() en Python 3

source: Create a string from a list
fr: Créer une chaîne depuis une liste

source: A common idiom for creating strings is to use :py:meth:`str.join` on an empty string.
fr: Un idiome commun pour la création de chaînes est d'utiliser :py:meth:`str.join` sur une chaîne vide.

source: This will set the value of the variable *word* to 'spam'. This idiom can be applied to lists and tuples.
fr: Cela va définir la valeur de la variable *word* à 'spam'. Cet idiome peut être appliqué à des listes et des tuples.

source: Searching for an item in a collection
fr: Rechercher un élément dans une collection

source: Sometimes we need to search through a collection of things. Let's look at two options: lists and sets.
fr: Parfois, nous devons chercher à travers une collection de choses. Regardons deux options: lists et sets.

source: Take the following code for example:
fr: Prenez le code suivant pour exemple:

source: Even though both functions look identical, because *lookup_set* is utilizing the fact that sets in Python are hashtables, the lookup performance between the two is very different. To determine whether an item is in a list, Python will have to go through each item until it finds a matching item. This is time consuming, especially for long lists. In a set, on the other hand, the hash of the item will tell Python where in the set to look for a matching item. As a result, the search can be done quickly, even if the set is large. Searching in dictionaries works the same way. For more information see this `StackOverflow <http://stackoverflow.com/questions/513882/python-list-vs-dict-for-look-up-table>`_ page. For detailed information on the amount of time various common operations take on each of these data structures, see `this page <https://wiki.python.org/moin/TimeComplexity?>`_.
fr: Même si les deux fonctions semblent identiques, parce que *lookup_set* utilise le fait que les sets en Python sont des tables de hashage, les performances de recherche entre les deux sont très différentes. Pour déterminer si un élément se trouve dans une liste, Python devra parcourir chaque élément jusqu'à ce qu'il trouve un élément correspondant. Cela prend du temps, surtout pour de longues listes. Dans un set, d'autre part, le hachage de l'élément dira à Python où dans le set chercher un élément correspondant. En conséquence, la recherche peut être faite rapidement, même si le set est grand. La recherche dans les dictionnaires fonctionne de la même façon. Pour plus d'informations, voir cette page `StackOverflow <http://stackoverflow.com/questions/513882/python-list-vs-dict-for-look-up-table>`_. Pour plus d'informations sur la quantité de temps nécessaire pour les différentes opérations courantes pour chacune de ces structures de données, voir `cette page <https://wiki.python.org/moin/TimeComplexity?>`_.

source: Because of these differences in performance, it is often a good idea to use sets or dictionaries instead of lists in cases where:
fr: En raison de ces différences de performance, c'est souvent une bonne idée d'utiliser des sets ou des dictionnaires au lieu de listes dans les cas où:

source: The collection will contain a large number of items
fr: La collection contiendra un grand nombre d'éléments

source: You will be repeatedly searching for items in the collection
fr: Vous rechercherez de manière répétitive les éléments dans la collection

source: You do not have duplicate items.
fr: Vous n'avez pas pas d'éléments dupliqués.

source: For small collections, or collections which you will not frequently be searching through, the additional time and memory required to set up the hashtable will often be greater than the time saved by the improved search speed.
fr: Pour les petites collections, ou les collections que vous n'avez pas fréquemment à rechercher, le temps additionnel et la mémoire requise pour configurer la table de hashage seront souvent plus longs que le temps gagné grâce à l'amélioration de la vitesse de recherche.

source: Zen of Python
fr: Le Zen de Python

source: Also known as :pep:`20`, the guiding principles for Python's design.
fr: Aussi connu comme :pep:`20`, les principes directeurs pour la conception de Python.

source: For some examples of good Python style, see `these slides from a Python user group <http://artifex.org/~hblanks/talks/2011/pep20_by_example.pdf>`_.
fr: Pour quelques exemples de bons styles Python, voir `ces diapositives d'un groupe d'utilisateurs Python <http://artifex.org/~hblanks/talks/2011/pep20_by_example.pdf>`_.

source: :pep:`8` is the de-facto code style guide for Python. A high quality, easy-to-read version of PEP 8 is also available at `pep8.org <http://pep8.org/>`_.
fr: :pep:`8` est le guide de fait du style de code pour Python. Une version de haute qualité, facile à lire de la PEP 8 est également disponible sur `pep8.org <http://pep8.org/>`_.

source: This is highly recommended reading. The entire Python community does their best to adhere to the guidelines laid out within this document. Some project may sway from it from time to time, while others may `amend its recommendations <http://docs.python-requests.org/en/master/dev/contributing/#kenneth-reitz-s-code-style>`_.
fr: C'est une lecture fortement recommandée. La communauté Python entière fait de son mieux pour adhérer aux instructions énoncées dans le présent document. Certains projets peuvent osciller autour d'elles de temps à autre, tandis que d'autres peuvent `modifier ses recommandations <http://docs.python-requests.org/en/master/dev/contributing/#kenneth-reitz-s-code-style>`_.

source: That being said, conforming your Python code to PEP 8 is generally a good idea and helps make code more consistent when working on projects with other developers. There is a command-line program, `pep8 <https://github.com/jcrocholl/pep8>`_, that can check your code for conformance. Install it by running the following command in your terminal:
fr: Cela étant dit, conformer votre code Python à PEP 8 est généralement une bonne idée et contribue à rendre le code plus consistant lorsque vous travaillez sur des projets avec d'autres développeurs. Il existe un programme en ligne de commande, `pep8 <https://github.com/jcrocholl/pep8>`_, qui peut vérifier la conformité de votre code. Installez-le en exécutant la commande suivante dans votre terminal:

source: Then run it on a file or series of files to get a report of any violations.
fr: Ensuite, exécutez-le sur un fichier ou une série de fichiers pour avoir un rapport de toutes violations.

source: The program `autopep8 <https://pypi.python.org/pypi/autopep8/>`_ can be used to automatically reformat code in the PEP 8 style. Install the program with:
fr: Le programme `autopep8 <https://pypi.python.org/pypi/autopep8/>`_ peut être utilisé pour reformater automatiquement le code dans le style PEP 8. Installez le programme avec:

source: Use it to format a file in-place with:
fr: Utilisez-le pour formater un fichier sur place avec:

source: Excluding the ``--in-place`` flag will cause the program to output the modified code directly to the console for review. The ``--aggressive`` flag will perform more substantial changes and can be applied multiple times for greater effect.
fr: Exclure l'option ``--in-place`` va mener le programme à renvoyer en sortie le code modifié directement dans la console pour examen. L'option ``--aggressive`` effectuera des changements plus importants et peut être appliquée à plusieurs reprises pour plus d'effet.

source: Here are some conventions you should follow to make your code easier to read.
fr: Voici quelques conventions que vous devriez suivre pour rendre votre code plus facile à lire.

source: Check if variable equals a constant
fr: Vérifier sir la variable est égale à une constante

source: You don't need to explicitly compare a value to True, or None, or 0 - you can just add it to the if statement. See `Truth Value Testing <http://docs.python.org/library/stdtypes.html#truth-value-testing>`_ for a list of what is considered false.
fr: Vous n'avez pas besoin de comparer explicitement une valeur à True ou None, ou 0 - vous pouvez simplement l'ajouter à l'instruction if. Voir le `Test des valeurs à True <http://docs.python.org/library/stdtypes.html#truth-value-testing>`_ pour une liste de ce qui est considéré comme False.

source: **Bad**:
fr: **Mauvais**:

source: **Good**:
fr: **Bon**:

source: Access a Dictionary Element
fr: Accéder à un élément de dictionnaire

source: Don't use the :py:meth:`dict.has_key` method. Instead, use ``x in d`` syntax, or pass a default argument to :py:meth:`dict.get`.
fr: N'utilisez pas la méthode :py:meth:`dict.has_key`. A la place,utilisez la syntaxe ``x in d``, ou passez un argument par défaut à :py:meth:`dict.get`.

source: Short Ways to Manipulate Lists
fr: Façons courtes de manipuler des listes

source: `List comprehensions <http://docs.python.org/tutorial/datastructures.html#list-comprehensions>`_ provide a powerful, concise way to work with lists. Also, the :py:func:`map` and :py:func:`filter` functions can perform operations on lists using a different, more concise syntax.
fr: `Les listes en compréhensions <http://docs.python.org/tutorial/datastructures.html#list-comprehensions>`_ fournissent un manière puissante et concise de travailler avec les listes. En outre, les fonctions :py:func:`map` et :py:func:`filter` peuvent effectuer des opérations sur des listes en utilisant une syntaxe différente et plus concise.

source: Use :py:func:`enumerate` keep a count of your place in the list.
fr: Utilisez :py:func:`enumerate` tient un compte de votre position dans la liste.

source: The :py:func:`enumerate` function has better readability than handling a counter manually. Moreover, it is better optimized for iterators.
fr: La fonction :py:func:`enumerate` a une meilleure lisibilité que la gestion d'un compteur manuellement. De plus, elle est plus optimisés pour les itérateurs.

source: Read From a File
fr: Lire depuis un fichier

source: Use the ``with open`` syntax to read from files. This will automatically close files for you.
fr: Utilisez la syntaxe ``with open`` pour lire depuis des fichiers. Cela fermera automatiquement les fichiers pour vous.

source: The ``with`` statement is better because it will ensure you always close the file, even if an exception is raised inside the ``with`` block.
fr: La déclaration ``with`` est meilleure parce qu'elle assure que vous fermez toujours le fichier, même si une exception est levée à l'intérieur du block ``with``.

source: Line Continuations
fr: Continuations de ligne

source: When a logical line of code is longer than the accepted limit, you need to split it over multiple physical lines. The Python interpreter will join consecutive lines if the last character of the line is a backslash. This is helpful in some cases, but should usually be avoided because of its fragility: a white space added to the end of the line, after the backslash, will break the code and may have unexpected results.
fr: Quand une ligne logique de code est plus longue que la limite acceptée, vous devez la diviser sur plusieurs lignes physiques. L'interpréteur Python rejoindra lignes consécutives si le dernier caractère de la ligne est une barre oblique inverse. Ceci est utile dans certains cas, mais doit généralement être évitée en raison de sa fragilité: un espace blanc ajouté à la fin de la ligne, après la barre oblique inverse, va casser le code et peut avoir des résultats inattendus.

source: A better solution is to use parentheses around your elements. Left with an unclosed parenthesis on an end-of-line the Python interpreter will join the next line until the parentheses are closed. The same behavior holds for curly and square braces.
fr: Une meilleure solution est d'utiliser des parenthèses autour de vos éléments. Avec une parenthèse non fermée laissée à la fin d'une ligne, l'interpréteur Python joindra la ligne suivante jusqu'à ce que les parenthèses soient fermées. Le même comportement est valable pour des accolades et des crochets.

source: However, more often than not, having to split a long logical line is a sign that you are trying to do too many things at the same time, which may hinder readability.
fr: Cependant, le plus souvent, avoir à couper une longue ligne logique est un signe que vous essayez de faire trop de choses en même temps, ce qui peut gêner la lisibilité.
