Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: fr

source: The Hitchhiker's Guide to Python!
fr: Le guide de l'auto-stoppeur pour Python!

source: Greetings, Earthling! Welcome to The Hitchhiker's Guide to Python.
fr: Salutations, Terriens! Bienvenue dans le Guide de l'auto-stoppeur Python.

source: **This is a living, breathing guide.** If you'd like to contribute, `fork us on GitHub <https://github.com/kennethreitz/python-guide>`_!
fr: **C'est un document vivant, qui respire.** Si vous voulez contribuer, `forkez-le sur GitHub <https://github.com/kennethreitz/python-guide>`_!

source: This handcrafted guide exists to provide both novice and expert Python developers a best practice handbook to the installation, configuration, and usage of Python on a daily basis.
fr: Ce guide artisanal existe pour fournir aux développeurs novices comme experts un manuel des meilleurs pratiques pour l'installation, la configuration et l'usage de Python au quotidien.

source: This guide is **opinionated** in a way that is almost, but not quite, entirely *unlike* Python's official documentation. You won't find a list of every Python web framework available here. Rather, you'll find a nice concise list of highly recommended options.
fr: Ce guide est **arrêté dans ses opinions** d'une manière qui est presque mais pas toute fait complètement *différente* de la documentation officielle de Python. Vous ne trouverez une liste de tous les frameworks web Python disponibles ici. Plutôt, vous trouverez une liste concise et agréable d'options fortement recommandées.

source: Let's get started! But first, let's make sure you know where your towel is.
fr: Commençons! Mais en premier, assurons-nous que vous savez où est votre serviette (NDT: cette citation est liée au livre `"le guide de l'auto-stoppeur intergalactique" <http://www.goodreads.com/quotes/24779-a-towel-the-hitchhiker-s-guide-to-the-galaxy-says-is>`_)

source: Getting Started with Python
fr: Bien démarrer avec Python

source: New to Python? Let's properly setup up your Python environment.
fr: Nouveau sur Python? Commençons par configurer correctement votre environnement Python.

source: Properly Install Python
fr: Installer Python correctement

source: Writing Great Python Code
fr: Ecrire du "bon" code Python

source: This part of the guide focuses on the best-practices for writing Python code.
fr: Cette partie du guide se concentre sur les meilleures pratiques pour écrire du code Python.

source: Scenario Guide for Python Applications
fr: Guide de scénario pour des applications Python

source: This part of the guide focuses on tool and module advice based on different scenarios.
fr: Cette partie du guide se concentre sur les conseils pour les outils et modules basés sur les différents scénarios.

source: Shipping Great Python Code
fr: Délivrer du "bon" code Python

source: This part of the guide focuses on deploying your Python code.
fr: Cette partie du guide se concentre sur le déploiement de votre code Python.

source: Python Development Environments
fr: Environnements de développement Python

source: This part of the guide focus on the Python development environment, and the best-practice tools that are available for writing Python code.
fr: Cette partie du guide se concentre sur l'environnement de développement Python et les outils pour les meilleures pratiques qui sont disponibles pour écrire du code Python.

source: Additional Notes
fr: Notes supplémentaires

source: This part of the guide, which is mostly prose, begins with some background information about Python, then focuses on next steps.
fr: Cette partie du guide, qui est principalement de la prose, commence avec quelques informations de contexte à propos de Python, puis met l'accent sur sur les prochaines étapes.

source: Notes defined within all diatonic and chromatic musical scales have been intentionally excluded from this list of additional notes. Additionally, this note.
fr: Les notes définies dans les échelles musicales diatoniques et chromatiques ont été intentionnellement exclues de la liste des notes additionnelles. D'où la présence de cette note.

source: Contribution notes and legal information (for those interested).
fr: Notes de contributions et informations légales (pour ceux intéressés)
