Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/shipping/freezing.po
Languages: fr

source: Freezing Your Code
fr: Geler votre code

source: "Freezing" your code is creating a single-file executable file to distribute to end-users, that contains all of your application code as well as the Python interpreter.
fr: "Geler" ("Freezing") votre code c'est créer un exécutable avec un seul fichier à distribuer aux utilisateurs finaux, qui contient tout le code de l'application ainsi que l'interpréteur Python.

source: Applications such as 'Dropbox', 'Eve Online', 'Civilisation IV', and BitTorrent clients do this.
fr: Les appplications comme 'Dropbox', 'Eve Online', 'Civilisation IV', et des clients BitTorrent font cela.

source: The advantage of distributing this way is that your application will "just work", even if the user doesn't already have the required version of Python (or any) installed. On Windows, and even on many Linux distributions and OS X, the right version of Python will not already be installed.
fr: L'avantage de la distribution de cette façon est que votre application va "juste marcher", même si l'utilisateur n'a pas déjà la version requise de Python (ou aucune) installée. Sous Windows, et même sur de nombreuses distributions Linux et OS X, la bonne version de Python ne sera pas déjà installé.

source: Besides, end-user software should always be in an executable format. Files ending in ``.py`` are for software engineers and system administrators.
fr: En outre, le logiciel utilisateur final doit toujours être dans un format exécutable. Les fichiers se terminant par ``.py`` sont pour les ingénieurs logiciels et les administrateurs système.

source: One disadvantage of freezing is that it will increase the size of your distribution by about 2–12MB. Also, you will be responsible for shipping updated versions of your application when security vulnerabilities to Python are patched.
fr: Un inconvénient du freezing est qu'il augmentera la taille de votre distribution d'environ 2 à 12MB. En outre, vous serez responsable de délivrer des versions mises à jour de votre application lorsque des failles de sécurité Python sont patchées.

source: Alternatives to Freezing
fr: Alternatives au Freezing

source: :ref:`Packaging your code <packaging-your-code-ref>` is for distributing libraries or tools to other developers.
fr: :ref:`Packager votre code <packaging-your-code-ref>` est pour la distribution des bibliothèques ou d'outils pour d'autres développeurs.

source: On Linux, an alternative to freezing is to :ref:`create a Linux distro package <packaging-for-linux-distributions-ref>` (e.g. .deb files for Debian or Ubuntu, or .rpm files for Red Hat and SuSE.)
fr: Sous Linux, une alternative au freezing est de :ref:`créer un paquet de distribution Linux <packaging-for-linux-distributions-ref>` (c'est à dire des fichiers .deb pour Debian ou Ubuntu, ou des fichiers .rpm pour Red Hat et SuSE.)

source: Fill in "Freezing Your Code" stub
fr: Compléter le stub "Geler votre code"

source: Comparison of Freezing Tools
fr: Comparaison des outils de Freezing

source: Solutions and platforms/features supported:
fr: Solutions et plateformes/fonctionnalités supportées:

source: License
fr: Licence

source: One-file mode
fr: Mode fichier unique

source: Zipfile import
fr: Import de fichier Zip

source: pkg_resources support
fr: support pkg_resources

source: yes
fr: oui

source: no
fr: non

source: Freezing Python code on Linux into a Windows executable was only once supported in PyInstaller `and later dropped. <http://stackoverflow.com/questions/2950971/cross-compiling-a-python-script-on-linux-into-a-windows-executable#comment11890276_2951046>`_.
fr: Geler du code Python sous Linux dans un exécutable Windows a un jour été supporté dans PyInstaller `et ensuite été supprimé. <http://stackoverflow.com/questions/2950971/cross-compiling-a-python-script-on-linux-into-a-windows-executable#comment11890276_2951046>`_.

source: All solutions need MS Visual C++ dll to be installed on target machine, except py2app. Only Pyinstaller makes self-executable exe that bundles the dll when passing :option:`--onefile` to :file:`Configure.py`.
fr: Toutes les solutions nécessitent que les dll MS Visual C++ soient installées sur la machine cible, excepté py2app. Seul Pyinstaller fait des .exe auto-exécutable qui embarque les dll quand on passe :option:`--onefile` à :file:`Configure.py`.

source: Prerequisite is to install :ref:`Python, Setuptools and pywin32 dependency on Windows <install-windows>`.
fr: Le prérequis est d'installer :ref:`Python, Setuptools et la dépendance pywin32 sous Windows <install-windows>`.

source: Write steps for most basic .exe
fr: Écrire les étapes pour les exécutables les basiques

source: Prerequisite is to install :ref:`Python on Windows <install-windows>`.
fr: Le prérequis est d'installer :ref:`Python sous Windows <install-windows>`.

source: Download and install http://sourceforge.net/projects/py2exe/files/py2exe/
fr: Télécharger et installer http://sourceforge.net/projects/py2exe/files/py2exe/

source: Write :file:`setup.py` (`List of configuration options <http://www.py2exe.org/index.cgi/ListOfOptions>`_):
fr: Écrit :file:`setup.py` (`Liste des options de configuration <http://www.py2exe.org/index.cgi/ListOfOptions>`_):

source: (Optionally) `include icon <http://www.py2exe.org/index.cgi/CustomIcons>`_
fr: (Optionnellement) `inclure l'icône <http://www.py2exe.org/index.cgi/CustomIcons>`_

source: (Optionally) `one-file mode <http://stackoverflow.com/questions/112698/py2exe-generate-single-executable-file#113014>`_
fr: (Optionnellement) `Mode fichier unique <http://stackoverflow.com/questions/112698/py2exe-generate-single-executable-file#113014>`_

source: Generate :file:`.exe` into :file:`dist` directory:
fr: Générez un :file:`.exe` dans le répertoire :file:`dist`:

source: Provide the Microsoft Visual C runtime DLL. Two options: `globally install dll on target machine <https://www.microsoft.com/en-us/download/details.aspx?id=29>`_ or `distribute dll alongside with .exe <http://www.py2exe.org/index.cgi/Tutorial#Step52>`_.
fr: Fournissez les DLL du runtime Microsoft Visual C++. Deux options: `installer globalement les dll sur ma machine cible <https://www.microsoft.com/en-us/download/details.aspx?id=29>`_ ou `distribuer les dll à côté du .exe <http://www.py2exe.org/index.cgi/Tutorial#Step52>`_.

source: Prerequisite is to have installed :ref:`Python, Setuptools and pywin32 dependency on Windows <install-windows>`.
fr: Le prérequis est d'avoir installé :ref:`Python, Setuptools et la dépendance pywin32 sous Windows <install-windows>`.

source: `Most basic tutorial <http://bojan-komazec.blogspot.com/2011/08/how-to-create-windows-executable-from.html>`_
fr: `Tutoriel le plus basique <http://bojan-komazec.blogspot.com/2011/08/how-to-create-windows-executable-from.html>`_

source: `Manual <http://www.pyinstaller.org/export/d3398dd79b68901ae1edd761f3fe0f4ff19cfb1a/project/doc/Manual.html?format=raw>`_
fr: `Manuel <http://www.pyinstaller.org/export/d3398dd79b68901ae1edd761f3fe0f4ff19cfb1a/project/doc/Manual.html?format=raw>`_

source: PyInstaller can be used to build Unix executables and windowed apps on Mac OS X 10.6 (Snow Leopard) or newer.
fr: PyInstaller peut être utilisé pour construire des exécutables Unix et applications fenêtrées sur Mac OS X 10.6 (Snow Leopard) ou plus récent.

source: To install PyInstaller, use pip:
fr: Pour installer PyInstaller, utilisez pip:

source: To create a standard Unix executable, from say :code:`script.py`, use:
fr: Pour créer un exécutable Unix standard, depuis disons :code:`script.py`, utilisez:

source: This creates,
fr: cela créé,

source: a :code:`script.spec` file, analogous to a :code:`make` file
fr: un fichier :code:`script.spec`, analogue à un fichier :code:`make`

source: a :code:`build` folder, that holds some log files
fr: un dossier :code:`build`, qui contient quelques fichiers de log

source: a :code:`dist` folder, that holds the main executable :code:`script`, and some dependent Python libraries,
fr: un dossier :code:`dist`, qui contient l'exécutable principal :code:`script`, et quelques bibliothèques Python dépendantes,

source: all in the same folder as :code:`script.py`. PyInstaller puts all the Python libraries used in :code:`script.py` into the :code:`dist` folder, so when distributing the executable, distribute the whole :code:`dist` folder.
fr: toutes dans le même dossier que :code:`script.py`. PyInstaller met toutes les bibliothèques Python utilisées dans :code:`script.py` dans le dossier :code:`dist`. Donc lors de la distribution de l'exécutable, distribuez l'ensemble du dossier :code:`dist`.

source: The :code:`script.spec` file can be edited to `customise the build <http://pythonhosted.org/PyInstaller/#spec-file-operation>`_, with options such as
fr: Le fichier :code:`script.spec` peut être édité pour `customiser le build <http://pythonhosted.org/PyInstaller/#spec-file-operation>`_, avec des options comme

source: bundling data files with the executable
fr: Embarquer les fichiers de données avec l'exécutable

source: including run-time libraries (:code:`.dll` or :code:`.so` files) that PyInstaller can't infer automatically
fr: y compris les bibliothèques de run-time (fichiers :code:`.dll` ou :code:`.so`) que PyInstaller ne peut pas déduire automatiquement

source: adding Python run-time options to the executable,
fr: ajout des options du run-time Python à l'exécutable,

source: Now :code:`script.spec` can be run with :code:`pyinstaller` (instead of using :code:`script.py` again):
fr: Maintenant :code:`script.spec` peut être exécuter avec :code:`pyinstaller` (plutôt que d'utiliser encore :code:`script.py`):

source: To create a standalone windowed OS X application, use the :code:`--windowed` option
fr: Pour créer une application OS X autonome fenêtrée, utilisez l'option :code:`--windowed`

source: This creates a :code:`script.app` in the :code:`dist` folder. Make sure to use GUI packages in your Python code, like `PyQt <https://riverbankcomputing.com/software/pyqt/intro>`_ or `PySide <http://wiki.qt.io/About-PySide>`_, to control the graphical parts of the app.
fr: Cela créé :code:`script.app` dans le dossier :code:`dist`. Assurez-vous d'utiliser des paquets graphiques dans votre code Python, comme `PyQt <https://riverbankcomputing.com/software/pyqt/intro>`_ ou `PySide <http://wiki.qt.io/About-PySide>`_, pour contrôler les parties graphiques de votre application.

source: There are several options in :code:`script.spec` related to Mac OS X app bundles `here <http://pythonhosted.org/PyInstaller/#spec-file-options-for-a-mac-os-x-bundle>`_. For example, to specify an icon for the app, use the :code:`icon=\path\to\icon.icns` option.
fr: Il y a plusieurs option :code:`script.spec` liées à l'encapsulation d'applications Mac OS X `ici <http://pythonhosted.org/PyInstaller/#spec-file-options-for-a-mac-os-x-bundle>`_. Par exemple, pour spécifier une icône pour l'application, utilisez l'option :code:`icon=\path\to\icon.icns`.
