Repository: ccopol/python-guide
Catalog: docs/locale/*/LC_MESSAGES/shipping/packaging.po
Languages: fr

source: Packaging Your Code
fr: Packager votre code

source: Package your code to share it with other developers. For example to share a library for other developers to use in their application, or for development tools like 'py.test'.
fr: Packagez votre code pour le partager avec d'autres développeurs. Par exemple, pour partager une bibliothèque pour que d'autres développeurs l'utilise dans leur application, ou pour les outils de développement comme 'py.test'.

source: An advantage of this method of distribution is its well established ecosystem of tools such as PyPI and pip, which make it easy for other developers to download and install your package either for casual experiments, or as part of large, professional systems.
fr: Un avantage de cette méthode de distribution est son écosystème bien établi d'outils tels que PyPI et pip, qui rendent facile pour d'autres développeurs de télécharger et d'installer votre paquet soit pour des expérimentations occasionnelles, ou comme un morceau de grands systèmes professionnels.

source: It is a well-established convention for Python code to be shared this way. If your code isn't packaged on PyPI, then it will be harder for other developers to find it, and to use it as part of their existing process. They will regard such projects with substantial suspicion of being either badly managed or abandoned.
fr: C'est une convention bien établie pour le code Python d'être partagé de cette façon. Si votre code n'est pas packagé sur PyPI, alors il sera plus difficile pour les autres développeurs de le trouver, et de l'utiliser dans le cadre de leur processus existant. Ils vont considérer de tels projets avec la suspicion importante qu'il soit mal géré ou abandonné.

source: The downside of distributing code like this is that it relies on the recipient understanding how to install the required version of Python, and being able and willing to use tools such as pip to install your code's other dependencies. This is fine when distributing to other developers, but makes this method unsuitable for distributing applications to end-users.
fr: L'inconvénient de la distribution de code comme ceci est qu'il repose sur le fait que le destinataire comprenne comment installer la version requise de Python, et soit en mesure et désireux d'utiliser des outils tels que pip pour installer les autres dépendances de votre code. C'est bien quand la distribution est pour les autres développeurs, mais rend cette méthode inadaptée pour la distribution d'applications à des utilisateurs finaux.

source: The `Python Packaging Guide <https://python-packaging-user-guide.readthedocs.org/en/latest/>`_ provides an extensive guide on creating and maintaining Python packages.
fr: Le `Python Packaging Guide <https://python-packaging-user-guide.readthedocs.org/en/latest/>`_ fournit un guide complet sur la création et la maintenance des paquets Python.

source: Alternatives to Packaging
fr: Alternatives au packaging

source: To distribute applications to end-users, you should :ref:`freeze your application <freezing-your-code-ref>`.
fr: Pour distribuer des applications à des utilisateurs finaux, vous devriez :ref:`geler votre application <freezing-your-code-ref>`.

source: On Linux, you may also want to consider :ref:`creating a Linux distro package <packaging-for-linux-distributions-ref>` (e.g. a .deb file for Debian or Ubuntu.)
fr: Sous Linux, vous pouvez également envisager de :ref:`créer un paquet de distribution Linux <packaging-for-linux-distributions-ref>` (c'est à dire des fichiers .deb pour Debian ou Ubuntu.)

source: For Python Developers
fr: Pour les développeurs Python

source: If you're writing an open source Python module, `PyPI <http://pypi.python.org>`_ , more properly known as *The Cheeseshop*, is the place to host it.
fr: Si vous écrivez un module Python open source, `PyPI <http://pypi.python.org>`_ , plus connu comme le *Cheeseshop* (magasin de fromages), est l'emplacement où l'héberger.

source: Use `pip <http://pypi.python.org/pypi/pip>`_. More details `here <http://stackoverflow.com/questions/3220404/why-use-pip-over-easy-install>`_
fr: Utilisez `pip <http://pypi.python.org/pypi/pip>`_. Plus de détails `ici <http://stackoverflow.com/questions/3220404/why-use-pip-over-easy-install>`_

source: Personal PyPI
fr: PyPi personnel

source: If you want to install packages from a source other than PyPI, (say, if your packages are *proprietary*), you can do it by hosting a simple http server, running from the directory which holds those packages which need to be installed.
fr: Si vous voulez installer des paquets à partir d'une autre source que PyPI, (par exemple, si vos paquets sont *propriétaires*), vous pouvez le faire hébergeant un simple serveur http, s'exécutant à partir du répertoire qui contient les paquets qui doivent être installés.

source: **Showing an example is always beneficial**
fr: **Montrer un exemple est toujours bénéfique**

source: For example, if you want to install a package called :file:`MyPackage.tar.gz`, and assuming this is your directory structure:
fr: Par exemple, si vous souhaitez installer un paquet appelé :file:`MyPackage.tar.gz`, et en supposant que c'est votre structure de répertoire:

source: Go to your command prompt and type:
fr: Allez à votre invite de commande et tapez:

source: This runs a simple http server running on port 9000 and will list all packages (like **MyPackage**). Now you can install **MyPackage** using any Python package installer. Using Pip, you would do it like:
fr: Cela exécute un simple serveur http, fonctionnant sur le port 9000 et listera tous les paquets (comme **MyPackage**). Maintenant, vous pouvez installer **MyPackage** en utilisant n'importe quel installateur de paquets Python. En utilisant Pip, vous devriez le faire avec:

source: Having a folder with the same name as the package name is **crucial** here. I got fooled by that, one time. But if you feel that creating a folder called :file:`MyPackage` and keeping :file:`MyPackage.tar.gz` inside that, is *redundant*, you can still install MyPackage using:
fr: Avoir un dossier avec le même nom que le nom du package est **cruciale** ici. J'ai été trompé par cela, une seule fois. Mais si vous avez l'impression que créer un dossier appelé :file:`MyPackage` et garder un fichier :file:`MyPackage.tar.gz` dedans est *redondant*, vous pouvez toujours installer MyPackage en utilisant:

source: `Pypiserver <https://pypi.python.org/pypi/pypiserver>`_ is a minimal PyPI compatible server. It can be used to serve a set of packages to easy_install or pip. It includes helpful features like an administrative command (:option:`-U`) which will update all its packages to their latest versions found on PyPI.
fr: `Pypiserver <https://pypi.python.org/pypi/pypiserver>`_ est un serveur minimal compatible avec PyPi. Il peut être utilisé pour servir un jeu de paquets pour easy_install ou pip. Il inclue des fonctionnalités utiles comme une commande administrative (:option:`-U`) qui mettra à jour tous ses paquets à leurs dernières versions trouvées sur PyPI.

source: S3-Hosted PyPi
fr: PyPi hébergé sur S3

source: One simple option for a personal PyPi server is to use Amazon S3. A prerequisite for this is that you have an Amazon AWS account with an S3 bucket.
fr: Une option simple pour un serveur PyPI personnel est d'utiliser Amazon S3. Un prérequis pour cela est que vous ayez un compte Amazon AWS avec un bucket S3.

source: **Install all your requirements from PyPi or another source**
fr: **Installer tous vos requirements depuis PyPi ou une autre source**

source: **Install pip2pi**
fr: **Installer pip2pi**

source: **Follow pip2pi README for pip2tgz and dir2pi commands**
fr: **Suivre le README pip2pi pour les commandes de pip2tgz et dir2pi**

source: :code:`pip2tgz packages/ YourPackage` (or :code:`pip2tgz packages/ -r requirements.txt`)
fr: :code:`pip2tgz packages/ MyPackage` (ou :code:`pip2tgz packages/ -r requirements.txt`)

source: **Upload the new files**
fr: **Uploader les nouveaux fichiers**

source: Use a client like Cyberduck to sync the entire :file:`packages` folder to your s3 bucket
fr: Utilisez un client comme Cyberduck pour synchroniser l'ensemble du dossier :file:`packages` avec votre bucket s3

source: Make sure you upload :code:`packages/simple/index.html` as well as all new files and directories
fr: Assurez-vous que vous uploadez :code:`packages/simple/index.html` ainsi que tous les nouveaux fichiers et répertoires.

source: **Fix new file permissions**
fr: **Corriger les nouvelles permissions du fichier**

source: By default, when you upload new files to the S3 bucket, they will have the wrong permissions set.
fr: Par défaut, lorsque vous uploadez de nouveaux fichiers dans le bucket S3, ils auront les mauvaises permissions définies.

source: Use the Amazon web console to set the READ permission of the files to EVERYONE.
fr: Utilisez la console web Amazon pour définir l'autorisation READ des fichiers à EVERYONE.

source: If you get HTTP 403 when trying to install a package, make sure you've set the permissions correctly.
fr: Si vous avez un code HTTP 403 lorsque vous essayez d'installer un paquet, assurez-vous que vous avez configuré correctement les permissions.

source: **All done**
fr: **Terminé**

source: You can now install your package with :code:`pip install --index-url=http://your-s3-bucket/packages/simple/ YourPackage`
fr: Vous pouvez maintenant installer votre paquet avec :code:`pip install --index-url=http://your-s3-bucket/packages/simple/ MyPackage`

source: For Linux Distributions
fr: Pour les distribution Linux

source: Creating a Linux distro package is arguably the "right way" to distribute code on Linux.
fr: Créer un paquet pour distribution Linux est sans doute la "bonne manière" de distribuer votre code sous Linux.

source: Because a distribution package doesn't include the Python interpreter, it makes the download and install about 2MB smaller than :ref:`freezing your application <freezing-your-code-ref>`.
fr: Parce qu'un paquet de distribution n'inclue pas l'interpréteur Python, il rend le téléchargement et l'installation environ 2MB plus petit que :ref:`le gel de votre application <freezing-your-code-ref>`.

source: Also, if a distribution releases a new security update for Python, then your application will automatically start using that new version of Python.
fr: En outre, si une distribution met à disposition une nouvelle mise à jour de sécurité pour Python, votre application commencera automatiquement à utiliser cette nouvelle version de Python.

source: The bdist_rpm command makes `producing an RPM file <https://docs.python.org/3/distutils/builtdist.html#creating-rpm-packages>`_ for use by distributions like Red Hat or SuSE is trivially easy.
fr: La commande bdist_rpm rend triviale `la production d'un fichier RPM <https://docs.python.org/3/distutils/builtdist.html#creating-rpm-packages>`_ pour l'utilisation par des distributions comme Red Hat ou SuSE.

source: However, creating and maintaining the different configurations required for each distribution's format (e.g. .deb for Debian/Ubuntu, .rpm for Red Hat/Fedora, etc) is a fair amount of work. If your code is an application that you plan to distribute on other platforms, then you'll also have to create and maintain the separate config required to freeze your application for Windows and OSX. It would be much less work to simply create and maintain a single config for one of the cross platform :ref:`freezing tools <freezing-your-code-ref>`, which will produce stand-alone executables for all distributions of Linux, as well as Windows and OSX.
fr: Cependant, créer et maintenir les différentes configurations requises pour chaque format de distribution (par exemple .deb pour Debian/Ubuntu, .rpm pour Red Hat/Fedora, etc) est une bonne quantité de travail. Si votre code est une application que vous envisagez de distribuer sur d'autres plates-formes, alors vous aurez également à créer et maintenir la configuration séparée nécessaire pour geler votre application pour Windows et OSX. Ce serait beaucoup moins de travail de simplement créer et maintenir une seule configuration pour un des :ref:`outils de freezing <freezing-your-code-ref>` multi-plateformes, qui va produire des exécutables autonomes pour toutes les distributions de Linux, ainsi que Windows et OSX.

source: Creating a distribution package is also problematic if your code is for a version of Python that isn't currently supported by a distribution. Having to tell *some versions* of Ubuntu end-users that they need to add `the 'dead-snakes' PPA <https://launchpad.net/~fkrull/+archive/ubuntu/deadsnakes>`_ using `sudo apt-repository` commands before they can install your .deb file makes for an extremely hostile user experience. Not only that, but you'd have to maintain a custom equivalent of these instructions for every distribution, and worse, have your users read, understand, and act on them.
fr: Créer un paquet de distribution est également problématique si votre code est pour une version de Python qui n'est pas supportée par une distribution. Avoir à dire à des utilisateurs finaux de *certaines versions* d'Ubuntu qu'ils ont besoin d'ajouter `le PPA 'dead-snakes' <https://launchpad.net/~fkrull/+archive/ubuntu/deadsnakes>`_ en utilisant la commande `sudo apt-repository` avant de pouvoir installer votre fichier .deb rend l'expérience hostile à l'utilisateur. Non seulement cela, mais vous auriez à maintenir un équivalent personnalisé de ces instructions pour chaque distribution, et pire encore, à demander à vos utilisateurs de lire, de comprendre et d'agir sur eux.

source: Having said all that, here's how to do it:
fr: Cela dit, voici comment faire:

source: `Debian and Ubuntu <http://www.debian.org/doc/packaging-manuals/python-policy/>`_
fr: `Debian et Ubuntu <http://www.debian.org/doc/packaging-manuals/python-policy/>`_

source: Useful Tools
fr: Outils utiles
